{"id": "9922980f96a3", "title": "Fandango hiring Sr Product Manager - Fandango in Orlando, FL", "company": "Fandango", "location": "Remote", "salary_range": null, "experience_required": "Senior", "skills_mentioned": ["product strategy", "jira", "agile", "scrum", "KPIs"], "industry": "e-commerce", "description": "Company DescriptionVERSANT, Comcast Corporation’s (NASDAQ: CMCSA) planned spin-off, will be a leading independent publicly traded media company comprised of most of NBCUniversal’s cable television networks, including USA Network, CNBC, MSNBC, Oxygen, E!, SYFY and Golf Channel along with complementary digital assets Fandango, Rotten Tomatoes, GolfNow, GolfPass, and SportsEngine. The well-capitalized company will have significant scale as a pure-play set of assets anchored by leading news, sports and entertainment content. The spin-off is expected to be completed during 2025, subject to the satisfaction of customary conditions.Business OverviewAt VERSANT Media’s Sports & Entertainment Digital Products division, we’re driven by a shared mission: to innovate, create unforgettable experiences, and connect with fans through the power of technology. Our diverse portfolio brings together industry-leading platforms that serve millions of users across the sports and entertainment landscape.In sports, we empower over 30 million players, coaches, administrators, and fans in 40 countries through more than 25 digital products. These include SportsEngine, the largest youth sports club, league, and team management platform; SportsEngine Play, the first-ever streaming service dedicated to youth and amateur sports; GolfNow, the top online tee time marketplace and golf course operations technology provider; and GolfPass, the ultimate golf membership that delivers exclusive content, tee time benefits, expert instruction, and more.In entertainment, we reach over 50 million movie and TV fans through our trusted digital brands. Our platforms support every stage of the fan journey – from discovering content to enjoying it on the big screen or at home. Our portfolio includes Fandango, the nation’s leading online movie ticketing service, partnering with more than 31,000 U.S. movie screens; Rotten Tomatoes, the iconic destination for movie and TV reviews; and Fandango at Home (formerly Vudu), our on-demand streaming service offering more than 250,000 titles, including new releases, next-day TV, and the largest selection of 4K UHD content in the industry.Together, we’re shaping the future of how people experience the sports they play and the stories they love.This opportunity is within our Fandango group – a collection of trusted entertainment brands that guide over 50 million movie and TV fans throughout their viewing journey. Whether it’s purchasing tickets to their favorite blockbusters through Fandango, reading trusted reviews on Rotten Tomatoes, or streaming the latest releases at home via Fandango at Home, our platforms help audiences find, watch, and enjoy content with ease. Our team thrives on shaping how people discover and experience entertainment, one screen at a timeJob DescriptionAbout the RoleFandango is seeking a dynamic and strategic Senior Product Manager to lead the development of products that power and scale our partnerships with third-party companies. As part of the Fandango Ticketing team, you’ll shape the systems and services that fuel our partner ecosystem—delivering seamless integrations, co-branded experiences, and new revenue opportunities.In this role, you’ll collaborate with engineering, design, business development, marketing, and other cross-functional teams to define product requirements and deliver best-in-class experiences for both our users and partners. You’ll report to the Senior Director of Product Management within the Ticketing Discovery team, driving strategy and execution of scalable solutions that extend Fandango’s reach through third-party platforms.If you thrive on solving complex problems, building products that scale, and making a tangible impact—and you’re passionate about entertainment and digital innovation—this is the role for you.What You'll DoAs a Sr. Product Manager on our team, you will:Define and Deliver: Craft clear, comprehensive product requirements for a suite of features, prioritizing the backlog in alignment with the product strategy and business objectives.Enable Partnerships: Collaborate closely with Business Development and Partnerships teams to understand partner needs and translate them into scalable, impactful product solutions.Align Stakeholders: Drive alignment across technical and non-technical teams, peers, and leadership around product vision, guiding principles, and priorities.Lead Cross-Functional Collaboration: Partner with BD, Marketing, Engineering, Decision Sciences, Finance, Exhibitor Relations, Customer Service, and other Product leads to identify opportunities, solve problems, and prioritize initiatives.Discover & Innovate: Identify partner needs emerging tech trends, and market opportunities to deliver actionable, forward-thinking solutions.Measure Success: Define key performance indicators (KPIs), analyze both quantitative and qualitative data, and use insights to inform product decisions and optimize outcomes.Own the Lifecycle: Guide products from concept through launch and iteration, ensuring continuous improvement and measurable value delivery.Experiment & Learn: Form hypotheses and lead experimentation to validate ideas, improve KPIs, and evolve the product.Drive the Roadmap: Shape and execute roadmap initiatives that deliver tangible user and business impact.QualificationsWhat We're Looking For6+ years of product management experience, with a strong track record of delivering impactful digital products.Experience in media, entertainment, e-commerce, or technology industries is a plus.Demonstrated success in launching products that support external partners or clients, with a focus on scalability and user experience.Strong technical acumen, including hands-on experience with APIs, SDKs, and platform architecture.Bachelor’s degree or equivalent work experience; a background in Computer Science or Engineering is a plus.Proven ability to conceptualize, manage, and optimize products throughout their lifecycle.Skilled in communicating effectively with both technical and non-technical audiences, including executive stakeholders.Collaborative mindset with the ability to build strong relationships across departments and maintain a positive, professional tone.Excellent organizational and prioritization skills, with the ability to manage multiple initiatives in a fast-paced environment.Strong analytical and problem-solving abilities, with a data-driven approach to evolving product strategy.High attention to detail and a commitment to delivering quality.Self-starter mentality with a willingness to take ownership and drive initiatives to completion.Familiarity with test-driven and behavior-driven development, as well as agile methodologies like SCRUM; experience with JIRA preferred.A genuine passion for entertainment and a desire to create engaging experiences for fans and partners.Fully Remote: This position has been designated as fully remote, meaning that the position is expected to be performed from a non-NBCUniversal worksite, most commonly an employee’s residence.Additional InformationAs part of our selection process, external candidates may be required to attend an in-person interview with an NBCUniversal employee at one of our locations prior to a hiring decision. NBCUniversal's policy is to provide equal employment opportunities to all applicants and employees without regard to race, color, religion, creed, gender, gender identity or expression, age, national origin or ancestry, citizenship, disability, sexual orientation, marital status, pregnancy, veteran status, membership in the uniformed services, genetic information, or any other basis protected by applicable law.If you are a qualified individual with a disability or a disabled veteran and require support throughout the application and/or recruitment process as a result of your disability, you have the right to request a reasonable accommodation. You can submit your request to AccessibilitySupport@nbcuni.com.Although you'll be hired as an NBCU employee, your employment and the responsibilities associated with this job likely will transition to Versant in the future. By joining at this pivotal time, you'll be a part of this exciting company as it takes shape.", "apply_url": "https://www.linkedin.com/jobs/view/sr-product-manager-fandango-at-fandango-4282847348", "source": "linkedin_rss_primary", "posted_date": "2025-09-05T09:24:37+00:00", "expires_date": null, "scraped_at": "2025-09-05T05:53:22.415881", "raw_data": {"entry_id": "a7598a4b2645ca2571790d65bd0b9aba", "tags": [], "author": "LinkedIn"}}
{"id": "aec1f62f71a0", "title": "Palo Alto Networks hiring Senior Product Manager (IoT) in Santa Clara, CA", "company": "Palo Alto Networks", "location": "Clara, CA", "salary_range": null, "experience_required": "7 years of experience", "skills_mentioned": ["product strategy", "competitive analysis", "go-to-market"], "industry": "healthtech", "description": "Our MissionAt Palo Alto Networks® everything starts and ends with our mission:Being the cybersecurity partner of choice, protecting our digital way of life.We have the vision of a world where each day is safer and more secure than the one before. These aren’t easy goals to accomplish – but we’re not here for easy. We’re here for better. We are a company built on the foundation of challenging and disrupting the way things are done, and we’re looking for innovators who are as committed to shaping the future of cybersecurity as we are.Our Approach to WorkWe lead with personalization and choice in all of our people programs. We have disrupted the traditional view that all employees have the same needs and wants. We offer our employees the opportunity to choose what works best for them as often as possible - from your wellbeing support to your growth and development, and beyond!At Palo Alto Networks, we believe in the power of collaboration and value in-person interactions. This is why our employees generally work from the office with some flexibility offered where needed. This setup fosters casual conversations, problem-solving, and trusted relationships. While details may evolve, our goal is to create an environment where innovation thrives, with office-based teams coming together three days a week to collaborate on the industry’s best cybersecurity solutions together!Job DescriptionYour CareerWe’re seeking a strategic and execution-driven Product Manager to shape and elevate our product experience. In this role, you’ll define new features, own core product areas, and lead cross-functional collaboration to deliver customer-focused solutions that set us apart in the market.The ideal candidate brings deep experience in one or more of the following areas: Endpoint, Vulnerability, Network Security, IoT/OT, or Cloud product portfolios.. You’ve a systems mindset and equally comfortable diving into technical discussions with engineering, as well as leading customer-facing presentations.Success in this role demands agility, excellent time management, and the ability to thrive in Palo Alto Networks’ fast-paced environment.Your ImpactDefine and communicate the product strategy and roadmap, ensuring alignment with business goals and market trends.Translate customer needs and technical considerations into clear business and functional requirements across the product portfolio.Partner with UX to craft intuitive user experiences, focusing on workflows and dashboards that drive engagement and satisfaction.Collaborate with engineering, design, and GTM teams throughout the product lifecycle—from concept to launch—to deliver high-quality releases.Prioritize product initiatives based on customer insights, business value, and technical feasibility.Lead go-to-market readiness by working closely with Product Marketing, Sales, and Customer Success teams.Serve as the voice of the customer by validating features, testing builds, and guiding post-launch iterations.Stay ahead of emerging trends in the Managed/Unmanaged Device and OT/IoT security landscape through ongoing research and competitive analysis.Act as a product evangelist for our AI/Deep Learning/ ML based Device Security solution, articulating the product vision and competitive differentiators to internal stakeholders, partners, and customers.QualificationsYour Experience5–7 years of experience in Cybersecurity, Network Security (e.g., NGFWs, NAC), Vulnerability Management, or Endpoint Security (across IoT, OT, and IT domains), with at least 4 years in Product Management.Proven ability to translate business requirements into scalable product deliverables, working closely with world-class engineering teams.Creative, out-of-the-box thinker with a strong sense of market differentiation and innovation.Demonstrated success collaborating with cross-functional stakeholders — including Engineering, Sales, Marketing, and Go-to-Market teams — to deliver high-impact outcomes.Exceptional interpersonal skills with the ability to build alignment across diverse teams and partners.Skilled in tracking cross-team deliverables, assessing risks, and managing resources and timelines to keep projects on schedule.Hands-on experience managing day-to-day product delivery operations; leadership in complex or large-scale project execution is a plus.Highly organized with strong attention to detail and a disciplined approach to information gathering and communication.Familiarity with building API-based integrations in partnership with technical stakeholders.Strong written and verbal communication skills, with the ability to deliver compelling presentations.Proficiency in data-driven decision-making using Excel or Google Sheets.Bonus: Industry familiarity in Healthcare, Manufacturing, Transportation, Building Management Systems (BMS), or Utilities and experience working w/ OEMs such as GE, Cerner, Siemens, Rockwell, Yokogawa.Education: BS/MS in Computer Science, Engineering, or a related technical or business discipline—or equivalent practical experience.Additional InformationThe TeamWorking at a high-tech cybersecurity company within Information Technology is a once-in-a-lifetime opportunity. You’ll join the brightest minds in technology, creating, building, and supporting tools and enabling our global teams on the front line of defense against cyberattacks.We’re connected by one mission but driven by the impact of that mission and what it means to protect our way of life in the digital age. Join a dynamic and fast-paced team of people who feel excited by the prospect of a challenge and feel a thrill at resolving technical gaps that inhibit productivity.Our CommitmentWe’re trailblazers that dream big, take risks, and challenge cybersecurity’s status quo. It’s simple: we can’t accomplish our mission without diverse teams innovating, together.We are committed to providing reasonable accommodations for all qualified individuals with a disability. If you require assistance or accommodation due to a disability or special need, please contact us at accommodations@paloaltonetworks.com.Palo Alto Networks is an equal opportunity employer. We celebrate diversity in our workplace, and all qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or other legally protected characteristics.All your information will be kept confidential according to EEO guidelines.The compensation offered for this position will depend on qualifications, experience, and work location. For candidates who receive an offer at the posted level, the starting base salary (for non-sales roles) or base salary + commission target (for sales/commissioned roles) is expected to be between $142,000/yr to $225,000/yr. The offered compensation may also include restricted stock units and a bonus. A description of our employee benefits may be found here.Our CommitmentWe’re problem solvers that take risks and challenge cybersecurity’s status quo. It’s simple: we can’t accomplish our mission without diverse teams innovating, together.We are committed to providing reasonable accommodations for all qualified individuals with a disability. If you require assistance or accommodation due to a disability or special need, please contact us at accommodations@paloaltonetworks.com.Palo Alto Networks is an equal opportunity employer. We celebrate diversity in our workplace, and all qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or other legally protected characteristics.All your information will be kept confidential according to EEO guidelines.Is role eligible for Immigration Sponsorship?: Yes", "apply_url": "https://www.linkedin.com/jobs/view/senior-product-manager-iot-at-palo-alto-networks-4296146251", "source": "linkedin_rss_primary", "posted_date": "2025-09-05T01:27:36+00:00", "expires_date": null, "scraped_at": "2025-09-05T05:53:22.417784", "raw_data": {"entry_id": "ee81492b4a766f9fc9a32c6fdbf0438f", "tags": [], "author": "LinkedIn"}}
{"id": "f12d7d15706c", "title": "BILL hiring Principal Product Manager- Platform Identity & Multi-Entity in San Jose, CA", "company": "BILL", "location": "Jose, CA", "salary_range": null, "experience_required": "Principal", "skills_mentioned": [], "industry": "fintech", "description": "Innovate with purposeAt BILL, we believe in empowering the businesses that drive our economy. By replacing outdated financial processes with innovative tools, we help businesses—from startups to established brands—make smarter decisions and gain control of their operations. And we don’t stop there: we’re creating the future of financial automation so businesses can spend more time on what matters.Working here means you become part of a vision-driven team that’s ready to tackle challenges and build cutting-edge solutions. We value purpose, drive, and curiosity—and we thrive in a fast-paced, ever-changing environment. Whether in one of our offices in San Jose, CA, Draper, UT, or working remotely, BILLders collaborate to deliver real impact for businesses that need more time in their busy weeks.BILL builds high performing teams and we seek to hire the best talent for every role. We're committed to building a workplace that fosters inclusion and diverse perspectives, valuing each person’s unique skills and experiences. We’d love to hear from you—you might be just what we’re looking for, whether in this role or another.✨ Let’s give businesses more time for what matters.About This RoleBILL is on a mission to make it simple to connect and do business. Our platform serves millions of small and mid-sized businesses, and we are rapidly expanding our product offerings through innovation and acquisition. The Platform Identity & Multi-Entity team is at the core of this mission, responsible for building the foundational services that govern how our customers access, manage, and interact with their organizations across our entire product ecosystem.As a Principal Product Manager, you will own the strategy and execution for some of our most complex and critical platform domains: Identity (Authentication & Authorization), Organization Services, and our Multi-Entity architecture. You will be tasked with solving the technical and customer experience challenges that arise from a multi-product, multi-system environment. Your work will directly impact developer efficiency, system integrity, and our ability to deliver a seamless, secure, and unified experience to our customers.This is a high-impact, strategy-focused role that requires deep technical product management expertise, a passion for solving complex systems-level problems, and the ability to lead cross-functional teams to deliver foundational change.What You’ll DoDefine and Drive Strategy: Develop and champion a multi-year vision and roadmap for BILL's identity and entity frameworks to create a scalable foundation for a multi-product ecosystem.Lead Foundational Change: Drive critical initiatives to consolidate disparate systems for identity, authentication, authorization, and user management into a single, secure, and modern platform.Champion the User Experience: Partner with Design and Research to map the end-to-end customer journey, identifying and solving the most critical pain points related to access and organization management.Collaborate and Influence: Lead and align cross-functional teams including Product, Engineering, Design, and Security to deliver foundational change across the organization.Drive Technical Product Excellence: Author high-quality technical requirements and product briefs, guiding engineering as the subject matter expert on our identity models to build robust, scalable solutions.What We’re Looking ForWe’re seeking a leader who sees platform development as more than a technical discipline—it's a mission to create a simple and cohesive experience for our customers. You bring:Customer First: A deep empathy for users navigating complex systems, with a passion for simplifying their experience.Systems Thinker: The ability to deconstruct complex, fragmented systems and architect a clear, unified path forward.Desire for Impact: The drive to solve foundational problems that unlock future growth and innovation for the entire company.Collaborative Spirit: A talent for building consensus and leading diverse, senior teams to tackle complex technical challenges.Growth Mindset: Enthusiasm for navigating technical ambiguity and a commitment to continuous learning in the identity space.Your Background8+ years of product management experience, with at least 4+ years in a technical, platform-focused role (e.g., Identity, IAM, APIs, or similar).Deep expertise in modern identity and access management (IAM) concepts such as AuthN, AuthZ, SSO, MFA, and RBAC.Proven success leading large-scale, multi-year platform initiatives from concept through to launch in complex, ambiguous environments.Exceptional communication and leadership skills, with experience aligning senior technical and business stakeholders.Experience with M&A product integration, FinTech, or products serving SMBs is a strong plus.If you're passionate about building foundational platforms and want to make a lasting impact in the fintech space, we'd love to chat.The estimated salary range for this role is noted below for our San Jose based role. Our ranges for each role and job level are based on a variety of factors including candidate experience, expertise, and geographic location and may vary from the amounts listed above. The role is also eligible for a competitive benefits package that includes: medical, dental, vision, life and disability insurance, 401(k) retirement plan, flexible spending & health savings account, paid holidays, paid time off, and other company benefits.San Jose pay range$216,900—$271,200 USDThe estimated base salary range for this role is noted below for our office location in Draper, UT. Additionally, this role is eligible to participate in BILL’s bonus and equity plan. Our ranges for each role and job level are based on a variety of factors including candidate experience, expertise, and geographic location and may vary from the amounts listed above. The role is also eligible for a competitive benefits package that includes: medical, dental, vision, life and disability insurance, 401(k) retirement plan, flexible spending & health savings account, paid holidays, paid time off, and other company benefits.Draper UT pay range$184,400—$230,500 USDWhat’s in it for you? Redefining how businesses automate their work is a fast-paced, exciting, and fun environment. But we also have benefits and perks to ensure the magic isn’t only experienced by our customers, but by our employees as well.Here is a preview of some of the amazing benefits here at BILL:100% paid employee health, dental, and vision plans (choose HMO, PPO, or HDHP)HSA & FSA accounts Life Insurance, Long & Short-term disability coverageEmployee Assistance Program (EAP)11+ Observed holidays and wellness days and flexible time off Employee Stock Purchase Program with employee discountsWellness & Fitness initiativesEmployee recognition and referral programsAnd much moreDon’t believe us? Check out our culture, benefits, and teams on our career site, LinkedIn Life, or YouTube pages.BILL is an Equal Opportunity Employer. We believe our best ideas come from the unique stories, perspectives, and experiences of our team members. We welcome people of all backgrounds, abilities, and identities to bring their authentic selves and contribute to our culture.We are committed to a transparent, inclusive hiring process that reflects our values. If you need accommodations at any stage, please contact interviewaccommodations@hq.bill.com.Our Applicant Privacy Notice describes how BILL treats the personal information it receives from applicants.", "apply_url": "https://www.linkedin.com/jobs/view/principal-product-manager-platform-identity-multi-entity-at-bill-4296176857", "source": "linkedin_rss_secondary", "posted_date": "2025-09-05T06:33:33+00:00", "expires_date": null, "scraped_at": "2025-09-05T05:53:22.849097", "raw_data": {"entry_id": "c02db86f92293368e41881a7ad1b70f1", "tags": [], "author": "LinkedIn"}}
{"id": "e605041e0b93", "title": "BILL hiring Principal Product Manager- Platform Identity & Multi-Entity in Draper, UT", "company": "BILL", "location": "Draper, UT", "salary_range": null, "experience_required": "Principal", "skills_mentioned": [], "industry": "fintech", "description": "Innovate with purposeAt BILL, we believe in empowering the businesses that drive our economy. By replacing outdated financial processes with innovative tools, we help businesses—from startups to established brands—make smarter decisions and gain control of their operations. And we don’t stop there: we’re creating the future of financial automation so businesses can spend more time on what matters.Working here means you become part of a vision-driven team that’s ready to tackle challenges and build cutting-edge solutions. We value purpose, drive, and curiosity—and we thrive in a fast-paced, ever-changing environment. Whether in one of our offices in San Jose, CA, Draper, UT, or working remotely, BILLders collaborate to deliver real impact for businesses that need more time in their busy weeks.BILL builds high performing teams and we seek to hire the best talent for every role. We're committed to building a workplace that fosters inclusion and diverse perspectives, valuing each person’s unique skills and experiences. We’d love to hear from you—you might be just what we’re looking for, whether in this role or another.✨ Let’s give businesses more time for what matters.About This RoleBILL is on a mission to make it simple to connect and do business. Our platform serves millions of small and mid-sized businesses, and we are rapidly expanding our product offerings through innovation and acquisition. The Platform Identity & Multi-Entity team is at the core of this mission, responsible for building the foundational services that govern how our customers access, manage, and interact with their organizations across our entire product ecosystem.As a Principal Product Manager, you will own the strategy and execution for some of our most complex and critical platform domains: Identity (Authentication & Authorization), Organization Services, and our Multi-Entity architecture. You will be tasked with solving the technical and customer experience challenges that arise from a multi-product, multi-system environment. Your work will directly impact developer efficiency, system integrity, and our ability to deliver a seamless, secure, and unified experience to our customers.This is a high-impact, strategy-focused role that requires deep technical product management expertise, a passion for solving complex systems-level problems, and the ability to lead cross-functional teams to deliver foundational change.What You’ll DoDefine and Drive Strategy: Develop and champion a multi-year vision and roadmap for BILL's identity and entity frameworks to create a scalable foundation for a multi-product ecosystem.Lead Foundational Change: Drive critical initiatives to consolidate disparate systems for identity, authentication, authorization, and user management into a single, secure, and modern platform.Champion the User Experience: Partner with Design and Research to map the end-to-end customer journey, identifying and solving the most critical pain points related to access and organization management.Collaborate and Influence: Lead and align cross-functional teams including Product, Engineering, Design, and Security to deliver foundational change across the organization.Drive Technical Product Excellence: Author high-quality technical requirements and product briefs, guiding engineering as the subject matter expert on our identity models to build robust, scalable solutions.What We’re Looking ForWe’re seeking a leader who sees platform development as more than a technical discipline—it's a mission to create a simple and cohesive experience for our customers. You bring:Customer First: A deep empathy for users navigating complex systems, with a passion for simplifying their experience.Systems Thinker: The ability to deconstruct complex, fragmented systems and architect a clear, unified path forward.Desire for Impact: The drive to solve foundational problems that unlock future growth and innovation for the entire company.Collaborative Spirit: A talent for building consensus and leading diverse, senior teams to tackle complex technical challenges.Growth Mindset: Enthusiasm for navigating technical ambiguity and a commitment to continuous learning in the identity space.Your Background8+ years of product management experience, with at least 4+ years in a technical, platform-focused role (e.g., Identity, IAM, APIs, or similar).Deep expertise in modern identity and access management (IAM) concepts such as AuthN, AuthZ, SSO, MFA, and RBAC.Proven success leading large-scale, multi-year platform initiatives from concept through to launch in complex, ambiguous environments.Exceptional communication and leadership skills, with experience aligning senior technical and business stakeholders.Experience with M&A product integration, FinTech, or products serving SMBs is a strong plus.If you're passionate about building foundational platforms and want to make a lasting impact in the fintech space, we'd love to chat.The estimated salary range for this role is noted below for our San Jose based role. Our ranges for each role and job level are based on a variety of factors including candidate experience, expertise, and geographic location and may vary from the amounts listed above. The role is also eligible for a competitive benefits package that includes: medical, dental, vision, life and disability insurance, 401(k) retirement plan, flexible spending & health savings account, paid holidays, paid time off, and other company benefits.San Jose pay range$216,900—$271,200 USDThe estimated base salary range for this role is noted below for our office location in Draper, UT. Additionally, this role is eligible to participate in BILL’s bonus and equity plan. Our ranges for each role and job level are based on a variety of factors including candidate experience, expertise, and geographic location and may vary from the amounts listed above. The role is also eligible for a competitive benefits package that includes: medical, dental, vision, life and disability insurance, 401(k) retirement plan, flexible spending & health savings account, paid holidays, paid time off, and other company benefits.Draper UT pay range$184,400—$230,500 USDWhat’s in it for you? Redefining how businesses automate their work is a fast-paced, exciting, and fun environment. But we also have benefits and perks to ensure the magic isn’t only experienced by our customers, but by our employees as well.Here is a preview of some of the amazing benefits here at BILL:100% paid employee health, dental, and vision plans (choose HMO, PPO, or HDHP)HSA & FSA accounts Life Insurance, Long & Short-term disability coverageEmployee Assistance Program (EAP)11+ Observed holidays and wellness days and flexible time off Employee Stock Purchase Program with employee discountsWellness & Fitness initiativesEmployee recognition and referral programsAnd much moreDon’t believe us? Check out our culture, benefits, and teams on our career site, LinkedIn Life, or YouTube pages.BILL is an Equal Opportunity Employer. We believe our best ideas come from the unique stories, perspectives, and experiences of our team members. We welcome people of all backgrounds, abilities, and identities to bring their authentic selves and contribute to our culture.We are committed to a transparent, inclusive hiring process that reflects our values. If you need accommodations at any stage, please contact interviewaccommodations@hq.bill.com.Our Applicant Privacy Notice describes how BILL treats the personal information it receives from applicants.", "apply_url": "https://www.linkedin.com/jobs/view/principal-product-manager-platform-identity-multi-entity-at-bill-4296177491", "source": "linkedin_rss_secondary", "posted_date": "2025-09-05T06:33:33+00:00", "expires_date": null, "scraped_at": "2025-09-05T05:53:22.851385", "raw_data": {"entry_id": "24c6e5a72dcf556b97f57d68f3a972c9", "tags": [], "author": "LinkedIn"}}
{"id": "5fc3257c6032", "title": "SoTalent hiring Product Manager in New York, United States", "company": "SoTalent", "location": "York, NY", "salary_range": null, "experience_required": "Senior", "skills_mentioned": ["analytics", "pricing"], "industry": "fintech", "description": "Senior Product Manager – Lending Technology Transformation📍 Hybrid | New York, NY | Wilmington, DE | Baltimore, MD💰 $120,000 – $140,000 base + performance incentivesAbout UsWe are a nationwide financial services organization committed to providing responsible lending solutions for millions of customers. With more than a century of history, we continue to evolve by investing in innovative technology, data, and digital experiences that empower people to reach their financial goals.The RoleWe are searching for a Senior Product Manager to guide the modernization of our core lending platforms. This leader will define strategy, shape product direction, and partner closely with engineering and business leaders to deliver scalable platforms in credit, pricing, and advanced analytics. Your work will directly influence growth, cost efficiency, and customer satisfaction across our business.Key ResponsibilitiesDesign and own the product roadmap, ensuring priorities reflect both short-term wins and long-term strategy.Define clear objectives and success measures, aligning your team’s work to broader business goals.Drive the product lifecycle from vision through delivery, including backlog management, release planning, and risk oversight.Partner with engineering and data leaders to ensure technology solutions meet business needs and scale effectively.Communicate progress, challenges, and outcomes to senior stakeholders with a clear, data-driven narrative.Encourage a culture of innovation, accountability, and cross-functional collaboration.What You’ll Bring5+ years of progressive experience in product management, product operations, or technology strategy.Track record of delivering complex, enterprise-level platforms in fintech, banking, or related industries.Strong ability to translate strategy into actionable plans and measurable outcomes.Comfort engaging with executives, business teams, and technical partners alike.Analytical mindset and passion for building customer-centric solutions.Bachelor’s degree in engineering, technology, or equivalent practical experience.Why You’ll Love Working HereBase salary $120K–$140K depending on experience and locationPerformance bonus and employee stock purchase planComprehensive health, dental, vision, life and disability coverage401(k) with employer matchTuition reimbursement, paid time off, holidays, and volunteer daysA collaborative culture that encourages growth, innovation, and impactJoin us and play a critical role in shaping the future of lending technology while building products that make a tangible difference in people’s lives.", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-at-sotalent-4294471570", "source": "linkedin_rss_primary", "posted_date": "2025-09-05T14:34:53+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:06.920490", "raw_data": {"entry_id": "cdfc25370cd9effe8e3b1119df59a3b5", "tags": [], "author": "LinkedIn"}}
{"id": "8c9215741575", "title": "FanDuel hiring Product Manager, Sportsbook in Jersey City, NJ", "company": "FanDuel", "location": "City, NJ", "salary_range": "$94,000 - $129,250", "experience_required": "5 years of experience", "skills_mentioned": ["analytics", "stakeholder management"], "industry": "healthtech", "description": "About FanduelFanDuel Group is the premier mobile gaming company in the United States and Canada. FanDuel Group consists of a portfolio of leading brands across mobile wagering including: America’s #1 Sportsbook, FanDuel Sportsbook; its leading iGaming platform, FanDuel Casino; the industry’s unquestioned leader in horse racing and advance-deposit wagering, FanDuel Racing; and its daily fantasy sports product.In addition, FanDuel Group operates FanDuel TV, its broadly distributed linear cable television network and FanDuel TV+, its leading direct-to-consumer OTT platform. FanDuel Group has a presence across all 50 states, Canada, and Puerto Rico.The company is based in New York with US offices in Los Angeles, Atlanta, and Jersey City, as well as global offices in Canada and Scotland. The company’s affiliates have offices worldwide, including in Ireland, Portugal, Romania, and Australia.FanDuel Group is a subsidiary of Flutter Entertainment, the world's largest sports betting and gaming operator with a portfolio of globally recognized brands and traded on the New York Stock Exchange (NYSE: FLUT).THE POSITIONOur roster has an opening with your name on itFanDuel is seeking a Product Manager to support the planning and execution of successful product initiatives in the Live Sports Betting category. In this role, you will collaborate closely with Commercial, Marketing, Design, Research, Analytics, Engineering, and External Partners to deliver innovative products that meet customer needs and align with FanDuel’s business objectives. If you’re a strong product manager with a passion for Sports and delighting customers, this may be the role for you.Product Managers on the Sportsbook team take responsibility for discovery, planning, strategy, execution, and analysis of a significant segment of our portfolio, focusing on creating betting products our fans will love. They should be consumer-obsessed, understanding how to use both quantitative and qualitative data as well as product discovery and design techniques to make our experiences more fun and exciting, anticipating the next key feature that our fans want even before they know they want it.Initiatives will be a mix of back-end and front-end work, with a focus on using our cutting-edge technology to improve ease of use and generate excitement in the Live Sports Betting space.In addition to the specific responsibilities outlined above, employees may be required to perform other such duties as assigned by the Company. This ensures operational flexibility and allows the Company to meet evolving business needs.THE GAME PLANEveryone on our team has a part to playAssess product opportunities and contribute meaningfully to ideation and prioritization for new initiatives and productsInform, shape, and drive execution of product initiativesCollaborate with Commercial, Marketing, Design, Research, Analytics, Engineering, and Operational functions to ensure successful product deliveries and launchesEnsure transparency and alignment with organizational stakeholdersIdentify, prioritize, and execute post-launch optimizations and improvementsEstablish, track and report objectively on product performance metricsEstablish and maintain domain expertise on the product, market, and competitorsTHE STATSWhat we're looking for in our next teammateBachelor’s degree preferredMinimum of 5 years of experience as a Product Manager or similar roleProven track record of delivering successful and innovative productsExcellent numerical and analytical skills with the ability to interpret data quickly to inform the right decisionsA strong sense of ownership and accountability for goals and deliverablesDemonstrated success cross-functionally influencing teams without formal authorityAbility to handle multiple simultaneous projects while effectively balancing scope, resourcing, time, and qualityInterest in and knowledge of sports, casino and/or sports betting is valuable but not requiredExcellent critical thinking skillsExceptional written and verbal communication skillsStrong stakeholder management skillsPlayer BenefitsWe treat our team rightWe offer amazing benefits above and beyond the basics. We have an array of health plans to choose from (some as low as $0 per paycheck) that include programs for fertility and family planning, mental health support, and fitness benefits. We offer generous paid time off (PTO & sick leave), annual bonus and long-term incentive opportunities (based on performance), 401k with up to a 5% match, commuter benefits , pet insurance, and more - check out all our benefits here: FanDuel Total Rewards. *Benefits differ across location, role, and level.FanDuel is an equal opportunities employer and we believe, as one of our principles states, “We are One Team!”. As such, we are committed to equal employment opportunity regardless of race, color, ethnicity, ancestry, religion, creed, sex, national origin, sexual orientation, age, citizenship status, marital status, disability, gender identity, gender expression, veteran status, or any other characteristic protected by state, local or federal law. We believe FanDuel is strongest and best able to compete if all employees feel valued, respected, and included.The applicable salary range for this position is $94,000 - $129,250 USD, which is dependent on a variety of factors including relevant experience, location, business needs and market demand. This role may offer the following benefits: medical, vision, and dental insurance; life insurance; disability insurance; a 401(k) matching program; among other employee benefits. This role may also be eligible for short-term or long-term incentive compensation, including, but not limited to, cash bonuses and stock program participation. This role includes paid personal time off and 14 paid company holidays. FanDuel offers paid sick time in accordance with all applicable state and federal laws.It is unlawful in Massachusetts to require or administer a lie detector test as a condition of employment or continued employment. An employer who violates this law shall be subject to criminal penalties and civil liability.", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-sportsbook-at-fanduel-4269216495", "source": "linkedin_rss_primary", "posted_date": "2025-09-05T13:22:12+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:06.923729", "raw_data": {"entry_id": "47d61251dd418130c2042e0fc0869feb", "tags": [], "author": "LinkedIn"}}
{"id": "b12f6c661a27", "title": "FanDuel hiring Product Manager, Sportsbook in New York, NY", "company": "FanDuel", "location": "York, NY", "salary_range": "$94,000 - $129,250", "experience_required": "5 years of experience", "skills_mentioned": ["analytics", "stakeholder management"], "industry": "healthtech", "description": "About FanduelFanDuel Group is the premier mobile gaming company in the United States and Canada. FanDuel Group consists of a portfolio of leading brands across mobile wagering including: America’s #1 Sportsbook, FanDuel Sportsbook; its leading iGaming platform, FanDuel Casino; the industry’s unquestioned leader in horse racing and advance-deposit wagering, FanDuel Racing; and its daily fantasy sports product.In addition, FanDuel Group operates FanDuel TV, its broadly distributed linear cable television network and FanDuel TV+, its leading direct-to-consumer OTT platform. FanDuel Group has a presence across all 50 states, Canada, and Puerto Rico.The company is based in New York with US offices in Los Angeles, Atlanta, and Jersey City, as well as global offices in Canada and Scotland. The company’s affiliates have offices worldwide, including in Ireland, Portugal, Romania, and Australia.FanDuel Group is a subsidiary of Flutter Entertainment, the world's largest sports betting and gaming operator with a portfolio of globally recognized brands and traded on the New York Stock Exchange (NYSE: FLUT).THE POSITIONOur roster has an opening with your name on itFanDuel is seeking a Product Manager to support the planning and execution of successful product initiatives in the Live Sports Betting category. In this role, you will collaborate closely with Commercial, Marketing, Design, Research, Analytics, Engineering, and External Partners to deliver innovative products that meet customer needs and align with FanDuel’s business objectives. If you’re a strong product manager with a passion for Sports and delighting customers, this may be the role for you.Product Managers on the Sportsbook team take responsibility for discovery, planning, strategy, execution, and analysis of a significant segment of our portfolio, focusing on creating betting products our fans will love. They should be consumer-obsessed, understanding how to use both quantitative and qualitative data as well as product discovery and design techniques to make our experiences more fun and exciting, anticipating the next key feature that our fans want even before they know they want it.Initiatives will be a mix of back-end and front-end work, with a focus on using our cutting-edge technology to improve ease of use and generate excitement in the Live Sports Betting space.In addition to the specific responsibilities outlined above, employees may be required to perform other such duties as assigned by the Company. This ensures operational flexibility and allows the Company to meet evolving business needs.THE GAME PLANEveryone on our team has a part to playAssess product opportunities and contribute meaningfully to ideation and prioritization for new initiatives and productsInform, shape, and drive execution of product initiativesCollaborate with Commercial, Marketing, Design, Research, Analytics, Engineering, and Operational functions to ensure successful product deliveries and launchesEnsure transparency and alignment with organizational stakeholdersIdentify, prioritize, and execute post-launch optimizations and improvementsEstablish, track and report objectively on product performance metricsEstablish and maintain domain expertise on the product, market, and competitorsTHE STATSWhat we're looking for in our next teammateBachelor’s degree preferredMinimum of 5 years of experience as a Product Manager or similar roleProven track record of delivering successful and innovative productsExcellent numerical and analytical skills with the ability to interpret data quickly to inform the right decisionsA strong sense of ownership and accountability for goals and deliverablesDemonstrated success cross-functionally influencing teams without formal authorityAbility to handle multiple simultaneous projects while effectively balancing scope, resourcing, time, and qualityInterest in and knowledge of sports, casino and/or sports betting is valuable but not requiredExcellent critical thinking skillsExceptional written and verbal communication skillsStrong stakeholder management skillsPlayer BenefitsWe treat our team rightWe offer amazing benefits above and beyond the basics. We have an array of health plans to choose from (some as low as $0 per paycheck) that include programs for fertility and family planning, mental health support, and fitness benefits. We offer generous paid time off (PTO & sick leave), annual bonus and long-term incentive opportunities (based on performance), 401k with up to a 5% match, commuter benefits , pet insurance, and more - check out all our benefits here: FanDuel Total Rewards. *Benefits differ across location, role, and level.FanDuel is an equal opportunities employer and we believe, as one of our principles states, “We are One Team!”. As such, we are committed to equal employment opportunity regardless of race, color, ethnicity, ancestry, religion, creed, sex, national origin, sexual orientation, age, citizenship status, marital status, disability, gender identity, gender expression, veteran status, or any other characteristic protected by state, local or federal law. We believe FanDuel is strongest and best able to compete if all employees feel valued, respected, and included.The applicable salary range for this position is $94,000 - $129,250 USD, which is dependent on a variety of factors including relevant experience, location, business needs and market demand. This role may offer the following benefits: medical, vision, and dental insurance; life insurance; disability insurance; a 401(k) matching program; among other employee benefits. This role may also be eligible for short-term or long-term incentive compensation, including, but not limited to, cash bonuses and stock program participation. This role includes paid personal time off and 14 paid company holidays. FanDuel offers paid sick time in accordance with all applicable state and federal laws.It is unlawful in Massachusetts to require or administer a lie detector test as a condition of employment or continued employment. An employer who violates this law shall be subject to criminal penalties and civil liability.", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-sportsbook-at-fanduel-4269211927", "source": "linkedin_rss_primary", "posted_date": "2025-09-05T13:18:57+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:06.924644", "raw_data": {"entry_id": "ec460fbbfca901184490d87dc482032d", "tags": [], "author": "LinkedIn"}}
{"id": "78bf4b19e157", "title": "Eudia hiring Product Manager in Palo Alto, CA", "company": "Eudia", "location": "Alto, CA", "salary_range": "$190,000 - $210,000", "experience_required": null, "skills_mentioned": ["product strategy"], "industry": "saas", "description": "About EudiaEudia is redefining the future of legal work with AI-powered Augmented Intelligence, enabling Fortune 500 legal teams to move faster, manage risk more effectively, and unlock new business value. Backed by $105M in Series A funding led by General Catalyst, we’re building a category-defining platform that blends AI-driven automation with human expertise, transforming legal from a cost center into a strategic growth driver.At Eudia, we move fast. Unlike traditional enterprise software, our teams ship solutions in days, not months—delivering real impact for some of the world’s largest companies, including Cargill, Coherent, DHL, and Duracell. We’re solving one of the most complex, unsolved challenges in AI: bringing trust, accuracy, and security to legal automation.We’re a team of builders, operators, and problem-solvers who are passionate about reshaping an industry that has long been resistant to change. If you’re looking for a place where you’ll be challenged, take ownership from day one, and work alongside some of the brightest minds in AI and legal —we’d love to meet you.About The RoleWe have signed several Fortune 500 companies as customers and are going live with Pilots followed by roll-outs of several solutions. These solutions are designed to create 8 figures of value to each of our customers, through changing the way that work is done.As a Product Manager, you will be responsible for partnering with world-class AI engineers to deliver on solutions that blow our customers’ minds and create real value for the business. You will work directly with customers to understand the opportunity for AI solutions and deliver solutions that make a meaningful impact. To execute on this vision, you will work directly with Software Engineers, who leverage our platform capabilities to develop solutions uniquely tailored for our customers. You are the lynchpin between our customers and our engineers.Key ResponsibilitiesRepresent the customer to engineeringDeeply understand customer priorities and pain points by capturing feedback and analyzing dataTranslate customer priorities and feedback to customer-specific solutionsEnsure timely delivery of customer-specific solutions from Tiger engineeringProvide inputs to Platform Engineering on consistent customer themes or need for platform capabilities to inform platform engineering prioritiesBring knowledge of Eudia’s capabilities to customers to inform what solutions are built and delivered to achieve value creationEnsure scope Eudia is committing to customers is aligned to our capabilities and product strategy / roadmapRepresent and showcase solutions to customers through demos and trainingsQualifications5+ Years of product experienceExperience working on enterprise products and/or with enterprise customersMBA or tier-1 consulting firm experience a plus.Experience working directly with engineering, design and product management. Customer-facing presentation skills and experienceStrong organizational, time management, and verbal and written communication skillsAbility to manage multiple projects and work streams simultaneouslyProficiency in GSuite and Microsoft toolsPassion for AI transformation, legal technology or disruptive service modelsBachelor's or Master's in Computer Science, Engineering, Mathematics, Statistics, Business, or a related field.Why You’ll Love Working HereImpactful Work: Be part of a team that’s at the forefront of AI innovation.Growth Opportunities: Work in an environment that encourages professional growth and the exploration of new ideas.Dynamic Culture: Join a group of passionate, driven individuals who are committed to making a difference.$190,000 - $210,000 a yearThe posted salary range is based on our research for companies of our stage and size while in compliance with California law. However, this is just a base compensation range and we would encourage those who are interested to apply and have an initial discussion.If you’re ready to take on the challenge and make an impact in a rapidly evolving industry, we want to hear from you. Apply today with your resume and a cover letter explaining why you’re the perfect fit for this role.", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-at-eudia-4288097550", "source": "linkedin_rss_primary", "posted_date": "2025-09-05T11:44:44+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:06.928542", "raw_data": {"entry_id": "c8b3cac92201d1a4579c86360432dd3f", "tags": [], "author": "LinkedIn"}}
{"id": "426729037851", "title": "PathAI hiring Product Manager, AI Products in Boston, MA", "company": "PathAI", "location": "Manager, AI", "salary_range": null, "experience_required": "3+ years experience", "skills_mentioned": ["product strategy"], "industry": "healthtech", "description": "Who We ArePathAI is on a mission to improve patient outcomes with AI-powered pathology. We are transforming traditional pathology methods into powerful, new technologies. These innovations in pathology can help accelerate drug development, improve confidence in the accuracy of diagnosis, and get life-saving therapies to patients more quickly. At PathAI, you'll work with a diverse and talented team of people, who are dedicated to solving complex problems and making a huge impact.Where You FitWe're looking for a technical product manager to join our team and help support the execution of PathAI’s product roadmap. The AI Product Manager will work closely with machine learning, pathology, biomedical data science, clinical affairs, quality, regulatory, and business operations teams to ensure that product development goals are being met for successful delivery of a product. The successful candidate will be able to identify, build, and champion AI products in key strategic areas for PathAI.This role offers the opportunity to help define the product strategy of a fast growing, dynamic business.What You’ll DoContribute to the development of the roadmap for PathAI algorithm products within a key business unit or disease area, and own the execution of assigned initiatives.Collaborate with stakeholders to gather requirements, define priorities, and align on product direction.Support the development of business cases for new products, product extensions, or platform capabilities.Partner cross-functionally with product designers, engineers, and scientists to deliver high-quality solutions that meet user needs.Monitor product performance, gather feedback, and contribute to continuous improvement initiatives.What You Bring3+ years experience in product management (preferably bioinformatics, machine learning, or data science).Launch experience with algorithm-based products in life sciences and/or healthcare.Advanced degree in computational biology, biomedical engineering, biology, or related field preferredExperience contributing to the launch of AI-driven or software-based products.Strong collaboration skills and ability to work with cross-functional teams across technical and scientific domains.Curiosity and willingness to learn about oncology, pathology, and AI-powered products.We Want To Hear From YouAt PathAI, we are looking for individuals who are team players, are willing to do the work no matter how big or small it may be, and who are passionate about everything they do. If this sounds like you, even if you may not match the job description to a tee, we encourage you to apply. You could be exactly what we're looking for.PathAI is an equal opportunity employer, dedicated to creating a workplace that is free of harassment and discrimination. We base our employment decisions on business needs, job requirements, and qualifications — that's all. We do not discriminate based on race, gender, religion, health, personal beliefs, age, family or parental status, or any other status. We don't tolerate any kind of discrimination or bias, and we are looking for teammates who feel the same way.", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-ai-products-at-pathai-4286176266", "source": "linkedin_rss_primary", "posted_date": "2025-09-05T11:39:35+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:06.929057", "raw_data": {"entry_id": "8ca47fdf637acd54b95f6c9c4ed7e420", "tags": [], "author": "LinkedIn"}}
{"id": "4214c98dff3f", "title": "Scotiabank hiring Product Manager, Check Services in Tampa, FL", "company": "Scotiabank", "location": "Tampa, FL", "salary_range": null, "experience_required": "2+ year experience", "skills_mentioned": ["agile", "pricing"], "industry": "fintech", "description": "Requisition ID: 233107 Salary Range: 99,790.00 - 190,995.00Please note that the Salary Range shown is a guideline only. Salary offered may vary based on factors, including, but not limited to, the successful candidate’s relevant knowledge, skills, and experience.Join a purpose driven winning team, committed to results, in an inclusive and high-performing culture.Product Manager – Cash Management, Global Transaction Banking - Tampa, FLGlobal Transaction Banking (GTB) is the payments and transaction engine of Scotiabank. We support Corporate and Commercial clients with industry leading treasury management solutions coupled with a best-in-class service model, making it easy for our clients to do business with us.As our clients transform their operating models, expand globally and deploy digital capabilities their cash management needs are evolving. Boasting a unique global footprint, GTB’s comprehensive suite of innovative banking solutions help our business clients generate operational efficiencies, streamline treasury processes, simplify payments, improve working capital performance, and mitigate financial risk.At Scotiabank, we embrace your strengths, ideas, and ambitions. GTB is a fast-growing team with a focus on the Americas, particularly Canada, the U.S., Mexico, and we are seeking top tier talent to complement our organization.Join a purpose-driven winning team, committed to results, in an inclusive and high-performing culture.AccountabilitiesLeads and drives a customer focused culture throughout their team to deepen client relationships and leverage broader Bank relationships, systems and product knowledge.Lead a suite of US digital payment products focusing on check services, paper to digital transformation and partner integration to drive revenue growth and customer satisfaction by:Ensuring products are performing as expected and resolving issues that arise in a timely manner with updates to partners and escalations to management as requiredDetermining where product gaps may exist with respect to customer needs, competitive offerings, and trendsProviding subject matter expertise and thought leadership to partners as requiredReview financials, key performance indicators, and ensure profitability:Own the P&L of the productWork with the pricing and operations teams to drive revenues and improve efficienciesLead the delivery of approved projects:Overseeing the design and implementation of new digital payment products or featuresPreparing business cases from concept to executive approvalOperating with curiosity to challenge the status quo to improve the product P&LUnderstand how the Bank’s risk appetite and risk culture should be considered in day-to-day activities and decisions.Create an environment in which his/her team pursues effective and efficient operations of his/her respective areas, while ensuring the adequacy, adherence to and effectiveness of day-to-day business controls to meet obligations with respect to operational risk, regulatory compliance risk, AML/ATF risk and conduct risk, including but not limited to responsibilities under the Operational Risk Management Framework, Regulatory Compliance Risk Management Framework, AML/ATF Global Handbook and the Guidelines for Business Conduct.Contribute to a high performance environment and work within a team that fosters an inclusive work environment and using a coaching mindset and behaviors; communicating vison/values/business strategy; and, managing succession and development planning for the team.RequirementsSelf-starter possessing confidence and initiative; able to cope with changing and evolving priorities while identifying new opportunitiesExcellent communication, interpersonal, and strategic negotiating skillsKnowledge of payments, industry trends and practices, innovative digital platforms, policies and procedures an asset2+ year experience with transaction banking products including knowledge of channels and payment solutionsProduct management expertise to enable the thorough understanding of products/servicesA positive attitude combined with confidence to drive team prioritiesKnowledge of the Bank's application systems and their relationships within the Bank is an assetExperience working in an Agile environment is an assetUniversity Degree in business, economics, or technology (MBA an asset)Interested?At Scotiabank, every employee is empowered to reach their fullest potential, respected for who they are and, embraced for their differences. That’s why we work to grow and diversify talent and engage employees in a performance-oriented culture.What's in it for you?Scotiabank wants you to be able to bring your best self to work – and life, every day. With a focus on holistic well-being, our many flexible benefit programs are designed to help support your unique family, financial, physical, mental, and social health needs.#GTBLocation(s): United States : Florida : TampaScotiabank is a leading bank in the Americas. Guided by our purpose: \"for every future\", we help our customers, their families and their communities achieve success through a broad range of advice, products and services, including personal and commercial banking, wealth management and private banking, corporate and investment banking, and capital markets.At Scotiabank, we value the unique skills and experiences each individual brings to the Bank, and are committed to creating and maintaining an inclusive and accessible environment for everyone. If you require accommodation (including, but not limited to, an accessible interview site, alternate format documents, ASL Interpreter, or Assistive Technology) during the recruitment and selection process, please let our Recruitment team know. If you require technical assistance, please click here. Candidates must apply directly online to be considered for this role. We thank all applicants for their interest in a career at Scotiabank; however, only those candidates who are selected for an interview will be contacted.", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-check-services-at-scotiabank-4286192716", "source": "linkedin_rss_primary", "posted_date": "2025-09-05T11:36:24+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:06.930016", "raw_data": {"entry_id": "04bfdea7d027e09b2d0f607552dee8c5", "tags": [], "author": "LinkedIn"}}
{"id": "4c6d809df61b", "title": "Treace Medical Concepts, Inc. hiring Product Manager in Ponte Vedra Beach, FL", "company": "Treace Medical Concepts, Inc.", "location": "Beach, FL", "salary_range": null, "experience_required": null, "skills_mentioned": ["market research"], "industry": "fintech", "description": "Company DescriptionTreace’s mission is to be the leader in the surgical treatment of bunions by establishing the Lapiplasty® System as the standard of care. We are committed to operating our business with the highest standards of ethical conduct. We intend to exceed our customers’ expectations through an innovation-driven, high-velocity approach to solving treatment and surgical problems. With our products and services, our mission is to assist foot and ankle surgeons in improving patient outcomes and reducing healthcare costs, while providing rewarding experiences and opportunities for our employees and stakeholders.Job DescriptionAs the Product Manager, you will be responsible to plan, implement, and control all upstream and downstream marketing related aspects of the company’s products from conceptual stages through product life cycles to meet marketing, financial and corporate growth objectives. This includes both long-range strategic planning and short-term tactical execution. You will be expected to achieve acceptable growth rates in the product line by bringing innovative new products to market, by maintaining strong relationships with foot and ankle key opinion leaders, and by actively supporting the field sales force.This position influences research and development priorities and projects, research requirements, as well as manufacturing operations. You will prioritize activities and allocate resources for greatest effectiveness, as well as face abstract and conceptual problems.A keen ability to create and analyze market trends is required. You will sense customer needs based on routine field work, surgeon advisor input, prior experiences, input from colleagues, and analysis of market and trend data.Key responsibilities of the Product Manager role:Develops comprehensive plans for bringing major new products to market. Drives the product commercialization strategy and effort Develops positioning strategies for new and existing products Actively seeks out, validates, and defines new product concepts for development Works collaboratively with R&D and surgeon designers to organize and execute productive product development meeting events Develops in-depth clinical knowledge of areas of interest Conducts market research and identifies and tracks market trends Provides continuing product surveillance of established product to satisfy customer needs Collaborates with a wide variety of functional areas such as R&D, Quality, Regulatory, Legal, Manufacturing, and Operations to develop and provide product definitions responsive to customer needs and market opportunities Responsible for managing exhibits & tradeshows, advertising efforts, and working with graphics / ad firms to produce marketing-related collaterals for the business Analyzes product line performance from both a quantitative and qualitative standpoint to determine which products should be discontinued Develop short term and long-range sales budgets for the product line. Maintains ongoing awareness of performance to budget and takes corrective action as needed to ensure acceptable profitability Seeks out, develops, and maintains strong corporate relationships with key physicians. Conducts product training for field sales force Supports planning and execution of medical education events as required to drive product adoption QualificationsFive (5) or more years of successful product management experience in a medical device company (orthopedics experience preferred, but not required) with demonstrated progressive levels of accomplishment. Bachelor’s Degree or MBA (preferred) Additional InformationTreace's Privacy PolicyIt is Treace’s policy not to discriminate against any applicant for employment, or any employee because of age, color, sex, disability, national origin, race, religion, veteran status or any other characteristic protected by applicable law. EEO/Disabled/Veterans EmployerTreace is a drug free employer.", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-at-treace-medical-concepts-inc-4209891978", "source": "linkedin_rss_primary", "posted_date": "2025-09-05T11:23:42+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:06.930929", "raw_data": {"entry_id": "a8511815635de8a2df31be27592d8102", "tags": [], "author": "LinkedIn"}}
{"id": "cfcbc1068e68", "title": "Treace Medical Concepts, Inc. hiring Senior Product Manager in Ponte Vedra Beach, FL", "company": "Treace Medical Concepts, Inc.", "location": "Beach, FL", "salary_range": null, "experience_required": null, "skills_mentioned": ["market research"], "industry": "fintech", "description": "Company DescriptionTreace’s mission is to be the leader in the surgical treatment of bunions by establishing the Lapiplasty® System as the standard of care. We are committed to operating our business with the highest standards of ethical conduct. We intend to exceed our customers’ expectations through an innovation-driven, high-velocity approach to solving treatment and surgical problems. With our products and services, our mission is to assist foot and ankle surgeons in improving patient outcomes and reducing healthcare costs, while providing rewarding experiences and opportunities for our employees and stakeholders.Job DescriptionAs the Sr. Product Manager, you will be responsible to plan, implement, and control all upstream and downstream marketing related aspects of the company’s products from conceptual stages through product life cycles to meet marketing, financial and corporate growth objectives. This includes both long-range strategic planning and short-term tactical execution. You will be expected to achieve acceptable growth rates in the product line by bringing innovative new products to market, by maintaining strong relationships with foot and ankle key opinion leaders, and by actively supporting the field sales force.This position influences research and development priorities and projects, research requirements, as well as manufacturing operations. You will prioritize activities and allocate resources for greatest effectiveness, as well as face abstract and conceptual problems.A keen ability to create and analyze market trends is required. You will sense customer needs based on routine field work, surgeon advisor input, prior experiences, input from colleagues, and analysis of market and trend data.Key responsibilities of the Sr. Product Manager role:Develops comprehensive plans for bringing major new products to market. Drives the product commercialization strategy and effort Develops positioning strategies for new and existing products Actively seeks out, validates, and defines new product concepts for development Works collaboratively with R&D and surgeon designers to organize and execute productive product development meeting events Develops in-depth clinical knowledge of areas of interest Conducts market research and identifies and tracks market trends Provides continuing product surveillance of established product to satisfy customer needs Collaborates with a wide variety of functional areas such as R&D, Quality, Regulatory, Legal, Manufacturing, and Operations to develop and provide product definitions responsive to customer needs and market opportunities Responsible for managing exhibits & tradeshows, advertising efforts, and working with graphics / ad firms to produce marketing-related collaterals for the business Analyzes product line performance from both a quantitative and qualitative standpoint to determine which products should be discontinued Develop short term and long-range sales budgets for the product line. Maintains ongoing awareness of performance to budget and takes corrective action as needed to ensure acceptable profitability Seeks out, develops, and maintains strong corporate relationships with key physicians. Conducts product training for field sales force Supports planning and execution of medical education events as required to drive product adoption QualificationsBachelor’s Degree in Marketing, Engineering, Science or Healthcare related industry. Eight (8) years’ experience in Medical Device Product Management Additional InformationTreace's Privacy PolicyIt is Treace’s policy not to discriminate against any applicant for employment, or any employee because of age, color, sex, disability, national origin, race, religion, veteran status or any other characteristic protected by applicable law. EEO/Disabled/Veterans EmployerTreace is a drug free employer.", "apply_url": "https://www.linkedin.com/jobs/view/senior-product-manager-at-treace-medical-concepts-inc-4209898401", "source": "linkedin_rss_primary", "posted_date": "2025-09-05T11:22:29+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:06.931806", "raw_data": {"entry_id": "f4fbc203b9e3cb128b07fb51d5310f8a", "tags": [], "author": "LinkedIn"}}
{"id": "858a3d733a60", "title": "Mainspring Energy hiring Senior Product Manager in Menlo Park, CA", "company": "Mainspring Energy", "location": "remote", "salary_range": null, "experience_required": "Senior", "skills_mentioned": ["market research", "customer interviews"], "industry": "edtech", "description": "Company OverviewMainspring Energy is revolutionizing power generation with the world’s most flexible and adaptable onsite power generator, the Mainspring Linear Generator. Commercial, industrial, and utility leaders are choosing Mainspring over traditional options like engines, turbines, and fuel cells to quickly and reliably deliver local power for EV charging, commercial facilities, data centers, and grid-scale operations. The Mainspring Linear Generator is fuel flexible, ramps up and down to meet demand, and utilizes a flameless technology with near-zero NOx emissions.Backed by top-tier investors such as Khosla Ventures, Bill Gates, American Electric Power, and Lightrock, Mainspring designs, manufactures and delivers its products to customers across the U.S. today, and we’re quickly scaling for international expansion. Inspired by our vision of the affordable, reliable, net-zero carbon grid, Mainspring is rapidly expanding within the $816B global electricity equipment market, and we’re hiring the best talent to meet growing customer demand around the globe. We welcome a broad range of backgrounds, experiences, and talents to bring fresh perspectives and ongoing innovation to our customers.We are looking to build relationships with people who share our values:Pragmatic Optimism. Building a new category of world-class power generation requires the optimism of ambition and creativity, balanced with practicality to solve problems efficiently. The challenges that arise are opportunities for growth.Excellence without Ego. We bring expertise and commitment to creating the best customer experience, from sales to deployment and service, just as we apply deep technical rigor to building and delivering world-class products. We strive for excellence and behave as leaders with the humility to acknowledge our challenges, both collectively and as individual contributors.Proactive Collaboration. The integration and cross-disciplinary nature of Mainspring’s business requires intentionally seeking out others who bring different skills, perspectives, and priorities. Our culture of inclusion and respect extends beyond our team to interactions with our partners and customers.More information can be found at www.mainspringenergy.comJob OverviewAt Mainspring, Product Managerssit at the intersection of engineering, sales, marketing, installation, and maintenance to ensure that all of these elements come together to deliver successful products that maximize value for both customers and Mainspring.  Our ideal Senior Product Manager has a technical background and the ability to communicate well with people from many different functional backgrounds and different types of roles within and outside of our company. They enjoy engaging with customers, engineers, and consultants to fully identify customer needs and translate them into scalable technical specifications for Mainspring’s teams.ResponsibilitiesOwn the full product management process from opportunity identification through full product releaseIdentify, define, and quantify market opportunities and requirements by performing market research, customer interviews, economic analysis, and competitor benchmarkingDevelop product requirement documentation and collaborate with engineering teams to make trade-offs between customer needs, technical capabilities, performance and cost; and create quantitative analysis tools to enable clear visibility into these trade-offsCollaborate with internal Mainspring teams across sales, marketing, installation, and maintenance to develop product documentation and marketing materialsTrack and reconcile key technical and commercial dependencies for product initiatives for regular updates to the product roadmap and plan of recordParticipate in customer meetings, industry events, and ecosystem discussions as a credible, technically fluent representative of Mainspring’s perspectiveQualifications8-10+ years of relevant professional experience, with at least 3-4 years doing work in power generationSuccessful release(s) of non-consumer products, ideally industrial hardware productsTechnical background, with ideally a Master’s degree in Electrical Engineering, Mechanical Engineering, or a related technical disciplineExperience working with engineering, sales, and installation teamsStrong communication skills and ability to form relationships with a diverse set of internal and external stakeholders Analysis, reasoning, and organizational skills to function well in a fast-paced startup environmentDoes your experience not meet all of our posted requirements? Studies have shown that some people are less likely to apply to positions unless they meet every listed requirement. At Mainspring, we are committed to building a diverse, inclusive, flexible, and collaborative environment, so if you want to help us transition the world to clean and affordable electricity, and don’t meet all posted requirements for a particular role, we’d still love to hear from you. Mainspring can sometimes be flexible enough to shift responsibilities for the right person, or otherwise identify open or upcoming roles that may better fit your professional background.In more traditional words, Mainspring Energy, Inc is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or protected veteran status and will not be discriminated against on the basis of disability.This compensation and benefits information is based on Mainspring Energy's estimate as of the date of publication and may be modified in the future. We generally do not negotiate on salary once we have made an offer. The level of pay within the range will depend on a variety of job-related factors that may include location, relevant prior experience and/or education, or particular skills and expertise. New hires joining the company tend to be paid within the starting base pay range noted above, with opportunities to increase pay over time based on development of additional skills, competencies, and company-specific knowledge.This position is remote. The salary will be adjusted to reflect local market conditions based on employee location as well as the experience of the employee. Along with the base salary, Mainspring offers pre-IPO stock options + benefits.", "apply_url": "https://www.linkedin.com/jobs/view/senior-product-manager-at-mainspring-energy-4230614197", "source": "linkedin_rss_primary", "posted_date": "2025-09-05T10:09:14+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:06.933070", "raw_data": {"entry_id": "080739a0fc0747cecf71b2f25c24feb0", "tags": [], "author": "LinkedIn"}}
{"id": "7b0e873fd1b5", "title": "i3-Milestone hiring Product Manager in Nashville, TN", "company": "Unknown Company", "location": "Remote", "salary_range": null, "experience_required": null, "skills_mentioned": ["analytics", "agile", "stakeholder management", "market research", "go-to-market", "pricing", "product launch"], "industry": "edtech", "description": "Job DetailsDescriptionJOB TITLE: Product ManagerDEPARTMENT: Enterprise SolutionsREPORTS TO: Vice President Product ManagementJOB LOCATION: Remote (U.S. based)TRAVEL: 10%Summary Of PositionWe are seeking an experienced Product Manager that can be both tactical and strategic to lead the development and growth of our Court Electronic Filing (eFiling) product. In this role, you will work closely with cross-functional teams—including engineering, design, legal, sales, and government stakeholders—to deliver intuitive, compliant, and high-performing digital filing solutions for court systems. Your work will directly impact access to justice by modernizing how legal documents are submitted, tracked, and processed.Essential Duties & ResponsibilitiesProduct Ownership: Define and own the product roadmap for the eFiling platform, balancing customer needs, technical feasibility, and business priorities. Act as a subject matter expert in the relevant product domains and markets from a feature and functionality perspective.Product Enhancement: Coordinate and prioritize the products needs and features between all Internal i3 Vertical teams and external parties (customers, vendor/partners, industry leaders) to support the design and development of the product.Product Pricing: Collaborate with appropriate parties to determine cost, price models, and profit models for repeatable success.Stakeholder Collaboration: Engage with court administrators, sales IT and Implementation teams to gather requirements, validate needs, and ensure alignment with judicial standards.Agile Development: Participate in agile ceremonies including backlog grooming, sprint planning, and retrospectives in partnership with engineering team.Regulatory Compliance: Ensure the eFiling solution complies with state and federal court rules, accessibility standards (e.g., WCAG), and data privacy laws.User Experience: Champion intuitive design and user workflows for attorneys, self-represented litigants, and court clerks.Go-to-Market Support: Partner with marketing, sales, customer success and external partners to support product growth, product launches, product demonstrations, customer onboarding, and training initiatives. Create user market research groups to ensure we are informed of market trends to build functionality that supports the demand.Data & Analytics: Monitor product performance through analytics and user feedback to drive continuous improvement.Risk Management: Identify and mitigate product, operational, and legal risks throughout the product lifecycle.Customer Support: Review customer support tickets to determine trends and/or future features to improve overall customer experience.Minimum Qualifications (education And Experience)3+ years of product management experience, preferably with SaaS or enterprise software.Bachelor’s degree in Business, Computer Science, Law, or related field or minimum of 5 years of related Product Management experience.Preferred Qualifications (education And Experience)Experience with government, legal tech, or court systems strongly preferred.Strong understanding of agile methodologies and product development lifecycles.Excellent communication and stakeholder management skills.Familiarity with legal document standards, APIs for court integration, and electronic filing service providers (EFSPs) is a plus.", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-at-i3-milestone-4296178905", "source": "linkedin_rss_primary", "posted_date": "2025-09-05T07:06:18+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:06.935968", "raw_data": {"entry_id": "6b3731b2959f16a16f730f1af557599a", "tags": [], "author": "LinkedIn"}}
{"id": "824db82963d9", "title": "American Express hiring Senior Associate - Digital Product Management (GCS Mobile) in New York, NY", "company": "American Express", "location": "York, NY", "salary_range": null, "experience_required": "staff", "skills_mentioned": ["product strategy", "jira", "confluence", "user stories"], "industry": "fintech", "description": "At American Express, our culture is built on a 175-year history of innovation, shared values and Leadership Behaviors, and an unwavering commitment to back our customers, communities, and colleagues. As part of Team Amex, you'll experience this powerful backing with comprehensive support for your holistic well-being and many opportunities to learn new skills, develop as a leader, and grow your career.Here, your voice and ideas matter, your work makes an impact, and together, you will help us define the future of American Express.American Express Global Commercial Services (GCS) is the leading payment card issuer for corporations and small businesses with products and services to help them run and grow their business. Within GCS, the GCS and Enterprise Solutions team leads product development on a robust portfolio of products and capabilities for our small business and corporate customers. The team also leads product design and research across GCS as well as business development initiatives to support our banking scale.  Your Mission:Serve as a Product Owner and thought leader for our Global Commercial Services Mobile Product Vision and Roadmap including integrating experiences for small business users and evolving our middle market solutions to help deliver the best digital experiences to our customers. You will be responsible for supporting and driving the GCS Mobile Product roadmaps in partnership with the relevant Business Product teams and Enterprise Digital partners. You will help define best practices for our mobile apps and find opportunities for product interoperability or product connectivity (creating connected experiences across GCS products). The ideal candidate will have experience working on or with mobile apps and be invested in creating intuitive mobile app experiences for American Express commercial customers.  How will you make an impact in this role?Help evolve our mobile strategy for Business users at American Express in partnership with product management leadership and departmental partners, aligning with overall enterprise goals and customer needs  Assist in program managing initiatives related to mobile to work across multiple teams and partners to deliver efficientlyPlanning and delivering a product backlog, prioritizing stories, and shipping high-quality, functional software with the help of a cross-functional teamCollaborating with external and internal partners to define functionality. Documenting epics, business rules, use cases, and process flowsPartnering on discovery with business subject matter experts and UX designers to grow revenue, improve customer experience, and differentiate our productsWork closely with product, UX, marketing, and strategy teams to stay informed on goals, strategies, and ongoing effortsHelp lead on researching and documenting requirements via User Stories and EpicsAssist product manager(s) in defining product strategy for a specific area of the businessWhat we are looking for in you: Proactivity: Always striving to deliver great products. Proactive, hard-working, curious, loves learningCuriosity: Wants to learn more and not afraid to ask questionsCommunication: Excellent written and oral communication skills. Able to communicate information, ideas, and concepts clearlyOrganization and Planning: Plans, coordinates, and schedules in an efficient, productive manner; focuses on key priorities; manages time wellFlexibility/Adaptability: Able to work through changing priorities and conditions; copes effectively with complexity and changePersistence: Follows through on items without being managed. Resourceful, has grit, and a positive “can do” attitudeMinimum Qualifications:1+ years working on a mobile app1+ years product development experienceSolid understanding of Software Development Lifecycle (SDLC)Solid understanding of mobile app standard methodologiesPassion for mobile apps in personal and work lifeExcellent organizational and time management skillsUnabashed question asker; willing to learn anything needed to get things doneProficiency with Excel, Confluence and project management applications including Jira or RallySharp analytical and problem-solving skillsPreferred Qualifications:Experience in FinTech industryBachelor's degree or equivalent experienceSalary Range: $60,000.00 to $110,000.00 annually + bonus + benefitsThe above represents the expected salary range for this job requisition. Ultimately, in determining your pay, we’ll consider your location, experience, and other job-related factors.We back you with benefits that support your holistic well-being so you can be and deliver your best. This means caring for you and your loved ones' physical, financial, and mental health, as well as providing the flexibility you need to thrive personally and professionally:Competitive base salaries Bonus incentives 6% Company Match on retirement savings plan Free financial coaching and financial well-being support Comprehensive medical, dental, vision, life insurance, and disability benefits Flexible working model with hybrid, onsite or virtual arrangements depending on role and business need 20+ weeks paid parental leave for all parents, regardless of gender, offered for pregnancy, adoption or surrogacy Free access to global on-site wellness centers staffed with nurses and doctors (depending on location) Free and confidential counseling support through our Healthy Minds program Career development and training opportunitiesFor a full list of Team Amex benefits, visit our Colleague Benefits Site.American Express is an equal opportunity employer and makes employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran status, disability status, age, or any other status protected by law. American Express will consider for employment all qualified applicants, including those with arrest or conviction records, in accordance with the requirements of applicable state and local laws, including, but not limited to, the California Fair Chance Act, the Los Angeles County Fair Chance Ordinance for Employers, and the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance. For positions covered by federal and/or state banking regulations, American Express will comply with such regulations as it relates to the consideration of applicants with criminal convictions.We back our colleagues with the support they need to thrive, professionally and personally. That's why we have Amex Flex, our enterprise working model that provides greater flexibility to colleagues while ensuring we preserve the important aspects of our unique in-person culture. Depending on role and business needs, colleagues will either work onsite, in a hybrid model (combination of in-office and virtual days) or fully virtually.US Job Seekers - Click to view the “Know Your Rights” poster. If the link does not work, you may access the poster by copying and pasting the following URL in a new browser window: https://www.eeoc.gov/posterEmployment eligibility to work with American Express in the United States is required as the company will not pursue visa sponsorship for these positions.", "apply_url": "https://www.linkedin.com/jobs/view/senior-associate-digital-product-management-gcs-mobile-at-american-express-4286264066", "source": "linkedin_rss_secondary", "posted_date": "2025-09-05T14:11:32+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:07.380864", "raw_data": {"entry_id": "d3a505404250f4baa13ee832a49d9611", "tags": [], "author": "LinkedIn"}}
{"id": "b151f389c19c", "title": "Progressive Leasing hiring Product Manager – Integrated Retail (Remote) in Utah, United States", "company": "Progressive Leasing", "location": "Remote", "salary_range": null, "experience_required": "senior", "skills_mentioned": ["analytics"], "industry": "fintech", "description": "Progressive Leasing is a leading provider of in-store and e-commerce lease-to-own solutions. As an almost 20+ year old FinTech company that has gone from start-up to industry leader, we know how to innovate, simplify, and value all people. We are a company founded on our grit and we are constantly looking to the future. As an ever-evolving group of entrepreneurs and technologists, we strive to do the right thing period in all aspects of our work. We are a subsidiary of PROG Holdings (NYSE: PRG), an exciting FinTech holding company, with three business segments including Progressive, Vive Financial, and Four, a Buy Now Pay Later (BNPL) platform.We are currently hiring a Product Manager – Integrated Retail to help grow our company and ensure our mission is achieved!    This role is a work from home position and can be performed remotely anywhere in the continental US or in our corporate office in Draper, Utah.Employee Value Proposition (EVP): PROG is dedicated to providing people with opportunity; opportunity for inclusive collaboration, opportunity for innovation, and opportunity for development. WE ARE: Prog Tech embodies the modernity and transformational vision that is core to our business evolution. As passionate and hungry technical experts, we join together on the mission of progressing through technology. We believe in taking pride in our engineering, in the relentless pursuit of daily progress, and to bring others with you in your march to the future. We continuously experiment, fail fast, and constantly deliver.YOU ARE: A collaborative and detail-oriented problem solver who works closely with multiple stakeholders to understand retailer and customer needs, translates them into clear requirements, and supports the execution of our product vision. You communicate effectively about objectives, timelines, and challenges, ensuring alignment across teams. You’re comfortable working under the guidance of senior product leaders while taking the initiative to move tasks forward, adapt to shifting priorities, and deliver value in a fast-paced environment.YOUR DAY-TO-DAYSupport the vision and roadmap for integrated retail products, including dev tools, APIs, SDKs, and plug-ins, ensuring alignment with the Group Product Manager’s strategy. Collaborate with sales, marketing, implementation, and consumer experience teams to gather feedback, prioritize needs, and ensure product initiatives address retailer and partner requirements. Work closely with engineering, design, and analytics teams to document requirements, assist in solving technical challenges, and support iterative product delivery. Research emerging fintech trends and identify opportunities to address unmet retailer integration needs. Partner with sales and account teams to understand retailer integration constraints and help translate them into actionable product requirements. Assist in planning and sprint activities to ensure the timely delivery of product features and enhancements. Help maintain product documentation for APIs, SDKs, and plug-ins, including version histories and backward compatibility notes. Coordinate with vendors and technology partners to enable efficient, scalable integrations for retail clients. Represent the product team in select integration discussions, demos, or partner meetings, under the guidance of the Group Product Manager. Support integration best practices by contributing to presentations, training sessions, and internal or external knowledge-sharing opportunities. Monitor and analyze product performance metrics to provide insights and improvement recommendations. YOU’LL BRING2–4 years’ experience working for or with US retailers, or in a related product/technology role. Experience working on products that require technical integration (SDK, plug-in, or API) either in development, support, or coordination. Familiarity with technical systems and APIs, with the ability to translate technical concepts into clear business requirements. Strong collaboration skills, with experience working across sales, engineering, design, and other cross-functional teams. Solid understanding of retail business processes and how technical integrations support them. Ability to balance multiple priorities, adapt to changing business needs, and contribute to fast-paced product delivery cycles. Clear, concise communication skills, both written and verbal, with the ability to present ideas to different audiences. A passion for learning, problem-solving, and delivering products that meet retailer and customer needs. Self-motivated, organized, and comfortable working under guidance while taking initiative to drive tasks forward. Bachelor’s degree in Computer Science, Information Systems, Business, or related field — or equivalent practical experience.  You Might Also HaveExposure to e-commerce platform integrations (e.g., Shopify, Magento, BigCommerce). Familiarity with Postman, Swagger, or similar API testing tools. Understanding of payment gateways, POS systems, or retail inventory management systems. Experience with API documentation tools or developer portals. Background in retail technology, SaaS platforms, or fintech solutions. Progressive Leasing welcomes and encourages diversity in the workplace. We do not discriminate in any aspect of employment on the basis of race, color, religion, national origin, ancestry, gender, sexual orientation, gender identity and/or expression, age, veteran status, disability, or any other characteristic protected by federal, state, or local employment discrimination laws where Progressive Leasing does business.", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-%E2%80%93-integrated-retail-remote-at-progressive-leasing-4282844199", "source": "linkedin_rss_secondary", "posted_date": "2025-09-05T13:58:07+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:07.381984", "raw_data": {"entry_id": "ff8ecff0fe29c1bb61e496931056aa1d", "tags": [], "author": "LinkedIn"}}
{"id": "84961f28e39e", "title": "Intuit hiring Senior Staff Product Manager - Futures in New York, NY", "company": "Intuit", "location": "York, NY", "salary_range": null, "experience_required": "Senior", "skills_mentioned": ["product strategy", "analytics"], "industry": "fintech", "description": "OverviewJoin Intuit’s Futures team as a Senior Staff Product Manager. The Futures team develops and incubates emerging technologies, user experiences, and capabilities that will transform the future of our customers, products, and business. Our work focuses on solving problems for our customers, small businesses and consumers, with technologies such as AI and leading edge fintech.This team is responsible for considering the future of AI interaction in areas like robotics, as well as developing a cutting-edge interactive space where SMB and mid-market customers could experience the future of AI-powered Intuit solutions.We work with teams across Intuit to influence and contribute to Intuit’s business and strategy. In this role, you will have end-to-end responsibilities from spearheading to launching the next generation of customer experiences and capabilities for our current and future customers.What you'll bring7+ years of hands-on product management experience in the financial technology, social media or gaming industries, working on new or emerging technologies for 0 - 1 products with AI/ML at their core, including GenAI.Passion for solving big customer problems through deep understanding of customer needs, market landscape and technology trends.Experimental mindset, adept at qualitatively and quantitatively validating concepts and assumptions through rapid and iterative testingStrategic thinker as well as tactical executor, continually assessing prospective experiences, capabilities and products for desirability, feasibility and viability.Demonstrated ability in recognizing, learning, and using new technologies to solve important customer problems.Strong communication and relationship skills, including proven ability to influence strategic decision making.Demonstrated team-building skills, including the ability to motivate and guide team members beyond the direct reporting structure including engineers, data scientists, designers and researchers; and to collaborate with a variety of functions across the company including legal, privacy and platform teams.The successful candidate will have a bias for action and be a self-starter; adaptable, tenacious, perceptive and able to execute a well-developed plan.Undergraduate degree in business, computer science, entrepreneurship, data science/analytics, innovation or nance; MBA is a plus (equivalent professional experience will be considered)How you will leadLead your team to identify opportunities and product strategy by assessing market landscape, customer feedback and competitive intelligence.Develop a flexible strategy for emerging technology initiatives that can quickly adapt to changing market conditions and new information.Drive the initiative roadmap, detailing execution plans to capitalize on the possibilities of emerging technologies.Understand how technology shifts could impact current and future customers and how to harness the power of these technologies to build competitive durable advantage for Intuit.Collaborate and work across organizational groups to understand their priorities and identify where emerging technologies can accelerate their innovation for business impact.Work closely with design, data science, architect and product development to develop secure and scalable capabilities to power next generation experiences.Anticipate and resolve strategic issues to ensure your team's ability to deliver.Take a data driven approach in defining success metrics, prioritizing requirements, and communicating plan, progress and success for emerging technology initiatives.Create and maintain momentum, helping teams move forward swiftly and with rigor, a learning mindset and a bias toward action.Be a mentor to other PMs on the team.This position will be eligible for a cash bonus, equity rewards and benefits, in accordance with our applicable plans and programs (see more about our compensation and benefits at Intuit®: Careers | Benefits).Pay offered is based on factors such as job-related knowledge, skills, experience, and work location. To drive ongoing pay equity for employees, Intuit conducts regular comparisons across categories of ethnicity and gender.", "apply_url": "https://www.linkedin.com/jobs/view/senior-staff-product-manager-futures-at-intuit-4267246056", "source": "linkedin_rss_secondary", "posted_date": "2025-09-05T13:54:04+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:07.382702", "raw_data": {"entry_id": "a453a10656e2ec5e58f5c9e07b282921", "tags": [], "author": "LinkedIn"}}
{"id": "c5d0faeec18e", "title": "SoFi hiring Principal Product Manager, Pricing in Seattle, WA", "company": "SoFi", "location": "remote", "salary_range": null, "experience_required": null, "skills_mentioned": ["data analysis", "SQL", "stakeholder management", "pricing"], "industry": "fintech", "description": "Employee Applicant Privacy NoticeWho we are:Shape a brighter financial future with us.Together with our members, we’re changing the way people think about and interact with personal finance.We’re a next-generation financial services company and national bank using innovative, mobile-first technology to help our millions of members reach their goals. The industry is going through an unprecedented transformation, and we’re at the forefront. We’re proud to come to work every day knowing that what we do has a direct impact on people’s lives, with our core values guiding us every step of the way. Join us to invest in yourself, your career, and the financial world.The role:At SoFi, pricing is a key driver of our lending performance, and we’re investing in the infrastructure that powers it. As the Product Manager for our Pricing Platform, you’ll play a critical role in identifying, prioritizing, and building the tools and capabilities that enable smarter, faster, and more controlled pricing decisions.While you'll help streamline coordination across teams, the core of this role is about building leverage—designing systems and workflows that reduce manual effort, improve pricing agility, and embed robust controls. You’ll work closely with our Pricing team as well as cross-functional partners in Engineering, Data Science, and Risk to turn pricing goals into scalable product solutions. This is a high-impact opportunity for someone who wants to shape foundational platform capabilities and directly influence how SoFi prices and optimizes its lending products.What you'll do:Own and drive the roadmap for pricing infrastructure, integrations, and controls within our underwriting technology teamRepresent Pricing in cross-functional forums—capturing nuanced needs, translating them into specs, and ensuring they're tracked through deliveryCoordinate cross-team efforts for pricing, triage intake, and streamline meeting involvement to maximize efficiency related to pricingManage and prioritize the pricing backlog; align sprint plans with stakeholders across pricing, engineering, data science, underwriting, and riskImplement process improvements to optimize throughput and reduce cycle times for pricing-related initiativesBridge EPD and Pricing teams, serving as an embedded liaison in the Pricing team to ensure pricing thinking is integrated into lending products, platforms, and projects from inceptionDefine success metrics and leverage data (SQL-friendly) to guide prioritization and demonstrate impactWhat you’ll need:Bachelor's degree (preferable) or equivalent experience8+ years of product management experience, ideally with fintech exposureExcellent communication skills—able to engage seamlessly with technical, analytical, and business audiencesStrong organizational and project/program management skills; experience running technical sprints or complex launchesProven ability to manage backlogs, intake processes, and multiple stakeholder prioritiesCuriosity about loan pricing, credit risk, decision engines, and related infrastructure (or high willingness to dive in)Fluency with SQL and data analysis to inform prioritization and measure outcomesExperience in matrixed or hybrid org structures; ability to influence without direct authorityStrong stakeholder management and leadership skills, with a track record of fostering cross-functional alignmentNice to have:Experience building or scaling pricing engines, decisioning platforms, and/or price-optimizing toolsBackground in lendingExperience working with LLMs or generative AICompensation And BenefitsThe base pay range for this role is listed below. Final base pay offer will be determined based on individual factors such as the candidate’s experience, skills, and location.To view all of our comprehensive and competitive benefits, visit our Benefits at SoFi page!SoFi provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion (including religious dress and grooming practices), sex (including pregnancy, childbirth and related medical conditions, breastfeeding, and conditions related to breastfeeding), gender, gender identity, gender expression, national origin, ancestry, age (40 or over), physical or medical disability, medical condition, marital status, registered domestic partner status, sexual orientation, genetic information, military and/or veteran status, or any other basis prohibited by applicable state or federal law.The Company hires the best qualified candidate for the job, without regard to protected characteristics.Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.New York applicants: Notice of Employee RightsSoFi is committed to an inclusive culture. As part of this commitment, SoFi offers reasonable accommodations to candidates with physical or mental disabilities. If you need accommodations to participate in the job application or interview process, please let your recruiter know or email accommodations@sofi.com.Due to insurance coverage issues, we are unable to accommodate remote work from Hawaii or Alaska at this time.Internal EmployeesIf you are a current employee, do not apply here - please navigate to our Internal Job Board in Greenhouse to apply to our open roles.", "apply_url": "https://www.linkedin.com/jobs/view/principal-product-manager-pricing-at-sofi-4275504975", "source": "linkedin_rss_secondary", "posted_date": "2025-09-05T13:53:00+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:07.383937", "raw_data": {"entry_id": "c35c91fc63c9eec212dabfea53fa6d5e", "tags": [], "author": "LinkedIn"}}
{"id": "c3a72ba80fcf", "title": "Intuit hiring Senior Staff Product Manager - Fintech API Platform Strategy in Mountain View, CA", "company": "Intuit", "location": "View, CA", "salary_range": "$196,500 - $266,000", "experience_required": "8+ years of experience", "skills_mentioned": ["agile"], "industry": "fintech", "description": "OverviewAre you a visionary product leader passionate about the intersection of Fintech, cutting-edge Artificial Intelligence, and developer platforms? Do you thrive on building foundational API platforms that empower innovative financial products at scale and unlock new growth opportunities?We're seeking a Senior Staff Product Manager, Fintech API to define and execute the strategy for our core Fintech API capabilities, driving the next generation of intelligent financial services and enabling an \"invisible finance\" paradigm.In this pivotal role, you'll own the roadmap for our AI-native API platform, enabling product teams, 3rd party developers, and AI agents to leverage Intuit's high-value Fintech capabilities. You'll be instrumental in shaping the future of financial technology by externalizing our core intelligence, expanding our platform reach, and driving long-term ecosystem and customer growth.What you'll bring8+ years of experience in product management or a related field.At least 3+ years focused on API products within the fintech or financial services industry, with a strong understanding of AI/ML's impact on API strategy.Proven track record of defining, building, and launching successful, scalable API-powered platforms or products that meet enterprise needs.Deep technical understanding of API design principles, AI infrastructure, and their practical applications within the fintech domain, including exposure to concepts like Model Context Protocol (MCP) and agentic toolkits.Strong ability to think strategically, identify market opportunities, and translate them into actionable product roadmaps, aligning long-term transformation goals with immediate delivery milestones.Exceptional leadership and communication skills, with the ability to influence and align diverse stakeholders across an organization, including executive leadership.Demonstrated excellence in executing transformation roadmaps and delivering incremental value while addressing legacy system deprecation.In-depth knowledge of product management processes and adeptness at driving consensus across diverse teams.Experience with Agile methodologies as a product owner, establishing clear requirements through detailed epics.Quick learner with minimal supervision required to become a domain expert.A passion for solving complex problems at the intersection of finance, artificial intelligence, and developer platforms.Bachelor’s degree in Engineering, Computer Science, or a related field. Master’s degree preferred.Domain knowledge in FinTech, Payment Standards, and FinTech Compliance is highly advantageous.If you're ready to make a significant impact and lead the charge in building the intelligent, API-driven financial systems of tomorrow, we encourage you to apply!Intuit provides a competitive compensation package with a strong pay for performance rewards approach. The expected base pay range for this position is: $196,500 - $266,000This position will be eligible for a cash bonus, equity rewards and benefits, in accordance with our applicable plans and programs (see more about our compensation and benefits at Intuit®: Careers | Benefits).Pay offered is based on factors such as job-related knowledge, skills, experience, and work location. To drive ongoing pay equity for employees, Intuit conducts regular comparisons across categories of ethnicity and gender.How you will leadStrategic Leadership & Vision: Develop and champion the strategic vision and roadmap for our Fintech API platform, identifying key opportunities to leverage AI/ML to externalize high-value financial capabilities and support AI-initiated workflows. This includes defining short-term deliverables and long-term transformational goals to enable \"invisible finance\" for small businesses.Platform Product Ownership: Drive the end-to-end product lifecycle for core Fintech API services and infrastructure, including the Intuit Model Context Protocol (MCP) server, the Intuit Agent Toolkit, and AI-driven automation in core APIs. You'll oversee product management processes from backlog grooming to prioritizing initiatives and features, partnering closely with engineering and architecture colleagues.Cross-Functional Collaboration & Influence: Partner closely with AI/ML engineers, data scientists, product teams, design, legal, and compliance to translate complex technical concepts into clear API product requirements and deliver impactful solutions. You'll manage upstream and downstream dependency requests and timelines efficiently, influencing stakeholders and senior leadership effectively.Innovation & Experimentation: Foster a culture of continuous innovation and experimentation, leading rapid iteration on AI-ready API solutions based on performance metrics, user feedback, and market trends. This includes refreshing and extending Fintech APIs and offering developer-friendly tooling.Technical Depth & Quality: Possess a deep technical understanding of API design principles, AI infrastructure, and their practical applications within the fintech domain. You'll work closely with external partners, architects, and engineers to design and build secure, high-scale integrations, ensuring high-quality outcomes and proactively resolving issues, particularly around authentication protocols and MFA-support for high-stakes agent actions.Data-Driven Decision Making: Implement prioritization principles using a data-backed approach for defining priorities and making tradeoff decisions. Utilize data-driven methods to define and measure success metrics, prioritize requirements, and communicate plans and launches, delivering impactful business results.Customer & Partner Obsession: Conduct thorough customer discovery with end-users and developers to understand their challenges and derive insights on resolving significant customer issues delightfully. You'll work closely with customers and partners, adopting a customer-focused approach to strategy and priorities, especially in enabling 3rd party developers and AI builders to integrate with Intuit's APIs.Communication & Documentation: Employ prolific writing skills to craft effective Product Requirements Documents, decision documents, executive summaries, and presentations for communication across various levels, from engineers and architects to senior executives. This includes ensuring clear guides on using Intuit APIs with OpenAI, LangChain, and other popular dev tools.Risk & Compliance: Work closely with legal and compliance teams to ensure all API initiatives adhere to financial regulations, data privacy standards, and ethical AI principles, incorporating fraud-detection hooks and strict authentication.Program Management Collaboration: Collaborate with program management to ensure precise project execution and delivery by managing dependencies and plans across various services and teams, demonstrating proficiency in managing complex deliveries across multiple teams.", "apply_url": "https://www.linkedin.com/jobs/view/senior-staff-product-manager-fintech-api-platform-strategy-at-intuit-4283964302", "source": "linkedin_rss_secondary", "posted_date": "2025-09-05T13:52:52+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:07.384635", "raw_data": {"entry_id": "aad60e83731e55ec6a15408897efffea", "tags": [], "author": "LinkedIn"}}
{"id": "5d1a5d02bb3f", "title": "Intuit hiring Principal Product Manager- Platform Reliability, FinTech in Mountain View, CA", "company": "Intuit", "location": "View, CA", "salary_range": "$236,000 - $319,000", "experience_required": "4+ years of experience", "skills_mentioned": ["analytics", "stakeholder management"], "industry": "fintech", "description": "OverviewIntuit’s vision is to power prosperity around the world, and our Fintech team is crucial to realizing that vision. We’re building an industry-leading reliability and quality platform that underpins our growing Embedded Fintech capabilities, ensuring we meet the demands of processing billions in money movement annually and delivering an exceptional experience to our customers. As we scale, our goal is to achieve 99.99% uptime, drive rapid detection and recovery from incidents, and create a seamless, automated approach to quality engineering and operational excellence.We are looking for a Principal Product Manager to lead this critical initiative of making Reliability and Quality a Product within the Fintech organization. In this role, you will define and execute a long-term roadmap aimed at enhancing system resilience, automating end-to-end testing, and embedding observability and incident management best practices across the platform. Your work will directly impact the trust our customers place in Intuit Fintech products, ensuring uninterrupted services and a best-in-class user experience.If you’re excited about shaping the future of large-scale, highly available Fintech platforms, utilizing the latest AI/ML and SRE practices, and working in a fast-paced environment to achieve a substantial customer and business impact, we’d love to talk to you!What you'll bring8+ years of product management experience in technology, e-commerce, or Fintech domains with a focus on infrastructure, reliability, or platform products4+ years of experience implementing SRE or reliability-focused programs, including incident management, disaster recovery, and observability frameworks.Demonstrated success in leading AI/ML-driven product initiatives (e.g., predictive analytics, automated testing, self-healing systems)In-depth understanding of cloud (AWS) services, microservice architectures, CI/CD pipelines, and large-scale distributed systemsProven ability to use data and metrics to back up assumptions, make recommendations, and drive actions that influence business outcomesExceptional communication and stakeholder management skills; able to effectively translate complex technical requirements into clear value propositions for executive leadership, cross-functional teams, and customersSelf-starter attitude with a strong desire for continuous learning and process improvement; comfortable with both strategic planning and hands-on executionBachelor’s degree in computer science, engineering, or a related technical discipline; advanced degree (MBA/MS) a plusWillingness to travel up to 10% (domestically or internationally) for key team or customer engagementsIntuit provides a competitive compensation package with a strong pay for performance rewards approach. The expected base pay range for this position is: Bay Area California $236,000 - $319,000This position will be eligible for a cash bonus, equity rewards and benefits, in accordance with our applicable plans and programs (see more about our compensation and benefits at Intuit®: Careers | Benefits).Pay offered is based on factors such as job-related knowledge, skills, experience, and work location. To drive ongoing pay equity for employees, Intuit conducts regular comparisons across categories of ethnicity and gender.How you will leadStrategic Vision and Roadmap:Define and drive the overarching strategic roadmap for F1T Reliability, encompassing observability, automation (including on-call and production verification), and AI-driven testing.Champion \"Quality as a Product,\" clearly articulating how reliability metrics directly contribute to enhanced customer satisfaction and significant business growth.Establishing And Driving Adoption Of Key MetricsEstablish critical business and product reliability metrics (e.g., uptime SLAs, MTTR targets) in collaboration with stakeholders.Drive the adoption and operationalization of these metrics across all Fintech teams, fostering a shared accountability model for reliability outcomes.Cross-Functional Leadership And ExecutionServe as the primary Product leader for all F1T reliability and quality initiatives, providing clear priorities and facilitating resource alignment.Partner closely and influence Engineering, SRE, Data Science, and Business teams to ensure timely and high-quality delivery of reliability improvements and new capabilities.Innovation In Automation And AILead the exploration and implementation of innovative automation and AI solutions, including GenAI for test data creation, mocking, and end-to-end test automation, to significantly reduce manual testing overhead.Drive the development of self-healing and auto-remediation strategies, leveraging AI for proactive monitoring and faster incident resolution.Implementing Observability And ResiliencyEstablish and guide the implementation of a comprehensive observability stack (logs, metrics, traces) to provide proactive visibility into system behavior.Champion and guide the chaos engineering agenda, including regular failure and load testing, to proactively verify system resilience and readiness for peak traffic.Governance, Compliance, And Risk ManagementDevelop and maintain critical Fintech workflow runbooks and ensure robust Disaster Recovery plans and testing protocols are in place.Implement a centralized audit and compliance review mechanism to meet regulatory requirements and safeguard customer trust.Reporting, Communication, And Stakeholder ManagementRegularly communicate progress, risk assessments, and performance metrics to executive leadership, clearly articulating the business value of improved reliability.Act as a strong advocate for reliability and quality needs across broader Fintech and Intuit forums, ensuring alignment and support at all levels.", "apply_url": "https://www.linkedin.com/jobs/view/principal-product-manager-platform-reliability-fintech-at-intuit-4267244148", "source": "linkedin_rss_secondary", "posted_date": "2025-09-05T13:48:38+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:07.385440", "raw_data": {"entry_id": "6b9c33c7cc753b19fb5119321ff1a1e1", "tags": [], "author": "LinkedIn"}}
{"id": "157aee970956", "title": "Intuit hiring Principal Product Manager- Agentic AI in San Francisco, CA", "company": "Intuit", "location": "Francisco, CA", "salary_range": null, "experience_required": "senior", "skills_mentioned": ["A/B testing"], "industry": "fintech", "description": "OverviewIntuit TurboTax is building the future of Agentic tax preparation, leveraging LLMs, reasoning models, and computer-using agents. We're looking for a seasoned Product Manager to drive the strategy for this initiative. This involves designing and delivering robust AI agents capable of complex reasoning and task execution at massive scale, leveraging Intuit's unique data assets and tax knowledge. You will define how these agents perform their tasks, how they collaborate with customers, and how we build trust and ensure accuracy with non-deterministic technology. This role offers a unique opportunity to disrupt an industry impacting millions of Americans with cutting-edge technologies.What you'll bring6+ years designing and delivering world-class software products, with at least 5+ years in a Product Management role focused on platform, data-intensive systems, or AI/ML-powered experiences.Deep understanding and significant hands-on experience defining strategy for and shipping products leveraging Generative AI, Agentic AI systems, complex Machine Learning models, or Conversational AI to solve challenging user problems at scale.Passion for tackling complex consumer problems, ideally within fintech, personal finance, tax, or related domains where user trust, accuracy, and data privacy are paramount.Strong technical intuition; comfortable engaging deeply with engineering and data science on system architecture, model capabilities, APIs, and technical trade-offs. Ability to translate complex AI concepts into clear product requirements.Bachelor’s degree required with a focus in Computer Science, Engineering, Data Science, Statistics, Economics, Business Administration, or related quantitative/technical field preferred. An MBA is a plus. Equivalent experience will be considered.How you will leadDefine, own, and articulate a compelling vision, strategy, and multi-year roadmap for agentic AI capabilities within TurboTax, translating complex user needs and business opportunities into measurable outcomes.Lead the ideation, technical development, and launch of innovative agentic AI features and experiences, partnering deeply with AI/ML engineers, data scientists, designers, and tax experts to deliver high-accuracy, trustworthy, and confidence-building solutions.Drive product definition and requirements for underlying AI models, agent orchestration logic, and human-in-the-loop processes, balancing user experience with the high bar for accuracy required in tax.Design and execute data-driven experiments (including A/B testing and user studies) specifically to validate hypotheses related to agentic AI effectiveness, user trust, and impact on filer confidence and accuracy.Build strong partnerships and influence roadmaps across senior leaders and teams to ensure cohesive strategy and execution for agentic AI initiatives.Intuit provides a competitive compensation package with a strong pay for performance rewards approach. The expected base pay range for this position is: Bay Area California $236,000.00-319,000.00Southern California $213,500.00-288,500.00This position will be eligible for a cash bonus, equity rewards and benefits, in accordance with our applicable plans and programs (see more about our compensation and benefits at Intuit®: Careers | Benefits).Pay offered is based on factors such as job-related knowledge, skills, experience, and work location. To drive ongoing pay equity for employees, Intuit conducts regular comparisons across categories of ethnicity and gender.", "apply_url": "https://www.linkedin.com/jobs/view/principal-product-manager-agentic-ai-at-intuit-4277672557", "source": "linkedin_rss_secondary", "posted_date": "2025-09-05T13:48:37+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:07.386111", "raw_data": {"entry_id": "96b603b5b975de6db7c3b3b4524a642a", "tags": [], "author": "LinkedIn"}}
{"id": "ac8e15aeff20", "title": "Intuit hiring Principal Product Manager: Risk Platform in Mountain View, CA", "company": "Intuit", "location": "View, CA", "salary_range": "$236,000 - $319,000", "experience_required": "Principal", "skills_mentioned": ["stakeholder management", "KPIs"], "industry": "fintech", "description": "OverviewIntuit is committed to powering prosperity around the world, and robust, scalable risk management is foundational to this mission. We are seeking a highly technical and strategic Principal Product Manager to drive the evolution and acceleration of our core Risk Platform. This role is pivotal in shaping the underlying infrastructure that powers risk decisioning and operations across Intuit's diverse fintech offerings. You will be responsible for the product vision, strategy, and execution of key platform capabilities centered around data, decisioning, and policy engines authoring. Your primary objective will be to deliver a modern, highly leveraged risk platform that enables rapid innovation, enhances risk accuracy, and improves operational efficiency for various product teams and risk analysts. This is a deeply technical product role. You will collaborate intensively with Risk Policy, Risk Engineering, Data Engineering, Data Science, AI/ML teams, and other Product Managers who consume your platform capabilities. If you have a passion for building resilient, scalable, and intelligent systems that form the backbone of risk management in a leading fintech company, this role is for you.What you'll bringExperience: 10+ years of product management experience, with a significant portion focused on technical platform products, data infrastructure, or machine learning platforms, ideally within the FinTech or financial services risk domain.Technical Depth:○ Strong understanding of data engineering principles: data ingestion, ETL/ELT pipelines, data lakes/warehouses, real time data streaming, and feature stores.○ Deep familiarity with decisioning systems and rules engine technologies , including their design, implementation, and operational management..○ Solid grasp of microservices architecture, API design, and cloud-native technologies (e.g., AWS, GCP).Platform Mindset: Proven ability to define and deliver platform capabilities that serve multiple internal customers, balancing diverse requirements with a cohesive and scalable architecture. Experience in driving platform adoption.Strategic & Analytical Thinking: Proven experience in defining platform vision and strategy, translating them into actionable roadmaps, and influencing long-term technical direction. Strong analytical skills to make data-driven decisions about platform investments.Execution & Program Management: Proficiency in managing complex technical program/project deliverables involving multiple engineering teams, dependencies, and timelines. Ability to thrive in ambiguity and drive execution from concept to scaled deployment.Leadership & Influence: Excellent collaboration skills with a demonstrated ability to lead execution across engineering and data science teams, and influence stakeholders across different functions and levels, including senior technical leadership.Communication: Inspiring written and verbal communication skills, capable of effectively articulating complex technical concepts, platform vision, strategy, and results to both technical and non-technical audiences.Education: BS or MS in Computer Science, Engineering, or a related technical field, or equivalent demonstrably strong technical experience.Intuit provides a competitive compensation package with a strong pay for performance rewards approach. The expected base pay range for this position is: Bay Area California $236,000 - $319,000This position will be eligible for a cash bonus, equity rewards and benefits, in accordance with our applicable plans and programs (see more about our compensation and benefits at Intuit®: Careers | Benefits).Pay offered is based on factors such as job-related knowledge, skills, experience, and work location. To drive ongoing pay equity for employees, Intuit conducts regular comparisons across categories of ethnicity and gender.How you will leadPlatform Vision & Strategy: Own and drive the product vision, strategy, and technical roadmap for core components of the Risk Platform, including data infrastructure for risk, feature engineering platforms, rules engine frameworks, decisioning services, and ML model deployment/monitoring capabilities.Technical Roadmap & Execution: Define, prioritize, and deliver platform features and enhancements. Work closely with engineering leads on architecture, design, and implementation details to ensure solutions are scalable, performant, and maintainable.Core Capabilities Development:○ Data Enablement: Champion initiatives to improve data accessibility, quality, and utility for risk modeling and decisioning.○ Decisioning & Rules Engines: Lead the evolution of our rules engine and decisioning service capabilities to support complex logic, rapid iteration, and high-throughput processing.○ AI/ML Platform Integration: Ensure seamless integration and operationalization of machine learning models within the risk platformStakeholder Management & Collaboration: Act as the primary product interface to platform engineering, policy, and data science teams. Gather requirements from internal product teams who consume the platform, ensuring their needs are met.Platform Evangelism & Adoption: Drive the adoption of new platform capabilities across Intuit. Develop documentation, conduct training, and provide support to internal users.Operational Excellence: Define and monitor key platform performance indicators (KPIs) related to reliability, scalability, latency, and cost-effectiveness. Champion operational improvements and ensure platform resilience.Innovation & Future-Proofing: Stay abreast of industry trends in risk technology, data platforms, and AI/MLs. Identify and champion emerging technologies and approaches to keep the Intuit Risk Platform at the cutting edge.", "apply_url": "https://www.linkedin.com/jobs/view/principal-product-manager-risk-platform-at-intuit-4275889638", "source": "linkedin_rss_secondary", "posted_date": "2025-09-05T13:41:25+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:07.386863", "raw_data": {"entry_id": "66b40ebe843e3ee5c34a3b9250e60f71", "tags": [], "author": "LinkedIn"}}
{"id": "1f0c5ebaf49e", "title": "Intuit hiring Staff Product Manager, Fintech Risk Management in Mountain View, CA", "company": "Intuit", "location": "View, CA", "salary_range": null, "experience_required": "Staff", "skills_mentioned": ["agile"], "industry": "fintech", "description": "OverviewWe are part of the Fintech organization that powers Intuit's money movement platform, enabling prosperity for customers across QuickBooks, Mailchimp and TurboTax. The Risk Product team is crucial in enabling Fintech Risk Management to detect and mitigate fraud, financial and compliance risks. The compliance risk pertains to a wide range of regulatory domains such as Anti-Money Laundering (AML), Consumer Protection, and Sanctions, among others. Our mission is to minimize the impact of these risks on our valued customers.We are seeking a Staff Product Manager to join our team. This role will focus on leading the transformation of how customers experience money products, specifically within the context of Fintech compliance and underlying risk management. You will support our critical areas of focus: revolutionizing speed to benefit, infusing AI into our Fintech compliance and risk lifecycle end-to-end, and empowering our risk operations team to make high-quality decisions when human intervention is needed.In this role, your focus will be to build the strategy and roadmap to accelerate our mission to elevate our Fintech compliance controls, scale risk operations with AI and automation, and reduce customer friction, all in service of our business growth strategy. Our customers and partners are highly cross-functional, globally distributed, and strongly technical. This role requires a strong display of driving technical partnership, deep customer empathy, and specialized knowledge in Fintech compliance to deliver outstanding business outcomes. You’ll be challenged to think bolder, move faster, and have a bigger impact. Deep partnerships with amazing designers and engineers make every day a learning experience. We like to have fun and celebrate our accomplishments. Your creativity, rigor, and Fintech compliance expertise are keys to our success.What you'll bring5+ years of product management experience with a significant focus on compliance within the financial services or fintech industry.Proven domain knowledge in compliance regulations and best practices, with specific experience in one or more of the following areas: AML, Consumer Protection, Sanctions screening.Exposure to other money movement product compliance areas is a plus.Track record in defining and delivering awesome products that solve big customer needs, while balancing compliance needs.Proven ability to develop and champion a product vision, strategy, and roadmap for a product area in support of customer needs, company objectives, and regulatory requirements.Experience with Agile development and methodologies.Track record of working closely with stakeholders and partners in a highly crossfunctional environment, listening, and taking a customer-focused approach to strategy and priorities – passion for the customer.Undergraduate degree required; a focus in computer science, finance, or a related field is preferable. An MBA is a plus; equivalent experience will be considered.How you will leadEnd-to-end ownership of initiatives to empower compliance policy and operation teams to mitigate Fintech compliance risk exposure by building robust customer and transaction monitoring, case investigation and other relevant compliance capabilities.Develop deep customer empathy and a detailed understanding of money movement products where Fintech compliance risks may occur and how they can be mitigated effectively.Transform our compliance controls with scalable capabilities to serve a global audience. This includes areas like KYC/KYB processes, AML transaction monitoring, and adherence to various regulatory requirements, stitching data across numerous sources to manage compliance risk and regulatory obligations.Leverage customer insights and compliance regulatory requirements to formulate a compelling platform vision, then develop hypotheses and initiatives to deliver that vision; create, measure, and own success metrics.Build strong relationships with legal and compliance, product, engineering, risk policy and operations teams to influence and align on compliance solution roadmaps.Establish product delivery timelines in close collaboration with development teams; communicate frequently and clearly upwards and outwards across the business.Ruthlessly prioritize initiatives and drive work with a strong focus on process and tactical execution, ensuring a high business impact ROI on resource investment.Know when and how to be scrappy and entrepreneurial, hypothesis-driven, and analytical; exercise strong judgment when balancing risks and making trade-off decisions.", "apply_url": "https://www.linkedin.com/jobs/view/staff-product-manager-fintech-risk-management-at-intuit-4267239827", "source": "linkedin_rss_secondary", "posted_date": "2025-09-05T13:37:04+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:07.387622", "raw_data": {"entry_id": "a3932b8baabce200a89f1a0df2014b9e", "tags": [], "author": "LinkedIn"}}
{"id": "dda760fdcf1b", "title": "SoFi hiring Principal Product Manager, Pricing in New York, NY", "company": "SoFi", "location": "remote", "salary_range": null, "experience_required": null, "skills_mentioned": ["data analysis", "SQL", "stakeholder management", "pricing"], "industry": "fintech", "description": "Employee Applicant Privacy NoticeWho we are:Shape a brighter financial future with us.Together with our members, we’re changing the way people think about and interact with personal finance.We’re a next-generation financial services company and national bank using innovative, mobile-first technology to help our millions of members reach their goals. The industry is going through an unprecedented transformation, and we’re at the forefront. We’re proud to come to work every day knowing that what we do has a direct impact on people’s lives, with our core values guiding us every step of the way. Join us to invest in yourself, your career, and the financial world.The role:At SoFi, pricing is a key driver of our lending performance, and we’re investing in the infrastructure that powers it. As the Product Manager for our Pricing Platform, you’ll play a critical role in identifying, prioritizing, and building the tools and capabilities that enable smarter, faster, and more controlled pricing decisions.While you'll help streamline coordination across teams, the core of this role is about building leverage—designing systems and workflows that reduce manual effort, improve pricing agility, and embed robust controls. You’ll work closely with our Pricing team as well as cross-functional partners in Engineering, Data Science, and Risk to turn pricing goals into scalable product solutions. This is a high-impact opportunity for someone who wants to shape foundational platform capabilities and directly influence how SoFi prices and optimizes its lending products.What you'll do:Own and drive the roadmap for pricing infrastructure, integrations, and controls within our underwriting technology teamRepresent Pricing in cross-functional forums—capturing nuanced needs, translating them into specs, and ensuring they're tracked through deliveryCoordinate cross-team efforts for pricing, triage intake, and streamline meeting involvement to maximize efficiency related to pricingManage and prioritize the pricing backlog; align sprint plans with stakeholders across pricing, engineering, data science, underwriting, and riskImplement process improvements to optimize throughput and reduce cycle times for pricing-related initiativesBridge EPD and Pricing teams, serving as an embedded liaison in the Pricing team to ensure pricing thinking is integrated into lending products, platforms, and projects from inceptionDefine success metrics and leverage data (SQL-friendly) to guide prioritization and demonstrate impactWhat you’ll need:Bachelor's degree (preferable) or equivalent experience8+ years of product management experience, ideally with fintech exposureExcellent communication skills—able to engage seamlessly with technical, analytical, and business audiencesStrong organizational and project/program management skills; experience running technical sprints or complex launchesProven ability to manage backlogs, intake processes, and multiple stakeholder prioritiesCuriosity about loan pricing, credit risk, decision engines, and related infrastructure (or high willingness to dive in)Fluency with SQL and data analysis to inform prioritization and measure outcomesExperience in matrixed or hybrid org structures; ability to influence without direct authorityStrong stakeholder management and leadership skills, with a track record of fostering cross-functional alignmentNice to have:Experience building or scaling pricing engines, decisioning platforms, and/or price-optimizing toolsBackground in lendingExperience working with LLMs or generative AICompensation And BenefitsThe base pay range for this role is listed below. Final base pay offer will be determined based on individual factors such as the candidate’s experience, skills, and location.To view all of our comprehensive and competitive benefits, visit our Benefits at SoFi page!SoFi provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion (including religious dress and grooming practices), sex (including pregnancy, childbirth and related medical conditions, breastfeeding, and conditions related to breastfeeding), gender, gender identity, gender expression, national origin, ancestry, age (40 or over), physical or medical disability, medical condition, marital status, registered domestic partner status, sexual orientation, genetic information, military and/or veteran status, or any other basis prohibited by applicable state or federal law.The Company hires the best qualified candidate for the job, without regard to protected characteristics.Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.New York applicants: Notice of Employee RightsSoFi is committed to an inclusive culture. As part of this commitment, SoFi offers reasonable accommodations to candidates with physical or mental disabilities. If you need accommodations to participate in the job application or interview process, please let your recruiter know or email accommodations@sofi.com.Due to insurance coverage issues, we are unable to accommodate remote work from Hawaii or Alaska at this time.Internal EmployeesIf you are a current employee, do not apply here - please navigate to our Internal Job Board in Greenhouse to apply to our open roles.", "apply_url": "https://www.linkedin.com/jobs/view/principal-product-manager-pricing-at-sofi-4275510185", "source": "linkedin_rss_secondary", "posted_date": "2025-09-05T13:35:36+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:07.388808", "raw_data": {"entry_id": "add5a7611f312bc5f3ac8115b200a570", "tags": [], "author": "LinkedIn"}}
{"id": "511feb6cb82c", "title": "SoFi hiring Principal Product Manager, Pricing in San Francisco, CA", "company": "SoFi", "location": "remote", "salary_range": null, "experience_required": null, "skills_mentioned": ["data analysis", "SQL", "stakeholder management", "pricing"], "industry": "fintech", "description": "Employee Applicant Privacy NoticeWho we are:Shape a brighter financial future with us.Together with our members, we’re changing the way people think about and interact with personal finance.We’re a next-generation financial services company and national bank using innovative, mobile-first technology to help our millions of members reach their goals. The industry is going through an unprecedented transformation, and we’re at the forefront. We’re proud to come to work every day knowing that what we do has a direct impact on people’s lives, with our core values guiding us every step of the way. Join us to invest in yourself, your career, and the financial world.The role:At SoFi, pricing is a key driver of our lending performance, and we’re investing in the infrastructure that powers it. As the Product Manager for our Pricing Platform, you’ll play a critical role in identifying, prioritizing, and building the tools and capabilities that enable smarter, faster, and more controlled pricing decisions.While you'll help streamline coordination across teams, the core of this role is about building leverage—designing systems and workflows that reduce manual effort, improve pricing agility, and embed robust controls. You’ll work closely with our Pricing team as well as cross-functional partners in Engineering, Data Science, and Risk to turn pricing goals into scalable product solutions. This is a high-impact opportunity for someone who wants to shape foundational platform capabilities and directly influence how SoFi prices and optimizes its lending products.What you'll do:Own and drive the roadmap for pricing infrastructure, integrations, and controls within our underwriting technology teamRepresent Pricing in cross-functional forums—capturing nuanced needs, translating them into specs, and ensuring they're tracked through deliveryCoordinate cross-team efforts for pricing, triage intake, and streamline meeting involvement to maximize efficiency related to pricingManage and prioritize the pricing backlog; align sprint plans with stakeholders across pricing, engineering, data science, underwriting, and riskImplement process improvements to optimize throughput and reduce cycle times for pricing-related initiativesBridge EPD and Pricing teams, serving as an embedded liaison in the Pricing team to ensure pricing thinking is integrated into lending products, platforms, and projects from inceptionDefine success metrics and leverage data (SQL-friendly) to guide prioritization and demonstrate impactWhat you’ll need:Bachelor's degree (preferable) or equivalent experience8+ years of product management experience, ideally with fintech exposureExcellent communication skills—able to engage seamlessly with technical, analytical, and business audiencesStrong organizational and project/program management skills; experience running technical sprints or complex launchesProven ability to manage backlogs, intake processes, and multiple stakeholder prioritiesCuriosity about loan pricing, credit risk, decision engines, and related infrastructure (or high willingness to dive in)Fluency with SQL and data analysis to inform prioritization and measure outcomesExperience in matrixed or hybrid org structures; ability to influence without direct authorityStrong stakeholder management and leadership skills, with a track record of fostering cross-functional alignmentNice to have:Experience building or scaling pricing engines, decisioning platforms, and/or price-optimizing toolsBackground in lendingExperience working with LLMs or generative AICompensation And BenefitsThe base pay range for this role is listed below. Final base pay offer will be determined based on individual factors such as the candidate’s experience, skills, and location.To view all of our comprehensive and competitive benefits, visit our Benefits at SoFi page!SoFi provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion (including religious dress and grooming practices), sex (including pregnancy, childbirth and related medical conditions, breastfeeding, and conditions related to breastfeeding), gender, gender identity, gender expression, national origin, ancestry, age (40 or over), physical or medical disability, medical condition, marital status, registered domestic partner status, sexual orientation, genetic information, military and/or veteran status, or any other basis prohibited by applicable state or federal law.The Company hires the best qualified candidate for the job, without regard to protected characteristics.Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.New York applicants: Notice of Employee RightsSoFi is committed to an inclusive culture. As part of this commitment, SoFi offers reasonable accommodations to candidates with physical or mental disabilities. If you need accommodations to participate in the job application or interview process, please let your recruiter know or email accommodations@sofi.com.Due to insurance coverage issues, we are unable to accommodate remote work from Hawaii or Alaska at this time.Internal EmployeesIf you are a current employee, do not apply here - please navigate to our Internal Job Board in Greenhouse to apply to our open roles.", "apply_url": "https://www.linkedin.com/jobs/view/principal-product-manager-pricing-at-sofi-4275504974", "source": "linkedin_rss_secondary", "posted_date": "2025-09-05T13:28:03+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:07.389986", "raw_data": {"entry_id": "bf12556ff26aa19ad1b583cc560f89f7", "tags": [], "author": "LinkedIn"}}
{"id": "2189a060127c", "title": "SoFi hiring Principal Product Manager, Pricing in Cottonwood Heights, UT", "company": "SoFi", "location": "remote", "salary_range": null, "experience_required": null, "skills_mentioned": ["data analysis", "SQL", "stakeholder management", "pricing"], "industry": "fintech", "description": "Employee Applicant Privacy NoticeWho we are:Shape a brighter financial future with us.Together with our members, we’re changing the way people think about and interact with personal finance.We’re a next-generation financial services company and national bank using innovative, mobile-first technology to help our millions of members reach their goals. The industry is going through an unprecedented transformation, and we’re at the forefront. We’re proud to come to work every day knowing that what we do has a direct impact on people’s lives, with our core values guiding us every step of the way. Join us to invest in yourself, your career, and the financial world.The role:At SoFi, pricing is a key driver of our lending performance, and we’re investing in the infrastructure that powers it. As the Product Manager for our Pricing Platform, you’ll play a critical role in identifying, prioritizing, and building the tools and capabilities that enable smarter, faster, and more controlled pricing decisions.While you'll help streamline coordination across teams, the core of this role is about building leverage—designing systems and workflows that reduce manual effort, improve pricing agility, and embed robust controls. You’ll work closely with our Pricing team as well as cross-functional partners in Engineering, Data Science, and Risk to turn pricing goals into scalable product solutions. This is a high-impact opportunity for someone who wants to shape foundational platform capabilities and directly influence how SoFi prices and optimizes its lending products.What you'll do:Own and drive the roadmap for pricing infrastructure, integrations, and controls within our underwriting technology teamRepresent Pricing in cross-functional forums—capturing nuanced needs, translating them into specs, and ensuring they're tracked through deliveryCoordinate cross-team efforts for pricing, triage intake, and streamline meeting involvement to maximize efficiency related to pricingManage and prioritize the pricing backlog; align sprint plans with stakeholders across pricing, engineering, data science, underwriting, and riskImplement process improvements to optimize throughput and reduce cycle times for pricing-related initiativesBridge EPD and Pricing teams, serving as an embedded liaison in the Pricing team to ensure pricing thinking is integrated into lending products, platforms, and projects from inceptionDefine success metrics and leverage data (SQL-friendly) to guide prioritization and demonstrate impactWhat you’ll need:Bachelor's degree (preferable) or equivalent experience8+ years of product management experience, ideally with fintech exposureExcellent communication skills—able to engage seamlessly with technical, analytical, and business audiencesStrong organizational and project/program management skills; experience running technical sprints or complex launchesProven ability to manage backlogs, intake processes, and multiple stakeholder prioritiesCuriosity about loan pricing, credit risk, decision engines, and related infrastructure (or high willingness to dive in)Fluency with SQL and data analysis to inform prioritization and measure outcomesExperience in matrixed or hybrid org structures; ability to influence without direct authorityStrong stakeholder management and leadership skills, with a track record of fostering cross-functional alignmentNice to have:Experience building or scaling pricing engines, decisioning platforms, and/or price-optimizing toolsBackground in lendingExperience working with LLMs or generative AICompensation And BenefitsThe base pay range for this role is listed below. Final base pay offer will be determined based on individual factors such as the candidate’s experience, skills, and location.To view all of our comprehensive and competitive benefits, visit our Benefits at SoFi page!SoFi provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion (including religious dress and grooming practices), sex (including pregnancy, childbirth and related medical conditions, breastfeeding, and conditions related to breastfeeding), gender, gender identity, gender expression, national origin, ancestry, age (40 or over), physical or medical disability, medical condition, marital status, registered domestic partner status, sexual orientation, genetic information, military and/or veteran status, or any other basis prohibited by applicable state or federal law.The Company hires the best qualified candidate for the job, without regard to protected characteristics.Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.New York applicants: Notice of Employee RightsSoFi is committed to an inclusive culture. As part of this commitment, SoFi offers reasonable accommodations to candidates with physical or mental disabilities. If you need accommodations to participate in the job application or interview process, please let your recruiter know or email accommodations@sofi.com.Due to insurance coverage issues, we are unable to accommodate remote work from Hawaii or Alaska at this time.Internal EmployeesIf you are a current employee, do not apply here - please navigate to our Internal Job Board in Greenhouse to apply to our open roles.", "apply_url": "https://www.linkedin.com/jobs/view/principal-product-manager-pricing-at-sofi-4275510186", "source": "linkedin_rss_secondary", "posted_date": "2025-09-05T13:28:03+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:07.391588", "raw_data": {"entry_id": "46193a9bcc128d979ce7c062a390d149", "tags": [], "author": "LinkedIn"}}
{"id": "bb0ca5bac5fa", "title": "Intuit hiring Principal Product Manager- Agentic AI in Mountain View, CA", "company": "Intuit", "location": "View, CA", "salary_range": null, "experience_required": "senior", "skills_mentioned": ["A/B testing"], "industry": "fintech", "description": "OverviewIntuit TurboTax is building the future of Agentic tax preparation, leveraging LLMs, reasoning models, and computer-using agents. We're looking for a seasoned Product Manager to drive the strategy for this initiative. This involves designing and delivering robust AI agents capable of complex reasoning and task execution at massive scale, leveraging Intuit's unique data assets and tax knowledge. You will define how these agents perform their tasks, how they collaborate with customers, and how we build trust and ensure accuracy with non-deterministic technology. This role offers a unique opportunity to disrupt an industry impacting millions of Americans with cutting-edge technologies.What you'll bring6+ years designing and delivering world-class software products, with at least 5+ years in a Product Management role focused on platform, data-intensive systems, or AI/ML-powered experiences.Deep understanding and significant hands-on experience defining strategy for and shipping products leveraging Generative AI, Agentic AI systems, complex Machine Learning models, or Conversational AI to solve challenging user problems at scale.Passion for tackling complex consumer problems, ideally within fintech, personal finance, tax, or related domains where user trust, accuracy, and data privacy are paramount.Strong technical intuition; comfortable engaging deeply with engineering and data science on system architecture, model capabilities, APIs, and technical trade-offs. Ability to translate complex AI concepts into clear product requirements.Bachelor’s degree required with a focus in Computer Science, Engineering, Data Science, Statistics, Economics, Business Administration, or related quantitative/technical field preferred. An MBA is a plus. Equivalent experience will be considered.How you will leadDefine, own, and articulate a compelling vision, strategy, and multi-year roadmap for agentic AI capabilities within TurboTax, translating complex user needs and business opportunities into measurable outcomes.Lead the ideation, technical development, and launch of innovative agentic AI features and experiences, partnering deeply with AI/ML engineers, data scientists, designers, and tax experts to deliver high-accuracy, trustworthy, and confidence-building solutions.Drive product definition and requirements for underlying AI models, agent orchestration logic, and human-in-the-loop processes, balancing user experience with the high bar for accuracy required in tax.Design and execute data-driven experiments (including A/B testing and user studies) specifically to validate hypotheses related to agentic AI effectiveness, user trust, and impact on filer confidence and accuracy.Build strong partnerships and influence roadmaps across senior leaders and teams to ensure cohesive strategy and execution for agentic AI initiatives.Intuit provides a competitive compensation package with a strong pay for performance rewards approach. The expected base pay range for this position is: Bay Area California $236,000.00-319,000.00Southern California $213,500.00-288,500.00This position will be eligible for a cash bonus, equity rewards and benefits, in accordance with our applicable plans and programs (see more about our compensation and benefits at Intuit®: Careers | Benefits).Pay offered is based on factors such as job-related knowledge, skills, experience, and work location. To drive ongoing pay equity for employees, Intuit conducts regular comparisons across categories of ethnicity and gender.", "apply_url": "https://www.linkedin.com/jobs/view/principal-product-manager-agentic-ai-at-intuit-4277668912", "source": "linkedin_rss_secondary", "posted_date": "2025-09-05T13:27:39+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:07.392218", "raw_data": {"entry_id": "bc77d60e955ee94f6e5fdab66a42a3c4", "tags": [], "author": "LinkedIn"}}
{"id": "c74fb098bf48", "title": "Intuit hiring Senior Staff Product Manager- Data Integration in Mountain View, CA", "company": "Intuit", "location": "View, CA", "salary_range": null, "experience_required": "7 years of experience", "skills_mentioned": ["roadmapping", "agile"], "industry": "fintech", "description": "OverviewIf you are passionate about transforming lives and building scalable solutions, we invite you to join our team as a Senior Staff Platform Product Manager for Intuits data exchange platform. This platform, used by all Intuit products including QuickBooks, TurboxTax, Credit Karma, Mailchimp,etc to exchange data with external data sources encompasses mission-critical capabilities that deliver true customer benefit and generate significant revenue for the Intuit products.This role entails continuously identifying and evaluating new sources of data that can enhance our product offerings and reduce friction for our customers and developers. You will ead efforts to onboard new data providers and integrate their data into our ecosystem.We are seeking creative, detail-oriented candidates who excel at solving complex technical problems through diving into architecture, analyzing user experience data, translating real-life workflows, and defining high-scale services. Our team values collaboration, and we are eager to welcome new members who possess a deep technical understanding, customer empathy, creative grit, and a proven track record of forming strong business partnerships and delivering impactful results.The Senior Staff Platform Product Manager at Intuit is pivotal in shaping the strategic vision for the platform product team and managing key product initiatives. This role involves close collaboration with cross-functional stakeholders to ensure the timely, efficient, and successful launch and delivery of products, while maintaining technical excellence and a deep understanding of organizational strategyWhat you'll bringBachelor’s degree in Engineering, Computer Science, or a related field.5-7 years of experience in product management or a related field.Strong understanding of APIs, Industry standards and platform design principles.Domain knowledge in FinTech, Banking Standards, Payments, and Tax Compliance is advantageous.Ability to align long-term transformation goals with immediate delivery milestones.In-depth knowledge of product management processes and adeptness at driving consensus across diverse teams.Excellent written and verbal communication skills, including the ability to clearly and compellingly influence stakeholders and senior leadership.Demonstrated excellence in executing transformation roadmaps and delivering incremental value while addressing legacy system deprecation.Proven experience in platform PM roles and delivering platform capabilities that meet enterprise needs.Quick learner with minimal supervision required to become a domain expert.Demonstrable technical depth in SaaS software development, with robust engagement with engineering and architecture teams.Proven success in a data-driven approach and delivering impactful business results.Demonstrated proficiency in program/project management and success in managing complex deliveries across multiple teams.Experience with Agile methodologies as the product owner, establishing clear requirements through detailed epics.Proven ability in defining ambitious visions and inspiring teams to deliver innovative and impactful products.Track record of working closely with customers and partners, adopting a customer-focused approach to strategy and priorities with a passion for customer engagement.Exceptional collaboration skills, leading execution across teams and influencing across organizations.How you will leadDevelop and execute strategy for data integration based on customer requirements and business objectives.Establish both short-term and long-term visions and roadmaps in collaboration with various stakeholders. Employ prolific writing skills to craft effective Product Requirements Documents, decision documents, executive summaries, and presentations for communication across various levels from engineers and architects to senior executives.Work closely with external partners, architects and engineers to design and build secure, high-scale integrations.Ensure high-quality outcomes, maintaining existing integrations and data quality, proactively resolving integration issues in collaboration with partners.Oversee the product management process from backlog grooming and roadmapping to prioritizing initiatives and features, partnering with engineering and architecture colleagues.Resolve upstream and downstream dependency requests and timelines efficiently..Implement prioritization principles using a data-backed approach for defining prioritization and making tradeoff decisions.Utilize data-driven methods to define and measure success metrics, prioritize requirements, and communicate plans and launches.Collaborate with program management to ensure precise project execution and delivery by managing dependencies and plans across various services and teams.Conduct customer discovery with end-users and developers to understand their challenges and derive insights on resolving significant customer issues delightfully.Represent Intuit at various Industry standards and influence them per Intuit product needs.Intuit provides a competitive compensation package with a strong pay for performance rewards approach. The expected base pay range for this position is: Bay Area California $196,500.00-266,000.00This position will be eligible for a cash bonus, equity rewards and benefits, in accordance with our applicable plans and programs (see more about our compensation and benefits at Intuit®: Careers | Benefits).Pay offered is based on factors such as job-related knowledge, skills, experience, and work location. To drive ongoing pay equity for employees, Intuit conducts regular comparisons across categories of ethnicity and gender.", "apply_url": "https://www.linkedin.com/jobs/view/senior-staff-product-manager-data-integration-at-intuit-4278553412", "source": "linkedin_rss_secondary", "posted_date": "2025-09-05T13:27:36+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:07.392931", "raw_data": {"entry_id": "ae7dfe9e33515189de821fa99f576e63", "tags": [], "author": "LinkedIn"}}
{"id": "981d5befe55e", "title": "Intuit hiring Principal Product Manager - Money Products in Mountain View, CA", "company": "Intuit", "location": "View, CA", "salary_range": null, "experience_required": "senior", "skills_mentioned": [], "industry": "fintech", "description": "OverviewOur Money Products aim to help customers achieve financial progress by offering solutions for faster refunds, short-term lending, flexible payment options, and convenient banking. Our mission is to transform \"making ends meet\" from mere survival to creating genuine financial progress through technology-forward solutions.We are seeking a product manager who is curious and empathetic, capable of developing a deep understanding of our customers to create innovative fintech products. This role involves defining and leading the strategy and product management for new (0 to 1) fintech products in the Money space, with an initial focus on stablecoins.This is an opportunity for significant growth, challenging you to think bolder, move faster, and make a greater impact on a transformative offering. You will build strong partnerships with a talented group of engineers, collaborative and creative designers, marketing professionals, product managers, data scientists, and fintech experts, ensuring a rich and enjoyable learning experience every day.What you'll bring8+ years designing and delivering world-class software products in a Product Management role of which at least 4+ years are in fintech (payments or commerce or related industries)Proven track record of delivering results that have critical customer and business impact.Technical Product Management experience working with engineering. AI & ML experience in product offerings/experiences a plus.Energized by working across multiple partnerships and strong inﬂuencing skills.Excels at driving prioritization and feature requirements to capabilities teamsStrong ability to analyze and interpret data to inform decision making.Has a 'can do' attitude with an entrepreneurial mindset and is comfortable working in a fast-paced, ambiguous environment.Insanely curious, with a strong desire to learn and continuously improve.Bachelor’s degree required with a focus in computer science, business administration or related field. An MBA is preferred. Equivalent experience will be considered.How you will leadDefine vision into strategy and an execution roadmap to deliver measurable outcomes across a portfolio of fintech products.Understands how to deliver capabilities and experiences that will be shared across multiple personas and customer archetypes.Strong written and verbal communication, with the ability to develop working relationships with senior end executive leaders across IntuitRaises the bar for PM talent on the team through mentorship and coaching of other PMs on tactical execution and strategy.Identiﬁes new opportunities based on customer and competitive research, industry trends and best practices.Creates and maintains momentum, helping teams move forward swiftly and with rigor, a learning mindset, and a bias toward action.Continuously monitor and analyze customer feedback, market trends, and usage data to identify opportunities for improvements and new feature development.Identify and evaluate opportunities to accelerate delivery through the use of AI & ML", "apply_url": "https://www.linkedin.com/jobs/view/principal-product-manager-money-products-at-intuit-4283965202", "source": "linkedin_rss_secondary", "posted_date": "2025-09-05T13:27:35+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:07.393602", "raw_data": {"entry_id": "189b50016f152ce81b8edcc22d418eca", "tags": [], "author": "LinkedIn"}}
{"id": "fd2ba19f4acb", "title": "Intuit hiring Principal Product Manager - Money Products in San Diego, CA", "company": "Intuit", "location": "Diego, CA", "salary_range": null, "experience_required": "senior", "skills_mentioned": [], "industry": "fintech", "description": "OverviewOur Money Products aim to help customers achieve financial progress by offering solutions for faster refunds, short-term lending, flexible payment options, and convenient banking. Our mission is to transform \"making ends meet\" from mere survival to creating genuine financial progress through technology-forward solutions.We are seeking a product manager who is curious and empathetic, capable of developing a deep understanding of our customers to create innovative fintech products. This role involves defining and leading the strategy and product management for new (0 to 1) fintech products in the Money space, with an initial focus on stablecoins.This is an opportunity for significant growth, challenging you to think bolder, move faster, and make a greater impact on a transformative offering. You will build strong partnerships with a talented group of engineers, collaborative and creative designers, marketing professionals, product managers, data scientists, and fintech experts, ensuring a rich and enjoyable learning experience every day.What you'll bring8+ years designing and delivering world-class software products in a Product Management role of which at least 4+ years are in fintech (payments or commerce or related industries)Proven track record of delivering results that have critical customer and business impact.Technical Product Management experience working with engineering. AI & ML experience in product offerings/experiences a plus.Energized by working across multiple partnerships and strong inﬂuencing skills.Excels at driving prioritization and feature requirements to capabilities teamsStrong ability to analyze and interpret data to inform decision making.Has a 'can do' attitude with an entrepreneurial mindset and is comfortable working in a fast-paced, ambiguous environment.Insanely curious, with a strong desire to learn and continuously improve.Bachelor’s degree required with a focus in computer science, business administration or related field. An MBA is preferred. Equivalent experience will be considered.How you will leadDefine vision into strategy and an execution roadmap to deliver measurable outcomes across a portfolio of fintech products.Understands how to deliver capabilities and experiences that will be shared across multiple personas and customer archetypes.Strong written and verbal communication, with the ability to develop working relationships with senior end executive leaders across IntuitRaises the bar for PM talent on the team through mentorship and coaching of other PMs on tactical execution and strategy.Identiﬁes new opportunities based on customer and competitive research, industry trends and best practices.Creates and maintains momentum, helping teams move forward swiftly and with rigor, a learning mindset, and a bias toward action.Continuously monitor and analyze customer feedback, market trends, and usage data to identify opportunities for improvements and new feature development.Identify and evaluate opportunities to accelerate delivery through the use of AI & ML", "apply_url": "https://www.linkedin.com/jobs/view/principal-product-manager-money-products-at-intuit-4283965204", "source": "linkedin_rss_secondary", "posted_date": "2025-09-05T13:27:34+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:07.394223", "raw_data": {"entry_id": "4ba11aa1dc95ccd81096b09d4b3725ac", "tags": [], "author": "LinkedIn"}}
{"id": "82d4d68130f6", "title": "Intuit hiring Principal Product Manager- Agentic AI in San Diego, CA", "company": "Intuit", "location": "Diego, CA", "salary_range": null, "experience_required": "senior", "skills_mentioned": ["A/B testing"], "industry": "fintech", "description": "OverviewIntuit TurboTax is building the future of Agentic tax preparation, leveraging LLMs, reasoning models, and computer-using agents. We're looking for a seasoned Product Manager to drive the strategy for this initiative. This involves designing and delivering robust AI agents capable of complex reasoning and task execution at massive scale, leveraging Intuit's unique data assets and tax knowledge. You will define how these agents perform their tasks, how they collaborate with customers, and how we build trust and ensure accuracy with non-deterministic technology. This role offers a unique opportunity to disrupt an industry impacting millions of Americans with cutting-edge technologies.What you'll bring6+ years designing and delivering world-class software products, with at least 5+ years in a Product Management role focused on platform, data-intensive systems, or AI/ML-powered experiences.Deep understanding and significant hands-on experience defining strategy for and shipping products leveraging Generative AI, Agentic AI systems, complex Machine Learning models, or Conversational AI to solve challenging user problems at scale.Passion for tackling complex consumer problems, ideally within fintech, personal finance, tax, or related domains where user trust, accuracy, and data privacy are paramount.Strong technical intuition; comfortable engaging deeply with engineering and data science on system architecture, model capabilities, APIs, and technical trade-offs. Ability to translate complex AI concepts into clear product requirements.Bachelor’s degree required with a focus in Computer Science, Engineering, Data Science, Statistics, Economics, Business Administration, or related quantitative/technical field preferred. An MBA is a plus. Equivalent experience will be considered.How you will leadDefine, own, and articulate a compelling vision, strategy, and multi-year roadmap for agentic AI capabilities within TurboTax, translating complex user needs and business opportunities into measurable outcomes.Lead the ideation, technical development, and launch of innovative agentic AI features and experiences, partnering deeply with AI/ML engineers, data scientists, designers, and tax experts to deliver high-accuracy, trustworthy, and confidence-building solutions.Drive product definition and requirements for underlying AI models, agent orchestration logic, and human-in-the-loop processes, balancing user experience with the high bar for accuracy required in tax.Design and execute data-driven experiments (including A/B testing and user studies) specifically to validate hypotheses related to agentic AI effectiveness, user trust, and impact on filer confidence and accuracy.Build strong partnerships and influence roadmaps across senior leaders and teams to ensure cohesive strategy and execution for agentic AI initiatives.Intuit provides a competitive compensation package with a strong pay for performance rewards approach. The expected base pay range for this position is: Bay Area California $236,000.00-319,000.00Southern California $213,500.00-288,500.00This position will be eligible for a cash bonus, equity rewards and benefits, in accordance with our applicable plans and programs (see more about our compensation and benefits at Intuit®: Careers | Benefits).Pay offered is based on factors such as job-related knowledge, skills, experience, and work location. To drive ongoing pay equity for employees, Intuit conducts regular comparisons across categories of ethnicity and gender.", "apply_url": "https://www.linkedin.com/jobs/view/principal-product-manager-agentic-ai-at-intuit-4277671665", "source": "linkedin_rss_secondary", "posted_date": "2025-09-05T13:25:54+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:07.394843", "raw_data": {"entry_id": "9bc2e8dcc128b1c7e9cfc7d3effda4e2", "tags": [], "author": "LinkedIn"}}
{"id": "01ceed284035", "title": "Intuit hiring Staff Product Manager - Next Gen SMB Credit in Mountain View, CA", "company": "Intuit", "location": "View, CA", "salary_range": "$180,500 - $244,000", "experience_required": "Staff", "skills_mentioned": [], "industry": "fintech", "description": "OverviewIntuit is the global financial technology platform that powers prosperity for the people and communities we serve. With TurboTax, Credit Karma, QuickBooks, and Mailchimp, we solve our customers' most critical financial problems. We sit at the unique intersection of deep customer relationships, rich financial data, and powerful technology – poised to revolutionize access to capital. Our mission is to unlock fair credit access for all. Become the de-facto, seamless one-stop-shop where consumers and small businesses never question their access to capital – be it loans, lines of credit, or trade payment terms. Bringing clarity to an opaque credit system, helping users to graduate to better credit offers, and solving their cash flow problems is the intersection at which you would operate.Join Intuit's Fintech product team as a Staff Product Manager and be the architect of our lending future. You will play a pivotal role in realizing our bold vision: transforming Intuit into a destination lender where best-in-class credit access becomes a primary reason users join and stay within the Intuit ecosystem. Leverage our unparalleled data assets (TurboTax, QuickBooks, Credit Karma) and AI/GenAI capabilities to build a unified, compelling lending platform that deeply integrates across our products, making Intuit indispensable in their financial lives.What you'll bringWho You AreStrategic Platform Thinker: 7+ years of product management experience with a proven track record of building and scaling complex platforms or ecosystems, preferably in fintech, lending, payments, or financial services. Experience with marketplace or multi-sided platforms is a strong plus.Lending & Risk Fluency: Solid understanding of lending products (consumer/SMB loans, lines of credit, trade credit), credit risk principles, underwriting, and regulatory compliance.Ecosystem & Integration Expertise: Deep understanding of how to leverage data and capabilities across disparate products to create unified customer experiences and drive network effects. Experience working in or with large product ecosystems is crucial.Data & AI Acumen: Strong understanding of leveraging large datasets for product innovation. Passionate about AI/ML/GenAI and its application to solve customer problems at scale. Ability to partner deeply with Data Science and ML Engineering.Growth Mindset (Ecosystem Focus): Proven experience driving user acquisition, engagement, and retention through platform strategies and integrated experiences. Focused on making your product area a primary acquisition channel.Customer Obsession: Deep empathy for SMBs and consumers, particularly around financial stress and credit access. Experience building products that become essential to daily workflows or financial health.Exceptional Influencer & Communicator: Outstanding ability to build relationships, align roadmaps, and drive execution across multiple senior product leaders and cross-functional teams (Engineering, Design, Data Science, Marketing, Risk, Legal, Compliance, Operations). Master storyteller.Technical Proficiency: Ability to engage credibly with engineering and architecture on platform design, APIs, and data integration challenges.Bachelor's degree required. MBA or Master's degree in a related field is highly desirable.How You Will LeadThink Big, Start Here, Move Fast: Define the ambitious destination lender vision and drive rapid, high-impact execution to make it real.Customer-Driven Platform Strategy: Obsess over customer jobs across the Intuit ecosystem and build lending solutions that solve them seamlessly, making Intuit indispensable.Own the Ecosystem Impact: Take end-to-end ownership of how lending drives value for the entire Intuit customer base and product portfolio.Build for Synergy: Relentlessly identify and execute on opportunities where lending makes other Intuit products better, and vice-versa. Foster unprecedented collaboration across product boundaries. Be the glue that unites lending initiatives across TurboTax, QuickBooks, and Credit Karma.This is your chance to redefine why millions join Intuit. If you're passionate about building transformative platform experiences, leveraging data and AI for good, and making fair credit access a reality within a powerful ecosystem, we need you.Intuit provides a competitive compensation package with a strong pay for performance rewards approach. The expected base pay range for this position is: Bay Area California $180,500 - $244,000This position will be eligible for a cash bonus, equity rewards and benefits, in accordance with our applicable plans and programs (see more about our compensation and benefits at Intuit®: Careers | Benefits).Pay offered is based on factors such as job-related knowledge, skills, experience, and work location. To drive ongoing pay equity for employees, Intuit conducts regular comparisons across categories of ethnicity and gender.How you will leadWhat You’ll DoDefine the Destination Lender Strategy: Craft and evangelize the product vision and strategy to position Intuit as the primary lending destination for consumers and SMBs. Make lending a core acquisition driver and ecosystem differentiator.Build the One-Stop Credit Platform: Own the end-to-end strategy and execution for a unified lending platform offering loans, lines of credit, and trade credit solutions. Create a seamless, integrated experience that feels native across TurboTax (e.g., refund advances, debt consolidation), QuickBooks (e.g., cash flow-based financing, supplier payments), and Credit Karma.Leverage the Intuit Data Moat: Champion the innovative use of unique Intuit ecosystem data (income, cash flow, tax, business health, credit) combined with AI/GenAI to deliver hyper-personalized offers, instant decisions, fairer risk assessment, and superior customer experiences that only Intuit can provide.Drive Ecosystem Synergy: Identify and execute on high-impact opportunities where lending deeply integrates with and enhances other Intuit products, creating powerful \"jobs to be done\" solutions that increase overall customer value and retention. Make lending a reason to start and deepen an Intuit relationship.Lead Cross-Product Integration: Collaborate intensively with Product Leaders across TurboTax, QuickBooks, Credit Karma, and Mailchimp to embed lending moments naturally and compellingly within their user journeys. Define the platform capabilities needed to enable seamless cross-product lending experiences.Champion Fairness & Access: Ensure our platform expands access responsibly, using AI and alternative data to serve underserved segments while rigorously upholding fairness, transparency, and compliance (Fair Lending, UDAAP).Own Platform Growth & Metrics: Define and track success metrics focused on ecosystem impact: user acquisition driven by lending, cross-product adoption/retention, platform utilization, total credit facilitated, customer satisfaction, and fair access benchmarks.Set the AI/GenAI Agenda: Drive the strategic application of AI and Generative AI across the lending lifecycle (personalization, automation, underwriting, risk, servicing) to create magical experiences and unmatched efficiency for customers.", "apply_url": "https://www.linkedin.com/jobs/view/staff-product-manager-next-gen-smb-credit-at-intuit-4275623923", "source": "linkedin_rss_secondary", "posted_date": "2025-09-05T13:24:42+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:07.395893", "raw_data": {"entry_id": "75be59933441652389711c24c3499e0a", "tags": [], "author": "LinkedIn"}}
{"id": "d92bd462f0f6", "title": "Citizens hiring Consumer Digital Payments Senior Product Manager in New York, NY", "company": "Citizens", "location": "York, NY", "salary_range": null, "experience_required": "5+ years of experience", "skills_mentioned": ["product strategy", "agile", "stakeholder management", "user stories", "OKRs"], "industry": "fintech", "description": "DescriptionDescription:Citizens Bank is seeking a highly motivated, passionate, and collaborative individual to serve as a Senior Product Manager and help drive our Consumer Digital Payments agenda forward. With focus on every day and highly utilized money movement capabilities such as transfers, this person will impact payments initiatives at the enterprise level. The ideal candidate will have prior product management experience and knowledge of transfers and money movement in the U.S. The role will specifically focus on internal and external transfers, as well as real-time payments. This person will need to work across the organization in close partnership with other digital product teams, technology and strategy functions in an Agile environment; and externally with fintechs and platform / capability vendors.The role will consist of high-level strategy and roadmap management as well as tactical execution, particularly in bringing initiatives from the ideation stage to the project launch. This individual will participate in defining, developing, and leading the implementation of product roadmaps and capabilities to support business and customer needs.ResponsibilitiesOwn the end-to-end product lifecycle for transfers and real-time payments, from ideation to launch and optimization.Develop and maintain a strategic roadmap aligned with customer needs, market trends, and business objectives.Lead cross-functional pods including engineering, design, compliance, and marketing to deliver high-quality payment solutions.Partner with fintechs and platform vendors to evaluate and integrate cutting-edge capabilities.Conduct market and competitive research to identify opportunities and inform product strategy.Define and track OKRs to measure product success and drive continuous improvement.Translate business strategy into actionable user stories and acceptance criteria.Prioritize and manage the product backlog to ensure timely delivery of features.Support executive-level presentations and storytelling to communicate product vision and impact.Champion Human-Centered Design and data-driven decision-making to enhance customer experience.Ensure compliance with banking regulations and internal risk policies.Qualifications5+ years of experience in product management within banking, fintech, or payments.Proven track record of launching and scaling digital payment products, especially ACH and RTP.Strong strategic thinking and ability to operate in ambiguous environments.Excellent communication and stakeholder management skills.Experience working in Agile teams and leading cross-functional pods.Familiarity with payment networks, real-time rails, and regulatory frameworks.Bachelor’s degree in Business, Computer Science, or related field (MBA preferred). Some job boards have started using jobseeker-reported data to estimate salary ranges for roles. If you apply and qualify for this role, a recruiter will discuss accurate pay guidance.Equal Employment OpportunityCitizens, its parent, subsidiaries, and related companies (Citizens) provide equal employment and advancement opportunities to all colleagues and applicants for employment without regard to age, ancestry, color, citizenship, physical or mental disability, perceived disability or history or record of a disability, ethnicity, gender, gender identity or expression, genetic information, genetic characteristic, marital or domestic partner status, victim of domestic violence, family status/parenthood, medical condition, military or veteran status, national origin, pregnancy/childbirth/lactation, colleague’s or a dependent’s reproductive health decision making, race, religion, sex, sexual orientation, or any other category protected by federal, state and/or local laws. At Citizens, we are committed to fostering an inclusive culture that enables all colleagues to bring their best selves to work every day and everyone is expected to be treated with respect and professionalism. Employment decisions are based solely on merit, qualifications, performance and capability.Why Work for UsAt Citizens, you'll find a customer-centric culture built around helping our customers and giving back to our local communities. When you join our team, you are part of a supportive and collaborative workforce, with access to training and tools to accelerate your potential and maximize your career growth", "apply_url": "https://www.linkedin.com/jobs/view/consumer-digital-payments-senior-product-manager-at-citizens-4274712403", "source": "linkedin_rss_secondary", "posted_date": "2025-09-05T13:19:59+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:07.396498", "raw_data": {"entry_id": "5b1ebd2d150e4c3646fccf1fda6f04ac", "tags": [], "author": "LinkedIn"}}
{"id": "a04203c94b00", "title": "Intuit hiring Principal Product Manager - Monetization Platform in Mountain View, CA", "company": "Intuit", "location": "View, CA", "salary_range": null, "experience_required": "Principal", "skills_mentioned": ["roadmapping", "user research", "go-to-market", "pricing"], "industry": "fintech", "description": "OverviewIntuit is the global financial technology platform that powers prosperity for the people and communities we serve. With approximately 100 million customers worldwide using products such as TurboTax, Credit Karma, QuickBooks, and Mailchimp, we believe that everyone should have the opportunity to prosper. We never stop working to find new, innovative ways to make that possible.Intuit has a vision to be the leading provider of integrated business tools and expert services for the mid-market segment, with solutions that can be customized for unique business needs at every stage of the business lifecycle. We deliver a completely connected solution that consists of QuickBooks Online Accounting products, QuickBooks Workforce Solutions including Online Payroll and Time, QuickBooks Online Payments and Bill Pay, Mailchimp, and deep integrations with 3P apps - at a disruptive price and packaged and serviced as a flexible unified solution.As we expand our product offerings to win with mid-market customers, we are building out acomplementary Lead-to-Cash process that streamlines our sales motions and scales operations to disrupt the segment and turbocharge adoption. You will be at the epicenter of driving this transformation - defining a roadmap and building innovative Lead-to-Cash capabilities to power Intuit’s entire customer life-cycle from new sales to execution to amendments and renewals with speed, scale, flexibility and control.We are seeking a Principal Product Manager with hands-on expertise and a proven record of designing & shipping enterprise capabilities such as lead and opportunity management, configure price quote (CPQ), contract lifecycle management (CLM), contract-based order and billing, and credit and collections. You will be responsible for leading the Lead-to-cash platform build out in support of our mid-market go-to-market motion - conducting industry and user research, roadmapping, and shipping awesome experiences and services that unlock exponential growth. Hand-on experience in optimizing deal win rate, partner channels conversion, and revenue across renewal and amendments is a plus.What you'll bring10+ years of product management experience, with a focus in delivering Monetization and/or Sales solutions for mid-market / enterprise customersDomain expertise in building mid-market monetization capabilities that serve SaaS and/or Fintech industries with sophisticated product and pricing modelsDeep customer empathy and curiosity on what’s right for our customers and operational teamsPassion for identifying the most important problems and solving them to provide immediate valueAbility to prioritize across multiple workstreams and work in parallel across projects at different stagesTrack record of influencing other teams and stakeholdersStrong analytical chops paired with a data-informed mindsetGood understanding of AI landscape and technologies impacting SaaS industryUndergraduate degree required. Preference for focus in computer science, electrical engineering, or a related technical discipline. Equivalent work experience will be considered. MBA or advanced degree preferred.How you will leadDefine vision, strategy and roadmap to build a world class Lead-to-Cash platform thatturbocharges Intuit’s mid-market go-to-market motionBenchmark and apply best practices from across the industry and vendors to inform ourroadmap, target state capabilities and build vs. buy decisionsConduct follow-me-homes across customers, sales teams and operations teams to understand their needs and bottlenecks and inspire innovative solutionsRally leadership, sales, marketing, product, finance, legal, care, engineers, designers and data analysts to identify and solve customer problems and win togetherDrive short and long decisions and solutions to enable scale and test out hypothesis/leap of faith assumptionsDocument, comprehensive use cases, in-depth requirements and thought provoking wireframes based on customer insights, user feedbacks, key metrics and data insightsLeverage and incorporate Gen AI solutions into the business workflows to drive productivity", "apply_url": "https://www.linkedin.com/jobs/view/principal-product-manager-monetization-platform-at-intuit-4296426809", "source": "linkedin_rss_secondary", "posted_date": "2025-09-05T13:07:43+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:07.397150", "raw_data": {"entry_id": "ba711ede04b2297d0f755a4b9e5ba679", "tags": [], "author": "LinkedIn"}}
{"id": "986dac9b9e67", "title": "Intuit hiring Staff Product Manager, Agentic AI in Mountain View, CA", "company": "Intuit", "location": "View, CA", "salary_range": null, "experience_required": "Staff", "skills_mentioned": ["product strategy", "A/B testing"], "industry": "fintech", "description": "OverviewIntuit is seeking an exceptional Staff Product Manager to define the vision and strategy for its business tax offering for QuickBooks customers. This pivotal role will be responsible for solving the needs of accountants & all business sizes and types, from small and medium businesses to mid-market. You will be at the forefront of pioneering the future of business tax preparation by leveraging Agentic AI systems to create \"done-for-you\" experiences for businesses & accountants. This unique opportunity allows you to disrupt an industry, impacting millions of businesses by designing and delivering robust AI agents capable of complex reasoning and task execution at massive scale, all while building trust and ensuring accuracy.What you'll bringSuccessful Candidates For This Role Will Possess6+ years designing and delivering world-class software products, with at least 5+ years in a Product Management role, ideally focused on platform, data-intensive systems, or AI/ML-powered experiences.Deep understanding and significant hands-on experience defining strategy for and shipping products leveraging Generative AI, Agentic AI systems, complex Machine Learning models, or Conversational AI to solve challenging user problems at scale.Passion for tackling complex business problems, ideally within fintech, personal finance, tax, or related domains where user trust, accuracy, and data privacy are paramount.Organizational effectiveness, navigating cross-functional, cross-business unit teams, reaching alignment on roadmaps and goals to deliver high-quality end to end customer experiences.Platform mindset, centered on defining capability strategies, and ensures cross-capability durability to accelerate the product strategy and roadmap across multiple domains.A data-driven mindset combined with strong analytical skills. Proven track record of leveraging A/B testing, behavioral insights, and ML models to optimize funnel performance and drive conversion/engagement improvements.A Bachelor’s degree required with a focus in Computer Science, Engineering, Data Science, Statistics, Economics, Business Administration, or a related quantitative/technical field preferred. A Master’s degree or MBA is a plus.Excellent communication skills, with the ability to prioritize, influence, and align teams, including senior executives and cross-functional partners.Comfortable working in ambiguity, quickly iterating on hypotheses, and prioritizing high-impact initiatives.How you will leadAs a Staff Product Manager, Your Responsibilities Will IncludeDefining, owning, and articulating a compelling vision, strategy, and multi-year roadmap for the business tax offering, including agentic AI capabilities within, uncovering & translating complex user needs and business opportunities into measurable outcomes.Leading the ideation, technical development, and launch of innovative AI-powered features and experiences for businesses, partnering deeply with AI/ML engineers, data scientists, designers, and tax experts.Driving product definition and requirements for underlying AI models, agent orchestration logic, and human-in-the-loop processes, carefully balancing user experience with the high bar for accuracy required in tax.Partnering closely with the TurboTax Business Tax team & Accountant segment to ensure cohesive strategy, seamless E2E solutions across Intuit platform, as well as collaborating with marketing, design, engineering, data science, and research teams. Driving in-depth research and testing to deeply understand small-business and mid-market and other business customer problems and their top jobs-to-be-done as relates to tax.Designing and executing data-driven experiments (including A/B testing and user studies) to validate hypotheses related to agentic AI effectiveness, user trust, and impact on business filer confidence and accuracy.Developing and tracking key metrics to measure how well capabilities meet market needs, based on partner input and competitive benchmarking, taking a data-driven approach to define success, track progress, and make informed decisions.Ruthlessly prioritizing initiatives and driving end-to-end product execution, from identifying unmet customer needs and defining requirements to launching, measuring success, and iterating based on outcomes.Partner with the marketing in developing the value proposition and benefits of our business tax products.", "apply_url": "https://www.linkedin.com/jobs/view/staff-product-manager-agentic-ai-at-intuit-4296427795", "source": "linkedin_rss_secondary", "posted_date": "2025-09-05T13:07:43+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:07.397883", "raw_data": {"entry_id": "45f7adb74fb3336f1f2a5ceca345e17b", "tags": [], "author": "LinkedIn"}}
{"id": "0dc7c1dc92f6", "title": "Stampli hiring Product Manager - Platform in Mountain View, CA", "company": "Stampli", "location": "View, CA", "salary_range": null, "experience_required": null, "skills_mentioned": ["market research", "KPIs"], "industry": "fintech", "description": "About The PositionStampli, a leader in B2B SaaS and fintech innovation, is seeking a Product Manager – Platform to lead new features and capabilities—from ideation to execution—in Stampli’s AI-First AP automation environment. You’ll serve as the primary voice for our U.S. customers—partnering with Sales, CS, PMM, and Support across North America—while working closely with our Israel-based engineering and design teams to define and deliver impactful, intuitive enhancements that scale our platform.In this role, you will collaborate with teams in the US and Israel, reporting to the Director of Product for Platform.What You Will DoLead the end-to-end delivery of new platform features and capabilities, focusing on North American market needs, time-zoned collaboration, and AI-first opportunities.Partner regularly with U.S. Sales, CS, and Support to triage escalations, gather insights, and feed prioritized enhancements back to Tel Aviv squads.Translate U.S. customer feedback and market research into clear, async-friendly PRDs; participate in regular overlap sessions to align on scope and timelines.Drive GTM readiness alongside PMM: create enablement materials for sales tailored to different customer types.Collaborate with design and engineering in Israel to craft simple, user-centric interfaces that embed AI intelligence into core workflows.Establish and track success metrics (feature adoption, escalations resolution time) and use data to iterate continuously.Willing to travel to our Tel Aviv offices as needed.What You Will Bring5+ years of product management experience in SaaS B2B, with direct ownership of feature development for U.S. mid-market or enterprise finance teams.Proven track record collaborating remotely with offshore engineering teams, managing time-zone differences, and establishing async processes.Strong written and verbal communication: you’re skilled at writing clear specifications and documenting workflows for cross-functional teams.Strong analytical mindset: define and track KPIs, run A/B tests, and leverage usage data to drive prioritization.Demonstrated ability to lead customer research and translate insights into successful product enhancements.Bias for action, comfort in a fast-paced, high-ownership culture, and passion for AI-powered workflows.You Will GetThe flexibility of working from our Mountain View, CA office three days a week (Tuesday, Wednesday, and Thursday), with the option to work remotely for the remainder of the week.Full medical, dental, and vision insurance401(k) + employer matchAccess to cutting-edge AI tools, including ChatGPT Enterprise, to enhance productivity, support innovation, and streamline daily workflowsOpportunities and development for career and personal growthStrong and experienced leadership that supports your growth and successAn open-concept, modern workspace within an inclusive and dynamic scale-up cultureThe compensation range for this position is $120,000–$130,000 and bonus and equity. Compensation offered will be determined by factors such as location, level, job-related knowledge, skills, and experience.Why Join Stampli?Stampli is revolutionizing financial operations with AI, far ahead of competitors. For nearly a decade, our AI assistant, Billy the Bot™, has set the industry standard—processing $100B+ in invoices annually and saving millions of labor hours for 1,600+ customers. More than automation, Billy transforms finance teams by freeing them of manual work.Our explosive growth places us among the top tech companies at our stage, with exceptionally low churn. After conquering the Accounts Payable space, we're now revolutionizing the entire procure-to-pay (P2P) lifecycle with our new platform that \"connects every dot from request to reconciliation.\"What sets us apart? We adapt to customers—not the other way around—integrating with 70+ ERPs in weeks, not months. Our customer-first approach extends to our award-winning workplace culture, with vibrant, global offices. We've earned multiple Comparably awards, including Best Company Outlook, Work-Life Balance, Compensation, Happiness, and Perks & Benefits.Here at Stampli, we build exceptional products with exceptional people. Join our dynamic team where your career will thrive in an environment that champions creativity, collaboration, and growth!", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-platform-at-stampli-4286267759", "source": "linkedin_rss_secondary", "posted_date": "2025-09-05T13:06:39+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:07.398743", "raw_data": {"entry_id": "3f78686c2a1acf10537cf1354f9a63e4", "tags": [], "author": "LinkedIn"}}
{"id": "7f8b977e2a94", "title": "Shift4 hiring Lead Product Manager, Disputes Management in Tampa, FL", "company": "Unknown Company", "location": "Tampa, FL", "salary_range": null, "experience_required": "7+ years of experience", "skills_mentioned": ["product strategy", "analytics", "stakeholder management"], "industry": "fintech", "description": "OverviewShift4 (NYSE: FOUR) is boldly redefining commerce by simplifying complex payments ecosystems across the world. As the leader in commerce-enabling technology, Shift4 powers billions of transactions annually for hundreds of thousands of businesses in virtually every industry. For more information, visit www.shift4.com.Staff Product Manager, Disputes ManagementShift4 is seeking a Product Manager to lead the development and expansion of our Chargeback Management tools and reporting capabilities. This role is critical in enhancing our ability to help merchants and financial institutions manage, dispute, and resolve chargebacks efficiently. You will define the product strategy, drive the roadmap, and collaborate with cross-functional teams to deliver best-in-class solutions.This role is a hybrid position based at any of the following Shift4 locations: Atlanta, GA (preferred), Tampa, FL, or Center Valley, PA. Relocation assistance may be provided.ResponsibilitiesStrategic Leadership: Define and execute the product strategy for Chargeback Management tools, ensuring alignment with business objectives and market needs.Product Roadmap & Execution: Develop and manage the product roadmap, prioritizing features and enhancements based on customer needs, regulatory requirements, and industry trends.Data-Driven Insights: Leverage data analytics and customer feedback to optimize chargeback resolution workflows, improve automation, and enhance reporting capabilities.Collaboration: Work closely with UX, Engineering, marketing, operations, and commercial, to ensure alignment and consistency in delivering a seamless and integrated merchant experience. Champion the \"voice of the customer\" and spearhead cross-functional initiatives aimed at addressing merchant needs and pain points.Industry Expertise: Stay ahead of trends, regulations, and competitive offerings in the chargeback and payments space to drive innovation.Qualifications7+ years of experience in Product Management, with at least 2 years in the Payments, Fintech, or Chargeback/Dispute Management space.Proven track record of launching and scaling B2B SaaS products, preferably in payments or fraud prevention.Working knowledge of chargeback processes, regulatory frameworks (e.g., Visa/Mastercard rules), and dispute resolution.Experience working with data-driven products, analytics, and reporting tools.Strong technical acumen with the ability to work closely with Engineering teams to translate business needs into scalable solutions.Excellent communication and stakeholder management skills, with experience influencing senior executives.Ability to balance strategic vision with hands-on execution in a fast-paced environment.Bachelor’s degree in Business, Computer Science, or a related field or experience in lieu of a degree may be considered. (MBA is a plus to have).We are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity and/or expression, status as a veteran, and basis of disability or any other federal, state or local protected class.", "apply_url": "https://www.linkedin.com/jobs/view/lead-product-manager-disputes-management-at-shift4-4247575415", "source": "linkedin_rss_secondary", "posted_date": "2025-09-05T12:34:47+00:00", "expires_date": null, "scraped_at": "2025-09-05T12:15:07.399277", "raw_data": {"entry_id": "d056605f4a3ba7d78bc835fa7e5e3cb4", "tags": [], "author": "LinkedIn"}}
