{"id": "4b4270cc874f", "title": "CovenantIQ hiring Associate Product Manager in Redmond, WA", "company": "CovenantIQ", "location": "Redmond, WA", "salary_range": "$95,000-$125,000", "experience_required": "Senior", "skills_mentioned": ["analytics", "figma", "jira", "confluence", "customer interviews"], "industry": "fintech", "description": "Location: Redmond, WA (in office 4 days/week, local candidates only)About UsCovenantIQ is on a mission to build a world-class financial technology company that helps lenders monitor, manage, and understand their borrowers like never before. We tackle complex problems in finance, data, and compliance — and we do it with a mix of grit, curiosity, and the occasional bad pun.The RoleAs an Associate Product Manager at CovenantIQ, you’ll work side-by-side with industry veterans to bring innovative features to life. You’ll dive into both the technical and business sides of product management.  One hour you might be reviewing API responses with engineering, and the next you could be interviewing customers or building the requirements document. You’ll own features end-to-end, from initial discovery through launch and beyond, gaining exposure to the full product lifecycle.What You’ll DoPartner with the Senior Director of Product Management to define and deliver product features.Write clear, actionable product requirements and collaborate closely with engineering, design, and QA teams.Assist in customer interviews and feedback collection to inform product decisions.Work with Customer Success to help resolve customer issues, improve documentation, and support implementations.Test solutions (including APIs) to ensure they meet functional and business requirements; then release it!Work with the tools of the trade including: Jira, Confluence, Aha, Figma, Postman, and AWS.Collaborate on projects involving AI, data processing, and modern financial technologies.Learn and apply key concepts in finance and lending, including income statements, balance sheets, cash flow statements, and covenants.What We’re Looking For1–3 years of professional experience, ideally in product management, business analysis, or a related role.Exposure to accounting or finance, with a basic understanding of financial statements and analytics.Curiosity and comfort engaging in both technical and business conversations.Exposure to technology; maybe you’ve dabbled in Python, worked with APIs, or spun up a service on AWS.Strong organizational skills with the ability to manage multiple priorities and support technical teams.Excellent communication skills, with a knack for simplifying complex topics.A willingness to learn from experienced leaders and take on new challenges in a fast-paced startup environment.Why You’ll Love Working HereYou’ll work on meaningful products that have a direct impact on how financial institutions operate.You’ll learn from industry experts in finance, technology, and product management.You’ll have a front-row seat to the inner workings of a high-growth startup; the good, the challenging, and the occasionally hilarious.You’ll be part of a collaborative, supportive team that takes its work seriously but knows how to laugh along the way.CompensationBase Salary: $95,000-$125,000. Within our pay range, individual salaries are determined by a variety of factors including, but not limited to: business considerations, local market conditions, internal equity, as well as candidate qualifications such as skills, experience, and education/training.Stock Options: The opportunity for ownership is an exciting part of CovenantIQ’s total compensation package. Every employee receives a new-hire equity grant, commensurate with the scope of their position.BenefitsWe offer all the benefits you'd expect from a great place to work including employee healthcare coverage (medical, dental, vision), 401k for retirement, a comfortable work environment, and other employee experience perks like events and activities. We also offer PTO (vacation, sick, holidays) and the flexibility to do your best work in the way that works for you.CovenantIQ is proud to be an equal opportunity employer. We do not discriminate on the basis of race, religion, color, national origin, sex (including pregnancy, childbirth, and reproductive health choices), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as someone with a disability, political views or activity, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state, and local law.", "apply_url": "https://www.linkedin.com/jobs/view/associate-product-manager-at-covenantiq-4296305943", "source": "linkedin_rss_primary", "posted_date": "2025-09-05T18:10:18+00:00", "expires_date": null, "scraped_at": "2025-09-05T15:25:03.680161", "raw_data": {"entry_id": "a2e0264a86cce3ae84f6f36c089f4979", "tags": [], "author": "LinkedIn"}}
{"id": "6241d29ccd0f", "title": "Eagle Eye Networks hiring Senior Product Manager in Austin, TX", "company": "Eagle Eye Networks", "location": "Austin, TX", "salary_range": null, "experience_required": "Senior", "skills_mentioned": ["product strategy", "analytics"], "industry": "fintech", "description": "About UsEagle Eye Networks is the global leader in cloud video surveillance, delivering cyber-secure, cloud-based video with artificial intelligence (AI) and analytics to make businesses more efficient and the world a safer place. The Eagle Eye Cloud VMS (video management system) is the only platform robust and flexible enough to power the future of video surveillance and intelligence. Eagle Eye is based in Austin, Texas, with offices in Amsterdam, Bangalore, and Tokyo.Eagle Eye Networks is a dynamic, fast-moving company. We value the benefits of face-to-face collaboration, and we believe it is more enjoyable and productive. The synergy of in-office interaction is critical to our culture and your presence is essential for Eagle Eye Networks’ success. Learn more at een.com.SummaryWe operate globally across North America, Europe, and Asia, and have raised over $100M from top investors like SECOM. Now, we're looking for a Senior Product Manager who blends strong UX instincts with enterprise software discipline to help shape the future of security technology.As Senior Product Manager, you will lead product development for high-impact areas of our cloud platform—with a laser focus on intuitive user experiences, customer workflows, and behavioral insight informed by data. You’ll work closely with design, engineering, and customers to create tools that are as usable as they are powerful.This role is ideal for a systems thinker who obsesses over enterprise users’ jobs-to-be-done, maps friction in their workflows, and designs product experiences that reduce cognitive load while delivering clarity and control at scale.ResponsibilitiesLead strategy and execution for user-facing applications within the Eagle Eye platform—shaping how enterprises manage real-time video, automation, and insights across diverse industries. Design intuitive workflows for enterprise users across industries like retail, logistics, and public safety—balancing complexity with clarity. Leverage behavioral insight, customer data, and field research to shape product direction and UX patterns. Collaborate cross-functionally to prototype, build, and ship features that feel simple—even when the systems behind them aren’t. Experience5–8+ years of product management experience in enterprise SaaS or complex B2B platforms with a strong track record of making data-informed product decisions. Strong foundation in user-centered design principles, information architecture, and UX research methods. Proven ability to design products that align with user intent while simplifying complex, high-stakes workflows. Demonstrated success launching intuitive products in technical, data-heavy, or security-conscious environments. Excellent communication and storytelling skills—you bring clarity to complex decisions and customer needs. Technical fluency—you’re comfortable working with APIs, integrations, and system constraints. Nice to HaveExperience with physical security, video surveillance, access control, or real-time video systems. Background in psychology, human-computer interaction (HCI), or behavioral product strategy. Built enterprise UX frameworks or led user journeys in cloud-native platform environments. Why work for Eagle Eye?Eagle Eye Networks is an innovative, global start-up building the only platform powerful enough to support the future of video surveillance and security. Here your voice will be heard, and talent respected. We have proven leadership and financial backing of one of the world’s premier venture capital firms. The work we do is essential in today’s world, as our systems are used to protect the health, safety, and welfare of people and property around the world.Medical Benefits: We offer competitive medical, vision, and dental plans. Company offsets premiums. Taco Tuesdays: Like breakfast tacos? You’re at the right place, because weekly breakfast tacos are provided. 401k plan with company match!Weekly Lunch: Food is love. Especially when it is free. Snacks: You will never go hungry. Culture: Innovation drives our vibe. Diversity: We embrace our global presence, the diverse ideas and backgrounds of our team to improve our culture, our products and grow our people and our business. Unlimited PTO: We value our employees’ work/life balance and want you to spend the time off you need. More About Eagle Eye NetworksEagle Eye Networks is leveraging artificial intelligence on its true cloud platform to dramatically reshape the video surveillance and security industry. The Eagle Eye Cloud Video Management System (VMS) is a smart cloud video surveillance solution, purpose-built to help businesses improve safety, security, operations, and customer service. Tens of thousands of companies in more than 90 countries around the globe have moved their video surveillance to the cloud with Eagle Eye VMS. Customers, including multi-family residences, smart cities, schools, hospitals, hotels, logistics, restaurants, and retail shops trust Eagle Eye for actionable business intelligence and proactive security across multiple locations. The Eagle Eye VMS has strong APIs for the secure integration of third-party systems and works with thousands of industry cameras, so customers don’t have to “rip and replace” their existing infrastructure. Eagle Eye Cloud VMS is the only platform robust enough to power the future of video surveillance.Eagle Eye Networks is an equal employment opportunity employer and values diversity. Qualified candidates are considered for employment without regard to race, religion, gender, gender identity, sexual orientation, national origin, age, military or veteran status, disability, or any other characteristic protected by applicable law.", "apply_url": "https://www.linkedin.com/jobs/view/senior-product-manager-at-eagle-eye-networks-4275494230", "source": "linkedin_rss_primary", "posted_date": "2025-09-05T13:50:09+00:00", "expires_date": null, "scraped_at": "2025-09-05T15:25:03.686102", "raw_data": {"entry_id": "0278fe5b66e2640e2482b3cbc2734dd0", "tags": [], "author": "LinkedIn"}}
{"id": "1760657fadda", "title": "Myticas Consulting hiring Product Manager – AI ML & Conversational Experience (34224) in Chicago, IL", "company": "Myticas Consulting", "location": "Chicago, IL", "salary_range": null, "experience_required": "7+ years of experience", "skills_mentioned": ["product strategy", "user research", "SQL", "analytics", "jira", "agile", "stakeholder management", "KPIs"], "industry": "fintech", "description": "Job Title: Senior Product Manager – AI/ML & Conversational ExperienceLocation: Waukegan, IL (Hybrid-3 days onsite)Duration: 6+ months contract (possible further extensionTop 3 Skills NeededExperience in Product Management with a focus on AI/ML, NLP, or data-driven products.Strong stakeholder management and communication skills across technical and non-technical teams.Technical foundation in ML, predictive modeling, data workflows, human-centered design, UX research, and journey mapping.DescriptionWe are seeking a Senior Product Manager with deep expertise in AI/ML, Conversational AI, and Human-Centered Design to lead the development of innovative digital products at the intersection of data, design, and business strategy. This role will focus on building intuitive, adaptive, and ethical AI-powered systems—including virtual assistants, NLP-enabled solutions, and data-driven platforms—that transform user experiences across healthcare, fintech, enterprise, and consumer technology.You will drive end-to-end product lifecycle management, from research and vision-setting to design, development, and adoption. This role requires a strong blend of AI/ML technical depth, UX design intuition, and product strategy to deliver solutions that are impactful, scalable, and human-centered.Key ResponsibilitiesLead product strategy, vision, and roadmaps for AI-powered solutions, including conversational AI, virtual assistants, and data-heavy platforms.Translate machine learning models and NLP techniques into intuitive user experiences through human-centered design.Partner with engineers, data scientists, UX researchers, and business stakeholders to deliver scalable AI/ML-enabled products.Conduct user research, journey mapping, and usability testing to inform design and continuously improve adoption.Apply conversational design principles—prompt engineering, intent tuning, disambiguation flows, graceful exits—for chat and voice interfaces.Lead API catalog and data product design efforts, aligning with compliance (e.g., HIPAA, FHIR) and enterprise architecture.Drive ethical and inclusive AI practices by focusing on explainability, interpretability, and equitable design.Define KPIs, success metrics, and dashboards to monitor product adoption and impact.Facilitate agile ceremonies (PI Planning, backlog refinement, sprint reviews) and ensure stakeholder alignment.Advocate for best practices in product management, change management, and continuous improvement.QualificationsRequired:7+ years of experience in Product Management with a focus on AI/ML, NLP, or data-driven products.Proven track record delivering Conversational AI, Virtual Assistants, or Voice-enabled UX.Expertise in human-centered design, UX research, and journey mapping.Strong technical foundation in ML, predictive modeling, data workflows, and APIs (Python, SQL, R).Hands-on experience with AI/ML platforms and tools (Amazon Lex, Google Dialogflow, Voiceflow, Tableau, Adobe Analytics, Pendo, Snowflake).Familiarity with cloud platforms (AWS, Azure, GCP) and DevOps tools (Jira, Jenkins, Docker, Kubernetes).Strong stakeholder management and communication skills across technical and non-technical teams., : Myticas Recruiter", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-%E2%80%93-ai-ml-conversational-experience-34224-at-myticas-consulting-4296095675", "source": "linkedin_rss_secondary", "posted_date": "2025-09-05T17:02:54+00:00", "expires_date": null, "scraped_at": "2025-09-05T15:25:04.177583", "raw_data": {"entry_id": "84cb997cb0dd1eb844d5de1157e56150", "tags": [], "author": "LinkedIn"}}
