{"id": "7c45149067a7", "title": "SAM Medical hiring Senior Product Manager in Portland, OR", "company": "LinkedIn", "location": "Portland, OR", "salary_range": "$125,000 - $130,000", "experience_required": "staff", "skills_mentioned": ["analytics", "agile", "market research", "product launch"], "industry": "healthtech", "description": "Company DescriptionSAM Medical is a globally recognized brand specializing in emergency medical solutions. Based in Tualatin, Oregon, our company designs, develops and manufactures medical devices that serve our US and international customers. Our products are trusted by military, law enforcement, fire & rescue, and hospital staff worldwide. In just 35 years, SAM Medical has become a respected name among the top medical companies, while maintaining the agile spirit of innovation. Role DescriptionThis is a full-time, hybrid role for a Senior Product Manager located in Tualatin, OR. This team member will be the vital link between customer requirements and company growth targets. The Senior Product Manager will have global product management responsibility for assigned product lines. The Senior Product Manager will also work cross-functionally with all internal departments to build inputs and marketing requirements for new and existing product lines.Reports To: Director of Product Management and the Project Management Office (PMO). Duties and ResponsibilitiesUpstream product management of the main product categories assigned. This activity would include but not be limited to the following:Developing end user customer requirements for new and existing product development efforts and collaborating cross-functionally with all internal departments for successful product launch efforts.Cultivate and expand group of KOLs (Key Opinion Leaders) in target markets served to better understand Voice of the Customer to drive product line extensions or new product concepts.Utilize market analytics to understand market share, total available market, and emerging trends and requirements to feed new product development efforts.Own customer feedback and input on new product development and line extension projects from product concept up through and into full product launch.Coordinate with the sales and marketing team to provide all project deliverables in a timely manner for the company’s stage–gate Product Development Process.Coordinate with training department to develop product launch training materials and conduct product training for new product launches as required.Work closely with the Director of Product Management on related marketing activities as assigned.Manage and lead the product lifecycle process for assigned product categories. Collaborate with marketing team members on downstream marketing activities as appropriate.QualificationsBachelor’s degree.5+ years of marketing and product management experience in healthcare or related field or equivalent combination of marketing and clinical experience in nursing (ER or other), EMS or other related field.Demonstrated ability to accurately gather customer or end user requirements and create product proposals based on market analytics.Experience with New Product Development (NPD) processes and procedures.Ability or experience with conducting market research and assessing competitive landscape.Experience or demonstrated ability in relationship establishment in targeted markets with end users in the medical industry (first responders (EMT/Paramedic), and clinicians). Strong presentation skills.Competency and understanding of medical products, channels and industry dynamics.MBA desirable but not required.Required Certifications and Licenses:Driver's licensePassportPhysical Requirements:Able to lift 30 lbs.Ability to travel up to 20% of the time.Able to sit for prolonged periods of time.Wage Range - $125,000 - $130,000", "apply_url": "https://www.linkedin.com/jobs/view/senior-product-manager-at-sam-medical-4295138300", "source": "linkedin_rss_primary", "posted_date": "2025-09-04T02:58:14+00:00", "expires_date": null, "scraped_at": "2025-09-04T03:27:09.635727", "raw_data": {"entry_id": "736dbc7f95db0ff0ec4db9c52a4af51b", "tags": [], "author": "LinkedIn"}}
{"id": "bc90d5b3d536", "title": "MotherDuck hiring Product Manager in Seattle, WA", "company": "LinkedIn", "location": "Seattle, WA", "salary_range": "$150K - $220K", "experience_required": null, "skills_mentioned": ["analytics", "market research", "go-to-market"], "industry": "healthtech", "description": "About MotherDuckDon’t let the quirky name fool you: At MotherDuck, we’re on a mission to make data warehousing fun, frictionless, and ducking awesome for developers and data practitioners building blazing fast internal and customer-facing analytics experiences. We're building a cloud-hosted version of DuckDB, working hand-in-hand with the creators of the fastest-growing and fastest-improving query engine on the planet. Unlike other databases, MotherDuck was architected to unify local development with cloud operations to bridge the gap between software and data engineering workflows. Our team is a mix of thoughtful, passionate, and empathetic data industry veterans.Core ResponsibilitiesThough founded only in 2022, MotherDuck’s platform is taking flight and making a splash in the analytics market. We are looking for a relentless, high-energy Product Manager for our Core Platform to help us build for scale and provide our customers with the observability and control they need to manage a fleet of workloads on MotherDuck. Your grit, curiosity, industry knowledge, and passion for building creative solutions for a fast-evolving, dynamic market will help us stay ahead of the curve and make it easy for technical practitioners to run production-grade analytics on MotherDuck.As MotherDuck’s Product Manager, Core Platform, you’ll be a key member of our Product ‘flock,’ with ownership for steering our product direction to ensure we support customer needs based on their feedback and market tailwinds. You’ll partner closely with teams across the company, from Engineering to Go-to-Market, to develop and deliver solutions that meet market needs and delight our users.Your background in databases, analytics, and infrastructure will be a crucial foundation to help us innovating well and ship features that meet our bar for quality and excellence to support analysts as well as software and data engineers who use MotherDuck in their core workflows.This is a hybrid role based out of our Seattle, New York City, or San Francisco offices.What You’ll Do as Product Manager, Core Platform @ MotherDuckGet to know our customer: Deeply understand the needs, pain points, and behaviors of our data warehousing customers, from early-stage startups to established companies, to proactively champion their needs, translating them into clear product direction. Partner closely with Engineering and Go-to-Market teams: Become a trusted advisor by collaborating cross-functionally internally to refine and ship quality features quickly that solve high-priority problems and proactively wow users with unexpected details and a thoughtful experience. Proactively drive the product development lifecycle: Ensure new features and capabilities maintain momentum, moving from ideation through launch to land smoothly in the hands of our customers. You are someone who takes pride in bringing internal stakeholders along for the journey, carving out time to continuously improve how we work along the way. Own market research as a subject matter expert: Align our vision with customer value by uncovering novel insights to identify new features and experiences we should build, and identify opportunities to innovate on how we architect core workflows and user journeys for our customers. Craft and communicate a compelling product roadmap: Lead a core area of the MotherDuck product, driving vision, strategy, and roadmap while providing clarity internally and externally on our value proposition and how it helps us turn market tailwinds into tangible business impact. You care deeply about improving MotherDuck’s product adoption in the market while balancing the needs of existing customers and active prospects. Use data and metrics as a guidepost - not a crutch: Seek out quantitative and qualitative insights to inform and refine hypotheses based on product usage to propose adjustments and experiments. You finesse our product offering based on customer feedback and perceived areas of opportunity by working to see around corners and navigating tradeoffs between performance, craftsmanship, and complexity to deliver elegant, straightforward solutions for our customers. What You’ll Bring To The Flock6+ years of product management experience with databases, cloud infrastructure, or developer tools in or adjacent to the (Post-) Modern Data Stack. Experience owning complex product surfaces and building platform infrastructure and observability solutions for a technical product and audienceA strong track record of working cross-functionally and driving clarity and alignment to bridge the translation gap between customers and Product, Engineering, and Go-to-Market teamsComfort operating in ambiguity and navigating fast-evolving, early-stage startup environmentsStrong technical acumen with a deep understanding of databases, application development, and data engineering principlesA keen sense of product quality and taste, with a sharp eye for the details, and a desire to take ownership of shaping your Product domain without losing sight of the big pictureStrong analytical skills, with the ability to craft and measure testable hypotheses, prioritize features based on customer impact and strategic objectives, and use metrics and user feedback to align product usage with customer valuePassion for building something distinctive and coming up with creative, unique solutions - you are a first principles thinker who is excited about going beyond the confines of how things have always been doneWhat We ProvideFeather-ruffling compensation – competitive salary and stock options so you have a stake in our flock’s success. Top-notch healthcare coverage – 100% paid medical, dental, and vision for employees, plus 80% coverage for dependents (because we care about your whole nest). Flexible PTO – take the time you need to recharge, explore, or just have a lazy day by the pond. 401k plan – because even ducks need to plan for the future. Legendary company events – we bring the whole flock together twice a year for unforgettable summits in fun locations, plus 1-2 team gatherings a year to keep our bonds strong. Hybrid work environment – Spend three days a week in the office collaborating with the flock, and work from wherever you’re most productive the rest of the time—whether that’s your home office, a coffee shop, or a peaceful lakeside retreat. Please ApplyDoes this role sound appealing to you, but you’re missing some of the requirements or don’t quite think you’re qualified? Please apply anyway. Research has shown that underrepresented groups in technology often shy away from roles which aren’t a 100% match. We aim to build a diverse team and will strongly consider applicants who bring many of the requirements plus have other experiences which round out their qualifications.MotherDuck is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based on race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. MotherDuck is committed to working with and providing reasonable accommodations to applicants with physical and mental disabilities.Compensation Range: $150K - $220K", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-at-motherduck-4295422528", "source": "linkedin_rss_primary", "posted_date": "2025-09-03T22:56:04+00:00", "expires_date": null, "scraped_at": "2025-09-04T03:27:09.639267", "raw_data": {"entry_id": "cb4b652e28444f55641d25e3ca3ee32c", "tags": [], "author": "LinkedIn"}}
{"id": "e9a808b8b204", "title": "MotherDuck hiring Product Manager in San Francisco, CA", "company": "LinkedIn", "location": "Francisco, CA", "salary_range": "$150K - $220K", "experience_required": null, "skills_mentioned": ["analytics", "market research", "go-to-market"], "industry": "healthtech", "description": "About MotherDuckDon’t let the quirky name fool you: At MotherDuck, we’re on a mission to make data warehousing fun, frictionless, and ducking awesome for developers and data practitioners building blazing fast internal and customer-facing analytics experiences. We're building a cloud-hosted version of DuckDB, working hand-in-hand with the creators of the fastest-growing and fastest-improving query engine on the planet. Unlike other databases, MotherDuck was architected to unify local development with cloud operations to bridge the gap between software and data engineering workflows. Our team is a mix of thoughtful, passionate, and empathetic data industry veterans.Core ResponsibilitiesThough founded only in 2022, MotherDuck’s platform is taking flight and making a splash in the analytics market. We are looking for a relentless, high-energy Product Manager for our Core Platform to help us build for scale and provide our customers with the observability and control they need to manage a fleet of workloads on MotherDuck. Your grit, curiosity, industry knowledge, and passion for building creative solutions for a fast-evolving, dynamic market will help us stay ahead of the curve and make it easy for technical practitioners to run production-grade analytics on MotherDuck.As MotherDuck’s Product Manager, Core Platform, you’ll be a key member of our Product ‘flock,’ with ownership for steering our product direction to ensure we support customer needs based on their feedback and market tailwinds. You’ll partner closely with teams across the company, from Engineering to Go-to-Market, to develop and deliver solutions that meet market needs and delight our users.Your background in databases, analytics, and infrastructure will be a crucial foundation to help us innovating well and ship features that meet our bar for quality and excellence to support analysts as well as software and data engineers who use MotherDuck in their core workflows.This is a hybrid role based out of our Seattle, New York City, or San Francisco offices.What You’ll Do as Product Manager, Core Platform @ MotherDuckGet to know our customer: Deeply understand the needs, pain points, and behaviors of our data warehousing customers, from early-stage startups to established companies, to proactively champion their needs, translating them into clear product direction. Partner closely with Engineering and Go-to-Market teams: Become a trusted advisor by collaborating cross-functionally internally to refine and ship quality features quickly that solve high-priority problems and proactively wow users with unexpected details and a thoughtful experience. Proactively drive the product development lifecycle: Ensure new features and capabilities maintain momentum, moving from ideation through launch to land smoothly in the hands of our customers. You are someone who takes pride in bringing internal stakeholders along for the journey, carving out time to continuously improve how we work along the way. Own market research as a subject matter expert: Align our vision with customer value by uncovering novel insights to identify new features and experiences we should build, and identify opportunities to innovate on how we architect core workflows and user journeys for our customers. Craft and communicate a compelling product roadmap: Lead a core area of the MotherDuck product, driving vision, strategy, and roadmap while providing clarity internally and externally on our value proposition and how it helps us turn market tailwinds into tangible business impact. You care deeply about improving MotherDuck’s product adoption in the market while balancing the needs of existing customers and active prospects. Use data and metrics as a guidepost - not a crutch: Seek out quantitative and qualitative insights to inform and refine hypotheses based on product usage to propose adjustments and experiments. You finesse our product offering based on customer feedback and perceived areas of opportunity by working to see around corners and navigating tradeoffs between performance, craftsmanship, and complexity to deliver elegant, straightforward solutions for our customers. What You’ll Bring To The Flock6+ years of product management experience with databases, cloud infrastructure, or developer tools in or adjacent to the (Post-) Modern Data Stack. Experience owning complex product surfaces and building platform infrastructure and observability solutions for a technical product and audienceA strong track record of working cross-functionally and driving clarity and alignment to bridge the translation gap between customers and Product, Engineering, and Go-to-Market teamsComfort operating in ambiguity and navigating fast-evolving, early-stage startup environmentsStrong technical acumen with a deep understanding of databases, application development, and data engineering principlesA keen sense of product quality and taste, with a sharp eye for the details, and a desire to take ownership of shaping your Product domain without losing sight of the big pictureStrong analytical skills, with the ability to craft and measure testable hypotheses, prioritize features based on customer impact and strategic objectives, and use metrics and user feedback to align product usage with customer valuePassion for building something distinctive and coming up with creative, unique solutions - you are a first principles thinker who is excited about going beyond the confines of how things have always been doneWhat We ProvideFeather-ruffling compensation – competitive salary and stock options so you have a stake in our flock’s success. Top-notch healthcare coverage – 100% paid medical, dental, and vision for employees, plus 80% coverage for dependents (because we care about your whole nest). Flexible PTO – take the time you need to recharge, explore, or just have a lazy day by the pond. 401k plan – because even ducks need to plan for the future. Legendary company events – we bring the whole flock together twice a year for unforgettable summits in fun locations, plus 1-2 team gatherings a year to keep our bonds strong. Hybrid work environment – Spend three days a week in the office collaborating with the flock, and work from wherever you’re most productive the rest of the time—whether that’s your home office, a coffee shop, or a peaceful lakeside retreat. Please ApplyDoes this role sound appealing to you, but you’re missing some of the requirements or don’t quite think you’re qualified? Please apply anyway. Research has shown that underrepresented groups in technology often shy away from roles which aren’t a 100% match. We aim to build a diverse team and will strongly consider applicants who bring many of the requirements plus have other experiences which round out their qualifications.MotherDuck is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based on race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. MotherDuck is committed to working with and providing reasonable accommodations to applicants with physical and mental disabilities.Compensation Range: $150K - $220K", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-at-motherduck-4295422527", "source": "linkedin_rss_primary", "posted_date": "2025-09-03T22:56:03+00:00", "expires_date": null, "scraped_at": "2025-09-04T03:27:09.640626", "raw_data": {"entry_id": "f59861db5f5a6b42c3e5fd11412807b6", "tags": [], "author": "LinkedIn"}}
{"id": "126eeb323ccd", "title": "MangoApps hiring Senior Product Manager in Greater Seattle Area", "company": "LinkedIn", "location": "successful, on", "salary_range": null, "experience_required": "Senior", "skills_mentioned": ["product strategy", "figma", "agile", "user stories", "go-to-market"], "industry": "healthtech", "description": "About MangoAppsMangoApps is the leading unified platform for modern workplaces, enabling seamless communication, collaboration, and AI-driven productivity. Our mission is to empower organizations by delivering innovative solutions that connect employees, tools, and knowledge—all in one place.About the RoleWe’re looking for a Senior Product Manager to join our growing team. In this role, you’ll take ownership of end-to-end product development for major initiatives across MangoApps products. You’ll play a critical role in shaping the product vision and strategy, partnering with cross-functional teams to define, deliver, and scale impactful features. As a senior member of the product team, you’ll also mentor junior product managers and serve as a trusted subject matter expert—internally and externally. This is an exciting opportunity to drive outcomes at scale, influence product direction, and build solutions that make a real difference.Key ResponsibilitiesLead market and competitive research to identify opportunities and influence product strategy at a portfolio level.Define and prioritize product requirements and user stories, collaborating with design and engineering to deliver innovative, high-quality features.Provide guidance and feedback on designs, prototypes, and user flows, ensuring usability, scalability, and customer value.Partner with QA to validate functionality and oversee successful, on-time product releases.Collaborate with marketing, sales, and customer success on go-to-market strategy, customer adoption, and positioning.Maintain and enhance demo environments used across sales and customer success, ensuring they reflect the latest product capabilities.Represent MangoApps as a product expert in customer interactions—leading demos, supporting enterprise sales conversations, and addressing RFPs/security questionnaires.Create and deliver product enablement materials (presentations, demo scripts, feature one-pagers) to empower internal teams and customers.Continuously gather and analyze customer insights and product usage data to validate strategy and inform ongoing improvements.Mentor and support junior product managers, sharing best practices and fostering a culture of product excellence.QualificationsBachelor’s degree in a relevant field such as business, marketing, computer science, or a related discipline.4–6 years of product management experience, with a strong preference for candidates who have built B2B enterprise products in SaaS companies.Deep understanding of the product development lifecycle and Agile methodologies, with proven success in leading cross-functional teams.Exceptional communication and presentation skills, with experience influencing executives and engaging with enterprise customers.Highly collaborative and strategic, with the ability to balance big-picture thinking and detail-oriented execution.Proficiency with Figma (or similar tools) to create and review wireframes, mockups, and prototypes in collaboration with design and engineering teams.Demonstrated ability to translate customer insights and market trends into actionable product strategies.Experience with enterprise intranet, collaboration, or employee experience platforms strongly preferred.Track record of mentoring or guiding junior product managers, and contributing to a culture of product excellence.BenefitsComprehensive health coverage, 401(k) plan, and moreMust-Have Cultural AttributesAll-In: Fully committed to team and customer successGo-Getter: Self-driven with a “whatever it takes” mindsetPassionate: Excited about building great product experiencesEntrepreneurial: Thrives in a fast-paced, agile environmentWhy Join MangoApps?Your work will directly impact thousands of usersYou’ll be part of a collaborative, mission-driven teamYou’ll have real ownership and opportunities for growthYou believe in the future of digital workplace transformation", "apply_url": "https://www.linkedin.com/jobs/view/senior-product-manager-at-mangoapps-4295409317", "source": "linkedin_rss_primary", "posted_date": "2025-09-03T19:58:45+00:00", "expires_date": null, "scraped_at": "2025-09-04T03:27:09.644885", "raw_data": {"entry_id": "06c07b3f377cfe9fa9f11742cd01d6dc", "tags": [], "author": "LinkedIn"}}
{"id": "3818f0dbad14", "title": "Bloomberg hiring Product Manager - Data AI in New York, NY", "company": "LinkedIn", "location": "York, NY", "salary_range": null, "experience_required": "senior", "skills_mentioned": [], "industry": "fintech", "description": "LocationNew YorkBusiness AreaDataRef #10046000Description & RequirementsBloomberg runs on data. Our products are fueled by information that is fast, deep, and reliable. We combine data with context to paint a complete picture for our clients, around the clock and across the globe. In the Data department, we are responsible for delivering this information through innovative technology—quickly, accurately, and at scale. We apply problem-solving skills to streamline workflows, implement advanced technology solutions, and enhance the systems, products, and processes that power Bloomberg, all while supporting our clients with best-in-class service.Our teamThe Data Artificial Intelligence group brings cutting-edge AI technologies into Bloomberg’s Data organization while contributing deep financial subject-matter expertise to the development of AI-powered products. We partner closely with stakeholders to align AI innovation with Bloomberg’s strategic objectives, focusing on optimizing data workflows and elevating the quality, intelligence, and usability of the data that drives our products. Our work amplifies the impact of the Data organization by delivering intelligent data solutions and domain-informed systems that enhance the competitiveness of Bloomberg’s offerings.What’s the role?We are seeking a Product Manager to shape the future of AI-powered data intelligence at Bloomberg. Sitting within the Data Artificial Intelligence group, this role drives initiatives at the intersection of Artificial Intelligence, Data Science, and Finance—transforming how unstructured information is turned into structured insights across the enterprise.You will lead high-impact initiatives that span multiple business domains, partnering with financial domain experts, AI engineers, and senior leadership to deliver measurable outcomes. Acting as both strategist and operator, you will bring clarity to complex problems, set cross-domain priorities, and orchestrate delivery using shared frameworks and standards.In this role, you will help define how AI becomes a lasting capability across Bloomberg—mobilizing resources to deliver tangible results today while laying the groundwork for scalable infrastructure, reusable tools, and best practices that secure the firm’s long-term advantage. Your impact will extend beyond individual projects: building trust across domains, elevating the craft of product management, and ensuring Bloomberg remains at the forefront of AI-driven data innovation.Key ResponsibilitiesDrive AI Initiatives: Lead the end-to-end lifecycle of high-impact projects, from intake and evaluation through execution, delivery, and transition, ensuring outcomes are measurable and business-aligned.Translate Needs into Solutions: Partner with financial domain experts to scope opportunities, define success metrics, and provide context, while working with AI engineers to shape models, pipelines, and production deployments.Orchestrate Delivery at Scale: Set cross-domain priorities, coordinate resources with engineering and leadership, and ensure disciplined execution using shared frameworks and standards.Align Stakeholders: Build trust across domains and organizational levels, balancing diverse perspectives to keep initiatives focused and moving forward.Anticipate Risks: Identify dependencies and risks across modeling, data, and integration; proactively mitigate to protect timelines and outcomes.Elevate the Organization: Capture learnings, codify reusable infrastructure and playbooks, and contribute to the growth of product management practices across Data.Advance Strategic Impact: Ensure AI investments deliver immediate business value and compound into scalable capabilities that reinforce Bloomberg’s leadership in data intelligence.You’ll Need To Have6+ years of product management or related experience leading complex, technical initiatives end-to-end.A proven track record of working with engineers, data scientists, and business stakeholders to deliver measurable outcomes.Exceptional communication and influencing skills—able to align diverse stakeholders and frame trade-offs in business terms.Demonstrated ability to bring structure to ambiguity, prioritize effectively, and drive disciplined execution.Systems thinking and organizational skills, with experience building scalable frameworks, processes, or tools.Comfort operating in dynamic environments where scope, priorities, and resources evolve.We’d Love To SeeExperience in financial services, capital markets, or large-scale data workflows.Familiarity with AI/ML technologies such as natural language processing, large language models, or model lifecycle management.Success in a central or platform-style role balancing cross-domain priorities and building reusable infrastructure.Background in consulting, program management, or other influence-oriented roles where outcomes depended on coalition-building.A passion for capability-building—coaching peers, advancing best practices, and elevating the craft of product management.Join us to shape the future of AI-powered data intelligence—and help Bloomberg set new standards for how information fuels global markets.Salary Range = 130000 - 165000 USD Annually + Benefits + BonusThe referenced salary range is based on the Company's good faith belief at the time of posting. Actual compensation may vary based on factors such as geographic location, work experience, market conditions, education/training and skill level.We offer one of the most comprehensive and generous benefits plans available and offer a range of total rewards that may include merit increases, incentive compensation (exempt roles only), paid holidays, paid time off, medical, dental, vision, short and long term disability benefits, 401(k) +match, life insurance, and various wellness programs, among others. The Company does not provide benefits directly to contingent workers/contractors and interns.", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-data-ai-at-bloomberg-4295063684", "source": "linkedin_rss_primary", "posted_date": "2025-09-03T17:53:50+00:00", "expires_date": null, "scraped_at": "2025-09-04T03:27:09.649526", "raw_data": {"entry_id": "04678a7ee7f1d33029421a2ba502ea71", "tags": [], "author": "LinkedIn"}}
{"id": "3e959ffa5e91", "title": "Thought Industries hiring Senior Product Manager in Boston, MA", "company": "LinkedIn", "location": "Boston, MA", "salary_range": null, "experience_required": "Senior", "skills_mentioned": ["product strategy", "analytics", "go-to-market"], "industry": "edtech", "description": "Thought Industries powers the Business of Value - enabling enterprises to unlock growth across the customer lifecycle. From our Boston headquarters, we help organizations drive measurable impact, maximize customer lifetime value, and fuel innovation through our leading enterprise solutions. Unlock growth with us - where your potential meets boundless possibilities.Job DescriptionWe’re looking for a Senior Product Manager to lead the development, launch, and ongoing success of a new AI-driven product. This is not a feature extension or a support role—it’s an opportunity to put your name on something entirely new. You’ll take a product from concept to launch, shape its position in the market, and work at the leading edge of what AI can unlock for users.This is a highly cross-functional role where you’ll shape product strategy, but also roll up your sleeves to test, learn, and deliver with speed. You’ll collaborate closely with design, engineering, marketing, and customer-facing teams to uncover opportunities, validate solutions, and create meaningful impact.We’re a collaborative team that values clear thinking, fast learning, and strong execution. We focus on outcomes over ego and work together to move quickly in the right direction. We’re especially excited to work with someone who sees emerging tools—including AI—as a way to accelerate research, experiment more creatively, and punch above their weight. If you’re ready to build something new, shape its trajectory, and take full ownership of the results, we’d love to hear from you.This is a full-time position based in our Boston office, with a requirement to work onsite at least three (3) days per week as part of our hybrid work model. This role reports to the Vice President of Product.ResponsibilitiesNew Product OwnershipLead the end-to-end development and launch of a new AI-powered product, from discovery through delivery and beyond. Drive early-market validation, prototype iteration, and go-to-market readiness in close collaboration with cross-functional partners. Product-Led GrowthDesign for self-serve adoption, low-friction onboarding, and accelerated time-to-value. Partner with marketing and customer teams to improve conversion, activation, and retention across the user journey. Strategy and PrioritizationTranslate a high-level product concept into a focused strategy for how the product is built, delivered, and grown—balancing speed, market impact, and technical constraints. Bring a clear point of view on prioritization frameworks and growth levers, guiding the team and leadership with a strategy you define, not just one you inherit. Work closely with marketing and cross-functional partners to ensure the roadmap aligns with go-to-market timing, positioning, and early revenue goals. Experimentation and DeliveryCollaborate with engineering and design to test hypotheses, pilot features, and iterate quickly based on real-world learning. Drive clarity and alignment across stakeholders, ensuring a shared understanding of product direction and success metrics. Integration and Insight QualityEnsure data integrations are reliable, scalable, and produce high-quality, actionable insights. Maintain a high standard for the usability and integrity of information presented to users. QualificationsRequired5+ years of product management experience, ideally in a B2B SaaS environment. Demonstrated ability to take a new product or feature from zero to launch—and grow it after launch. Proven track record of turning usage data into strategy and delivering measurable product outcomes. Experience supporting or owning product-led growth initiatives. Strong collaboration skills—you can align cross-functional teams, resolve ambiguity, and drive execution. A habit of clear written and verbal communication, grounded in a genuine focus on helping stakeholders understand, align, and make good decisions together. Comfortable experimenting with emerging tools (e.g., AI assistants, prototyping platforms, no-code tools) to accelerate product discovery and delivery. PreferredExperience with analytics or insights-focused products, or with third-party integrations. Familiarity with CX, survey, or feedback platforms. Experience working on early-stage products or within innovation teams. Understanding of AI-enabled product experiences or data-driven automation. Additional InformationAll your information will be kept confidential according to EEO guidelines.Thought Industries does not discriminate in employment opportunities or practices on the basis of race, color, religion, sex, national origin, age, disability, or any other characteristic protected by law. Employment decisions at Thought Industries are based on merit, qualifications, and abilities.This role has a salary range of $130,000 to $150,000, with bonus eligibility of up to $20,000 USD.Thought Industries does not discriminate in employment opportunities or practices on the basis of race, color, religion, sex, national origin, age, disability, or any other characteristic protected by law. Employment decisions at Thought Industries are based on merit, qualifications, and abilities.", "apply_url": "https://www.linkedin.com/jobs/view/senior-product-manager-at-thought-industries-4295057662", "source": "linkedin_rss_primary", "posted_date": "2025-09-03T17:26:00+00:00", "expires_date": null, "scraped_at": "2025-09-04T03:27:09.651510", "raw_data": {"entry_id": "ca8334f29a85de9789fe2eb63946ff41", "tags": [], "author": "LinkedIn"}}
{"id": "9a0bb6076c4a", "title": "Honeywell hiring Sr Product Manager, Healthcare in Atlanta, GA", "company": "LinkedIn", "location": "Atlanta, GA", "salary_range": null, "experience_required": "10 years of experience", "skills_mentioned": ["product strategy", "market research", "competitive analysis", "KPIs", "go-to-market", "pricing", "product launch"], "industry": "fintech", "description": "HE BUSINESS UNITEnhance the enjoyment, comfort, and energy efficiency of any building—regardless of type or size—with open, scalable, future-ready building automation systems. Our Building Automation (BA) unit partners with integrators to support the installation and integration of building management solutions, including controllers, edge devices, software, and connected services. We deliver impactful, end-to-end solutions tailored to high-growth verticals such as Data Centers, Healthcare, and Hospitality, leveraging the full spectrum of Honeywell’s BA capabilities. Whether customers engage directly or through channel partners, our mission is to simplify complex ecosystems and accelerate implementation timelines while aligning offerings with evolving customer needs. Position OverviewAs a Sr. Regional Product Manager, NPI at Honeywell, you will have a crucial role in driving customer discovery, New Product Development (NPD) execution, and New Product Introduction (NPI) acceleration. Your primary responsibilities will include understanding unmet or under-met needs in your regional market through customer discovery, working with the global team on the product roadmap to meet these needs, and assessing willingness to pay. As a leader, you will also be responsible for leading and managing a team of individuals, providing guidance, support, and development opportunities. Additionally, you will play a key role in accelerating NPI by determining positioning and pricing and enabling local product launches by working with the Marketing team to drive effective marketing campaigns and sales enablement. Location: Atlanta, GATravel/Territory: International/Domestic 40%Ideal Candidate Experience:Proven experience (typically 10+ years) in product management, with a focus on new product introduction or launch.Strong project management skills with the ability to manage multiple projects simultaneously.Demonstrated ability to lead cross-functional teams and drive consensus among stakeholders.Excellent communication and presentation skills, with the ability to articulate complex concepts to diverse audiences.Execute product strategies and roadmaps.Conduct market research and analysis to identify customer needs and market trends. Key Responsibilities: New Product Strategy and Planning:Develop and execute the NPI strategy aligned with the company's overall product roadmap and business goals.Conduct market research, competitive analysis, and customer segmentation to identify new product opportunities.Define product requirements, features, and specifications based on market needs and customer feedback.Cross-Functional Leadership:Lead cross-functional teams including R&D, engineering, manufacturing, marketing, and sales throughout the NPI process.Drive collaboration and communication to ensure alignment on product development milestones, timelines, and deliverables.Serve as the primary point of contact and advocate for the new product within the organization.Project Management and Execution:Develop detailed project plans, timelines, and budgets for NPI projects.Monitor progress against milestones, identify risks, and proactively address issues to ensure on-time and on-budget delivery.Coordinate beta testing, pilot programs, and market trials to validate product performance and gather customer feedback.Commercialization and Go-to-Market Strategy:Partner with marketing and sales teams to develop go-to-market strategies, pricing models, and sales collateral for new products.Drive product launch activities including sales training, customer education, and promotional campaigns.Monitor post-launch performance, collect feedback, and iterate on product features and marketing strategies as needed.Continuous Improvement and Analysis:Conduct post-launch reviews and analysis to evaluate the success of NPI projects against established metrics and KPIs.Identify opportunities for product enhancements, process improvements, and cost optimization.Stay informed about industry trends, technological advancements, and competitor activities related to new product introductions. YOU MUST HAVE: Minimum of 10 years of experience in product management or related rolesProven track record in customer discovery, NPD execution, and NPI accelerationExperience in developing business case financials and creating offering roadmaps WE VALUE: Bachelor's degree in Business, Engineering, or related fieldExperience in a global organizationExperience in market research and analysisStrong leadership and project management skillsAbility to adapt to a fast-paced and changing environmentABOUT HONEYWELLHoneywell International Inc. (Nasdaq: HON) invents and commercializes technologies that address some of the world’s most critical challenges around energy, safety, security, air travel, productivity, and global urbanization. We are a leading software-industrial company committed to introducing state-of-the-art technology solutions to improve efficiency, productivity, sustainability, and safety in high-growth businesses in broad-based, attractive industrial end markets. Our products and solutions enable a safer, more comfortable, and more productive world, enhancing the quality of life of people around the globe. Learn more about Honeywell: click here", "apply_url": "https://www.linkedin.com/jobs/view/sr-product-manager-healthcare-at-honeywell-4294818826", "source": "linkedin_rss_primary", "posted_date": "2025-09-03T15:35:08+00:00", "expires_date": null, "scraped_at": "2025-09-04T03:27:09.652391", "raw_data": {"entry_id": "3712ac1aeb9453b4a8038c39b258d90c", "tags": [], "author": "LinkedIn"}}
