{"id": "a12a249b850b", "title": "Arine hiring Product Manager (Outcomes) in San Francisco, CA", "company": "Arine", "location": "Remote", "salary_range": "120,000-140,000", "experience_required": "staff", "skills_mentioned": ["product strategy", "KPIs"], "industry": "healthtech", "description": "Based in San Francisco, Arine is a rapidly growing healthcare technology and clinical services company with a mission to ensure individuals receive the safest and most effective treatments for their unique and evolving healthcare needs.Frequently, medications cause more harm than good. Incorrect drugs and doses costs the US healthcare system over $528 billion in waste, avoidable harm, and hospitalizations each year. Arine is redefining what excellent healthcare looks like by solving these issues through our software platform (SaaS). We combine cutting edge data science, machine learning, AI, and deep clinical expertise to introduce a patient-centric view to medication management, and develop and deliver personalized care plans on a massive scale for patients and their care teams.Arine is committed to improving the lives and health of complex patients that have an outsized impact on healthcare costs and have traditionally been difficult to identify and address. These patients face numerous challenges including complicated prescribing issues across multiple medications and providers, medication challenges with many chronic diseases, and patient issues with access to care. Backed by leading healthcare investors and collaborating with top healthcare organizations and providers, we deliver recommendations and facilitate clinical interventions that lead to significant, measurable health improvements for patients and cost savings for customers.Why is Arine a Great Place to Work?:Outstanding Team and Culture - Our shared mission unites and motivates us to do our best work. We have a relentless passion and commitment to the innovation required to be the market leader in medication intelligence.Making a Proven Difference in Healthcare - We are saving patient lives, and enabling individuals to experience improved health outcomes, including significant reductions in hospitalizations and cost of care.Market Opportunity - Arine is backed by leading healthcare investors and was founded to tackle one of the largest healthcare problems today. Non-optimized medications therapies which cost the US 275,000 lives and $528 billion annually.Dramatic Growth - Arine is managing more than 18 million lives across prominent health plans after only 4 years in the market, and was ranked 236 on the 2024 Inc. 5000 list and was named the 5th fastest-growing company in the AI category.About the Role:Arine is seeking a Product Manager to join our dynamic team of software and clinical professionals. In this role, you will report into the product team and play a key part in shaping the product strategy, design, and processes that drive our core enterprise solutions. You will focus on mastering and optimizing user workflows within our portal, reducing workflow execution time, and elevating user satisfaction for both patients and care teams.What you'll be Doing:Mastering and Optimizing User Workflows: Deeply understand, map, and continuously improve the end-to-end workflows within Arine's portal. Identify bottlenecks and inefficiencies, and drive initiatives to streamline processes, reduce execution time, and enhance the user experience.Driving User Satisfaction: Gather user feedback, analyze usage data, and collaborate with clinical and technical teams to ensure workflows are intuitive, efficient, and tailored to user needs. Champion enhancements that directly improve satisfaction and engagement.Supporting Product Direction: Contribute to translating Arine's strategic vision into a cohesive product roadmap, with a strong focus on workflow efficiency and user-centric design.Collaborating with Clinical Experts: Work closely with Arine's clinical team to ensure that workflow improvements directly support better health outcomes and differentiate our solutions. Prioritizing Features: Use data-driven insights and market analysis to help prioritize features that drive workflow efficiency, maximize value for users and deliver on product KPIs Defining Requirements: Synthesize client and user needs into clear, actionable requirements that enable the engineering team to deliver high-impact solutions. Balancing Tradeoffs: Help balance features, schedules, and resources to deliver on business goals while maintaining a focus on workflow optimization and user satisfaction.Our Ideal Candidate3+ years in product management or related roles, preferably with data experience in healthcare software products and services.Workflow Mastery: Demonstrated ability to analyze, design, and optimize complex data flows, driving measurable improvements in efficiency and client satisfaction.Healthcare Knowledge: Understanding of the U.S. healthcare ecosystem.Technical Acumen: Comfortable with technology, development processes, and product strategy.Analytical & Communication Skills: Strong analytical, organizational, and communication skills, with experience presenting to both technical and business stakeholders.Customer Empathy: Eagerness to understand user challenges and deliver solutions that make their work easier and more impactful.Self-Starter: Proven ability to work independently in fast-paced, dynamic environments.Nice to HavesExperience in both software product management and clinical pharmacy applicationsSkills in interface and user experience designUnderstanding of AI/ML concepts and applicationsStartup experienceTravel and Other Information:Ability to commute to our office on Market Street in San Francisco at least 2-3 days/weekTravel up to 10% Remote Work Requirements:An established private work area that ensures information privacyA stable high-speed internet connection for remote workPerks:Joining Arine offers you a dynamic role and the opportunity to contribute to the company's growth and shape its future. You'll have unparalleled learning and growth prospects, collaborating closely with experienced Clinicians, Engineers, Software Architects, and Digital Health Entrepreneurs.The posted range represents the expected base salary range for this position and does not include any other potential components of the compensation package, benefits, and perks. Ultimately, the final pay decision will consider factors such as your experience, job level, location, and other relevant job-related criteria. The base salary range for this position is: $120,000-140,000/year.Job Requirements:Ability to pass a background checkMust live in and be eligible to work in the United StatesInformation Security Roles and Responsibilities:All staff at Arine are expected to be part of its Information Security Management Program and undergo periodic training on Information Security Awareness and HIPAA guidelines. Each user is responsible to maintain a secure working environment and follow all policies and procedures. Upon hire, each person is assigned and must complete trainings before access is granted for their specific role within Arine.Arine is an equal opportunity employer. We are committed to creating a diverse and inclusive workplace where all employees are treated with fairness and respect. We do not discriminate on the basis of race, ethnicity, color, religion, gender, sexual orientation, age, disability, or any other legally protected status. Our hiring decisions and employment practices are based solely on qualifications, merit, and business needs. We encourage individuals from all backgrounds to apply and join us in our mission.Check our website at https://www.arine.io. This is a unique opportunity to join a growing start-up revolutionizing the healthcare industry!Job Offers: Arine uses the arine.io domain and email addresses for all official communications. If you received communication from any other domain, please consider it spam. Note to Recruitment Agencies: We appreciate your interest in finding talent for Arine, but please be advised that we do not accept unsolicited resumes from recruitment agencies. All resumes submitted to Arine without a prior written agreement in place will be considered property of Arine, and no fee will be paid in the event of a hire. Thank you for your understanding.", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-outcomes-at-arine-4296136648", "source": "linkedin_rss_primary", "posted_date": "2025-09-05T01:13:32+00:00", "expires_date": null, "scraped_at": "2025-09-04T23:23:24.774120", "raw_data": {"entry_id": "020927bc4d805e14822d9a4348d9746a", "tags": [], "author": "LinkedIn"}}
{"id": "de5197782f90", "title": "Rithum hiring Senior Product Manager in Detroit Metropolitan Area", "company": "Rithum", "location": "remote", "salary_range": null, "experience_required": "Senior", "skills_mentioned": ["product strategy", "analytics"], "industry": "healthtech", "description": "Rithum™ is the world’s most trusted commerce network, accelerating how brands, suppliers, and retailers work together to deliver seamless e-commerce experiences. We provide an unmatched platform for brands and retailers, enabling them to accelerate growth, optimize operations across channels, scale product offerings and enhance margins.Today, more than 40,000 companies trust Rithum to grow their business across hundreds of channels, representing over $50 billion in annual GMV. Using our commerce, marketing, and delivery solutions, our customers create optimized consumer shopping journeys from beginning to end.OverviewAs a Senior Product Manager, you are responsible for the product strategy & development. You will collaborate closely with cross-functional teams & leaders, including engineering, design, sales and client's success to deliver value to the world’s largest retailers & brands. You focus on building products that lead to growth and scalability, proactively responding to client needs with urgency.ResponsibilitiesBe the owner of your product and drive the long-term vision for the world’s leading eCommerce platformCollaborate with engineering, product, and QA teams to drive efficient business processes, improve team operations, and align client needs with internal objectives.Contribute to roadmap development and execution, ensuring strategic initiatives are on track and that cross-team communication is seamless.Oversee documentation process for product changes and updates.Lead end-to-end product development & execution from concept to launch (e.g., PRDs, product prioritization, client discussions, testing & QA, etc.)Track development progress, report on status to stakeholders, and assist in managing product release cycles. Support product testing and validation to ensure high-quality releases and a seamless user experience.Triage incoming client requests and assigned projects, ensuring timely and articulate response, and follow through to releaseBe the voice and champion of our clients by building strong relationships based on trustLead and influence stakeholders across functional teams of designers and engineers to ensure successful delivery at a fast velocity; ensuring high product validation and QA standards are met.Collaborate with stakeholders at all levels of the organization to gain buy-in and alignment on product strategies, goals and initiatives, balancing urgency and resource availability.QualificationsMinimum Qualifications3+ years of proven product management experience within the SAAS industryStrong experience with the full product development lifecycle, including setting goals for your products, measuring the results, and quantifying the impact of features on the businessExperience driving strategy and execution for complex, integrated software ecosystems, particularly with unifying multiple platformsProven experience in supporting team-based projects, with a focus on ensuring alignment with project goals and contributing to technical teams.Strong ability to work with vendors and internal teams, ensuring effective communication with stakeholders for successful project delivery.Comfortable presenting product strategy and impact to stakeholders across all levels of the organizationAnalytically minded with proficiency in data-driven decision making and experience with product analytics toolsExperience collaborating with large clients – our clients are some of the biggest in commercePositive & growth-oriented mindset with a strong bias to actionStrong and concise written & verbal communication skills with the ability impactfully tailor your communication to any audienceAbility to explain technical concepts to non-technical audiencesAbility to work in fast-paced environments and manage multiple projects simultaneouslyPreferred QualificationsBachelors or Advanced degreePM experience at a top tech company or fast-growing startup preferably in eCommerceIntrapreneurial/founder mindsetExperience working on a global product management teamTravel RequiredUp to 10%Other DutiesPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice.What It’s Like To Work At RithumWhen you join Rithum, you can expect to work with smart risk-takers, courageous collaborators, and curious minds.As part of the Rithum team, you are valued, supported, and included. Guided by a transparent culture and accessible, approachable leadership, we offer career opportunities aligned to your ambitions and talents. To ensure work and life balance works for you, we also offer an array of resources to support you and your families, including comprehensive benefits and wellness plans.At Rithum You WillPartner with the leading brands and retailers.Connect with passionate professionals who will help support your goals.Participate in an inclusive, welcoming work atmosphere.Achieve work-life balance through remote-first working conditions, generous time off, and wellness days.Receive industry-competitive compensation and total rewards benefits.BenefitsMedical, dental and vision benefits: Affordable health care plans and company HSA contributions, starting on Day 1A 6% 401(k) matchCompetitive time off package with 20 days of Paid Time Off, 9 Company-Paid holidays, 2 paid floating holidays, 7 paid sick days, 2 Wellness days, and 1 Paid Volunteer Day; at 3 years of service PTO increases to 22 days, and at 5 years it increases to 25 days12 weeks primary caregiver leave & 4 weeks secondary caregiver leaveAccident, critical illness, and hospital indemnity insurancePet insuranceLegal assistance and identity theft insurance plansLife insurance 2x salaryAccess to the Calm app and the Employee Assistance Program$65/month Remote work stipend for internetCulture and team-building activitiesTuition assistanceCareer development opportunitiesCharitable contribution match up to $250 per yearRithum is an equal opportunity employer. We are committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants and teammates without regard to race, religion, color, sex, gender identity, sexual orientation, age, non-disqualifying physical or mental disability, national origin, veteran status or any other protected characteristic. All employment is decided on the basis of qualifications, merit, and business need.We're committed to providing reasonable accommodations in accordance with the law for qualified applicants. If you require assistance during the interview process due to a medical condition or need support accessing our website or completing the application process, please reach out to us by completing the Accommodations Request Form. Your comfort and accessibility are important to us, and we're here to ensure a seamless experience as you explore opportunities with our team.", "apply_url": "https://www.linkedin.com/jobs/view/senior-product-manager-at-rithum-4293985077", "source": "linkedin_rss_primary", "posted_date": "2025-09-05T00:00:59+00:00", "expires_date": null, "scraped_at": "2025-09-04T23:23:24.776669", "raw_data": {"entry_id": "a08cbfe7ff5a223bbf4a32bc7e6f34e6", "tags": [], "author": "LinkedIn"}}
{"id": "40e1fa9cff2c", "title": "Rithum hiring Senior Product Manager in Raleigh, NC", "company": "Rithum", "location": "remote", "salary_range": null, "experience_required": "Senior", "skills_mentioned": ["product strategy", "analytics"], "industry": "healthtech", "description": "Rithum™ is the world’s most trusted commerce network, accelerating how brands, suppliers, and retailers work together to deliver seamless e-commerce experiences. We provide an unmatched platform for brands and retailers, enabling them to accelerate growth, optimize operations across channels, scale product offerings and enhance margins.Today, more than 40,000 companies trust Rithum to grow their business across hundreds of channels, representing over $50 billion in annual GMV. Using our commerce, marketing, and delivery solutions, our customers create optimized consumer shopping journeys from beginning to end.OverviewAs a Senior Product Manager, you are responsible for the product strategy & development. You will collaborate closely with cross-functional teams & leaders, including engineering, design, sales and client's success to deliver value to the world’s largest retailers & brands. You focus on building products that lead to growth and scalability, proactively responding to client needs with urgency.ResponsibilitiesBe the owner of your product and drive the long-term vision for the world’s leading eCommerce platformCollaborate with engineering, product, and QA teams to drive efficient business processes, improve team operations, and align client needs with internal objectives.Contribute to roadmap development and execution, ensuring strategic initiatives are on track and that cross-team communication is seamless.Oversee documentation process for product changes and updates.Lead end-to-end product development & execution from concept to launch (e.g., PRDs, product prioritization, client discussions, testing & QA, etc.)Track development progress, report on status to stakeholders, and assist in managing product release cycles. Support product testing and validation to ensure high-quality releases and a seamless user experience.Triage incoming client requests and assigned projects, ensuring timely and articulate response, and follow through to releaseBe the voice and champion of our clients by building strong relationships based on trustLead and influence stakeholders across functional teams of designers and engineers to ensure successful delivery at a fast velocity; ensuring high product validation and QA standards are met.Collaborate with stakeholders at all levels of the organization to gain buy-in and alignment on product strategies, goals and initiatives, balancing urgency and resource availability.QualificationsMinimum Qualifications3+ years of proven product management experience within the SAAS industryStrong experience with the full product development lifecycle, including setting goals for your products, measuring the results, and quantifying the impact of features on the businessExperience driving strategy and execution for complex, integrated software ecosystems, particularly with unifying multiple platformsProven experience in supporting team-based projects, with a focus on ensuring alignment with project goals and contributing to technical teams.Strong ability to work with vendors and internal teams, ensuring effective communication with stakeholders for successful project delivery.Comfortable presenting product strategy and impact to stakeholders across all levels of the organizationAnalytically minded with proficiency in data-driven decision making and experience with product analytics toolsExperience collaborating with large clients – our clients are some of the biggest in commercePositive & growth-oriented mindset with a strong bias to actionStrong and concise written & verbal communication skills with the ability impactfully tailor your communication to any audienceAbility to explain technical concepts to non-technical audiencesAbility to work in fast-paced environments and manage multiple projects simultaneouslyPreferred QualificationsBachelors or Advanced degreePM experience at a top tech company or fast-growing startup preferably in eCommerceIntrapreneurial/founder mindsetExperience working on a global product management teamTravel RequiredUp to 10%Other DutiesPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice.What It’s Like To Work At RithumWhen you join Rithum, you can expect to work with smart risk-takers, courageous collaborators, and curious minds.As part of the Rithum team, you are valued, supported, and included. Guided by a transparent culture and accessible, approachable leadership, we offer career opportunities aligned to your ambitions and talents. To ensure work and life balance works for you, we also offer an array of resources to support you and your families, including comprehensive benefits and wellness plans.At Rithum You WillPartner with the leading brands and retailers.Connect with passionate professionals who will help support your goals.Participate in an inclusive, welcoming work atmosphere.Achieve work-life balance through remote-first working conditions, generous time off, and wellness days.Receive industry-competitive compensation and total rewards benefits.BenefitsMedical, dental and vision benefits: Affordable health care plans and company HSA contributions, starting on Day 1A 6% 401(k) matchCompetitive time off package with 20 days of Paid Time Off, 9 Company-Paid holidays, 2 paid floating holidays, 7 paid sick days, 2 Wellness days, and 1 Paid Volunteer Day; at 3 years of service PTO increases to 22 days, and at 5 years it increases to 25 days12 weeks primary caregiver leave & 4 weeks secondary caregiver leaveAccident, critical illness, and hospital indemnity insurancePet insuranceLegal assistance and identity theft insurance plansLife insurance 2x salaryAccess to the Calm app and the Employee Assistance Program$65/month Remote work stipend for internetCulture and team-building activitiesTuition assistanceCareer development opportunitiesCharitable contribution match up to $250 per yearRithum is an equal opportunity employer. We are committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants and teammates without regard to race, religion, color, sex, gender identity, sexual orientation, age, non-disqualifying physical or mental disability, national origin, veteran status or any other protected characteristic. All employment is decided on the basis of qualifications, merit, and business need.We're committed to providing reasonable accommodations in accordance with the law for qualified applicants. If you require assistance during the interview process due to a medical condition or need support accessing our website or completing the application process, please reach out to us by completing the Accommodations Request Form. Your comfort and accessibility are important to us, and we're here to ensure a seamless experience as you explore opportunities with our team.", "apply_url": "https://www.linkedin.com/jobs/view/senior-product-manager-at-rithum-4293982088", "source": "linkedin_rss_primary", "posted_date": "2025-09-05T00:00:59+00:00", "expires_date": null, "scraped_at": "2025-09-04T23:23:24.778156", "raw_data": {"entry_id": "a7e575627e02100c16cf5dc4e98fea05", "tags": [], "author": "LinkedIn"}}
{"id": "c98b89e506dc", "title": "Rithum hiring Senior Product Manager in Chicago, IL", "company": "Rithum", "location": "remote", "salary_range": null, "experience_required": "Senior", "skills_mentioned": ["product strategy", "analytics"], "industry": "healthtech", "description": "Rithum™ is the world’s most trusted commerce network, accelerating how brands, suppliers, and retailers work together to deliver seamless e-commerce experiences. We provide an unmatched platform for brands and retailers, enabling them to accelerate growth, optimize operations across channels, scale product offerings and enhance margins.Today, more than 40,000 companies trust Rithum to grow their business across hundreds of channels, representing over $50 billion in annual GMV. Using our commerce, marketing, and delivery solutions, our customers create optimized consumer shopping journeys from beginning to end.OverviewAs a Senior Product Manager, you are responsible for the product strategy & development. You will collaborate closely with cross-functional teams & leaders, including engineering, design, sales and client's success to deliver value to the world’s largest retailers & brands. You focus on building products that lead to growth and scalability, proactively responding to client needs with urgency.ResponsibilitiesBe the owner of your product and drive the long-term vision for the world’s leading eCommerce platformCollaborate with engineering, product, and QA teams to drive efficient business processes, improve team operations, and align client needs with internal objectives.Contribute to roadmap development and execution, ensuring strategic initiatives are on track and that cross-team communication is seamless.Oversee documentation process for product changes and updates.Lead end-to-end product development & execution from concept to launch (e.g., PRDs, product prioritization, client discussions, testing & QA, etc.)Track development progress, report on status to stakeholders, and assist in managing product release cycles. Support product testing and validation to ensure high-quality releases and a seamless user experience.Triage incoming client requests and assigned projects, ensuring timely and articulate response, and follow through to releaseBe the voice and champion of our clients by building strong relationships based on trustLead and influence stakeholders across functional teams of designers and engineers to ensure successful delivery at a fast velocity; ensuring high product validation and QA standards are met.Collaborate with stakeholders at all levels of the organization to gain buy-in and alignment on product strategies, goals and initiatives, balancing urgency and resource availability.QualificationsMinimum Qualifications3+ years of proven product management experience within the SAAS industryStrong experience with the full product development lifecycle, including setting goals for your products, measuring the results, and quantifying the impact of features on the businessExperience driving strategy and execution for complex, integrated software ecosystems, particularly with unifying multiple platformsProven experience in supporting team-based projects, with a focus on ensuring alignment with project goals and contributing to technical teams.Strong ability to work with vendors and internal teams, ensuring effective communication with stakeholders for successful project delivery.Comfortable presenting product strategy and impact to stakeholders across all levels of the organizationAnalytically minded with proficiency in data-driven decision making and experience with product analytics toolsExperience collaborating with large clients – our clients are some of the biggest in commercePositive & growth-oriented mindset with a strong bias to actionStrong and concise written & verbal communication skills with the ability impactfully tailor your communication to any audienceAbility to explain technical concepts to non-technical audiencesAbility to work in fast-paced environments and manage multiple projects simultaneouslyPreferred QualificationsBachelors or Advanced degreePM experience at a top tech company or fast-growing startup preferably in eCommerceIntrapreneurial/founder mindsetExperience working on a global product management teamTravel RequiredUp to 10%Other DutiesPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice.What It’s Like To Work At RithumWhen you join Rithum, you can expect to work with smart risk-takers, courageous collaborators, and curious minds.As part of the Rithum team, you are valued, supported, and included. Guided by a transparent culture and accessible, approachable leadership, we offer career opportunities aligned to your ambitions and talents. To ensure work and life balance works for you, we also offer an array of resources to support you and your families, including comprehensive benefits and wellness plans.At Rithum You WillPartner with the leading brands and retailers.Connect with passionate professionals who will help support your goals.Participate in an inclusive, welcoming work atmosphere.Achieve work-life balance through remote-first working conditions, generous time off, and wellness days.Receive industry-competitive compensation and total rewards benefits.BenefitsMedical, dental and vision benefits: Affordable health care plans and company HSA contributions, starting on Day 1A 6% 401(k) matchCompetitive time off package with 20 days of Paid Time Off, 9 Company-Paid holidays, 2 paid floating holidays, 7 paid sick days, 2 Wellness days, and 1 Paid Volunteer Day; at 3 years of service PTO increases to 22 days, and at 5 years it increases to 25 days12 weeks primary caregiver leave & 4 weeks secondary caregiver leaveAccident, critical illness, and hospital indemnity insurancePet insuranceLegal assistance and identity theft insurance plansLife insurance 2x salaryAccess to the Calm app and the Employee Assistance Program$65/month Remote work stipend for internetCulture and team-building activitiesTuition assistanceCareer development opportunitiesCharitable contribution match up to $250 per yearRithum is an equal opportunity employer. We are committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants and teammates without regard to race, religion, color, sex, gender identity, sexual orientation, age, non-disqualifying physical or mental disability, national origin, veteran status or any other protected characteristic. All employment is decided on the basis of qualifications, merit, and business need.We're committed to providing reasonable accommodations in accordance with the law for qualified applicants. If you require assistance during the interview process due to a medical condition or need support accessing our website or completing the application process, please reach out to us by completing the Accommodations Request Form. Your comfort and accessibility are important to us, and we're here to ensure a seamless experience as you explore opportunities with our team.", "apply_url": "https://www.linkedin.com/jobs/view/senior-product-manager-at-rithum-4293984093", "source": "linkedin_rss_primary", "posted_date": "2025-09-05T00:00:59+00:00", "expires_date": null, "scraped_at": "2025-09-04T23:23:24.779538", "raw_data": {"entry_id": "a95e31fe82354e9489d69081f60b13cd", "tags": [], "author": "LinkedIn"}}
{"id": "10dfba22c1a7", "title": "Rithum hiring Senior Product Manager in Atlanta Metropolitan Area", "company": "Rithum", "location": "remote", "salary_range": null, "experience_required": "Senior", "skills_mentioned": ["product strategy", "analytics"], "industry": "healthtech", "description": "Rithum™ is the world’s most trusted commerce network, accelerating how brands, suppliers, and retailers work together to deliver seamless e-commerce experiences. We provide an unmatched platform for brands and retailers, enabling them to accelerate growth, optimize operations across channels, scale product offerings and enhance margins.Today, more than 40,000 companies trust Rithum to grow their business across hundreds of channels, representing over $50 billion in annual GMV. Using our commerce, marketing, and delivery solutions, our customers create optimized consumer shopping journeys from beginning to end.OverviewAs a Senior Product Manager, you are responsible for the product strategy & development. You will collaborate closely with cross-functional teams & leaders, including engineering, design, sales and client's success to deliver value to the world’s largest retailers & brands. You focus on building products that lead to growth and scalability, proactively responding to client needs with urgency.ResponsibilitiesBe the owner of your product and drive the long-term vision for the world’s leading eCommerce platformCollaborate with engineering, product, and QA teams to drive efficient business processes, improve team operations, and align client needs with internal objectives.Contribute to roadmap development and execution, ensuring strategic initiatives are on track and that cross-team communication is seamless.Oversee documentation process for product changes and updates.Lead end-to-end product development & execution from concept to launch (e.g., PRDs, product prioritization, client discussions, testing & QA, etc.)Track development progress, report on status to stakeholders, and assist in managing product release cycles. Support product testing and validation to ensure high-quality releases and a seamless user experience.Triage incoming client requests and assigned projects, ensuring timely and articulate response, and follow through to releaseBe the voice and champion of our clients by building strong relationships based on trustLead and influence stakeholders across functional teams of designers and engineers to ensure successful delivery at a fast velocity; ensuring high product validation and QA standards are met.Collaborate with stakeholders at all levels of the organization to gain buy-in and alignment on product strategies, goals and initiatives, balancing urgency and resource availability.QualificationsMinimum Qualifications3+ years of proven product management experience within the SAAS industryStrong experience with the full product development lifecycle, including setting goals for your products, measuring the results, and quantifying the impact of features on the businessExperience driving strategy and execution for complex, integrated software ecosystems, particularly with unifying multiple platformsProven experience in supporting team-based projects, with a focus on ensuring alignment with project goals and contributing to technical teams.Strong ability to work with vendors and internal teams, ensuring effective communication with stakeholders for successful project delivery.Comfortable presenting product strategy and impact to stakeholders across all levels of the organizationAnalytically minded with proficiency in data-driven decision making and experience with product analytics toolsExperience collaborating with large clients – our clients are some of the biggest in commercePositive & growth-oriented mindset with a strong bias to actionStrong and concise written & verbal communication skills with the ability impactfully tailor your communication to any audienceAbility to explain technical concepts to non-technical audiencesAbility to work in fast-paced environments and manage multiple projects simultaneouslyPreferred QualificationsBachelors or Advanced degreePM experience at a top tech company or fast-growing startup preferably in eCommerceIntrapreneurial/founder mindsetExperience working on a global product management teamTravel RequiredUp to 10%Other DutiesPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice.What It’s Like To Work At RithumWhen you join Rithum, you can expect to work with smart risk-takers, courageous collaborators, and curious minds.As part of the Rithum team, you are valued, supported, and included. Guided by a transparent culture and accessible, approachable leadership, we offer career opportunities aligned to your ambitions and talents. To ensure work and life balance works for you, we also offer an array of resources to support you and your families, including comprehensive benefits and wellness plans.At Rithum You WillPartner with the leading brands and retailers.Connect with passionate professionals who will help support your goals.Participate in an inclusive, welcoming work atmosphere.Achieve work-life balance through remote-first working conditions, generous time off, and wellness days.Receive industry-competitive compensation and total rewards benefits.BenefitsMedical, dental and vision benefits: Affordable health care plans and company HSA contributions, starting on Day 1A 6% 401(k) matchCompetitive time off package with 20 days of Paid Time Off, 9 Company-Paid holidays, 2 paid floating holidays, 7 paid sick days, 2 Wellness days, and 1 Paid Volunteer Day; at 3 years of service PTO increases to 22 days, and at 5 years it increases to 25 days12 weeks primary caregiver leave & 4 weeks secondary caregiver leaveAccident, critical illness, and hospital indemnity insurancePet insuranceLegal assistance and identity theft insurance plansLife insurance 2x salaryAccess to the Calm app and the Employee Assistance Program$65/month Remote work stipend for internetCulture and team-building activitiesTuition assistanceCareer development opportunitiesCharitable contribution match up to $250 per yearRithum is an equal opportunity employer. We are committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants and teammates without regard to race, religion, color, sex, gender identity, sexual orientation, age, non-disqualifying physical or mental disability, national origin, veteran status or any other protected characteristic. All employment is decided on the basis of qualifications, merit, and business need.We're committed to providing reasonable accommodations in accordance with the law for qualified applicants. If you require assistance during the interview process due to a medical condition or need support accessing our website or completing the application process, please reach out to us by completing the Accommodations Request Form. Your comfort and accessibility are important to us, and we're here to ensure a seamless experience as you explore opportunities with our team.", "apply_url": "https://www.linkedin.com/jobs/view/senior-product-manager-at-rithum-4293980236", "source": "linkedin_rss_primary", "posted_date": "2025-09-05T00:00:59+00:00", "expires_date": null, "scraped_at": "2025-09-04T23:23:24.780891", "raw_data": {"entry_id": "eaf9381e7e63b8d8c8ce26a623738c5a", "tags": [], "author": "LinkedIn"}}
{"id": "32007b6ca586", "title": "Rithum hiring Senior Product Manager in Dallas, TX", "company": "Rithum", "location": "remote", "salary_range": null, "experience_required": "Senior", "skills_mentioned": ["product strategy", "analytics"], "industry": "healthtech", "description": "Rithum™ is the world’s most trusted commerce network, accelerating how brands, suppliers, and retailers work together to deliver seamless e-commerce experiences. We provide an unmatched platform for brands and retailers, enabling them to accelerate growth, optimize operations across channels, scale product offerings and enhance margins.Today, more than 40,000 companies trust Rithum to grow their business across hundreds of channels, representing over $50 billion in annual GMV. Using our commerce, marketing, and delivery solutions, our customers create optimized consumer shopping journeys from beginning to end.OverviewAs a Senior Product Manager, you are responsible for the product strategy & development. You will collaborate closely with cross-functional teams & leaders, including engineering, design, sales and client's success to deliver value to the world’s largest retailers & brands. You focus on building products that lead to growth and scalability, proactively responding to client needs with urgency.ResponsibilitiesBe the owner of your product and drive the long-term vision for the world’s leading eCommerce platformCollaborate with engineering, product, and QA teams to drive efficient business processes, improve team operations, and align client needs with internal objectives.Contribute to roadmap development and execution, ensuring strategic initiatives are on track and that cross-team communication is seamless.Oversee documentation process for product changes and updates.Lead end-to-end product development & execution from concept to launch (e.g., PRDs, product prioritization, client discussions, testing & QA, etc.)Track development progress, report on status to stakeholders, and assist in managing product release cycles. Support product testing and validation to ensure high-quality releases and a seamless user experience.Triage incoming client requests and assigned projects, ensuring timely and articulate response, and follow through to releaseBe the voice and champion of our clients by building strong relationships based on trustLead and influence stakeholders across functional teams of designers and engineers to ensure successful delivery at a fast velocity; ensuring high product validation and QA standards are met.Collaborate with stakeholders at all levels of the organization to gain buy-in and alignment on product strategies, goals and initiatives, balancing urgency and resource availability.QualificationsMinimum Qualifications3+ years of proven product management experience within the SAAS industryStrong experience with the full product development lifecycle, including setting goals for your products, measuring the results, and quantifying the impact of features on the businessExperience driving strategy and execution for complex, integrated software ecosystems, particularly with unifying multiple platformsProven experience in supporting team-based projects, with a focus on ensuring alignment with project goals and contributing to technical teams.Strong ability to work with vendors and internal teams, ensuring effective communication with stakeholders for successful project delivery.Comfortable presenting product strategy and impact to stakeholders across all levels of the organizationAnalytically minded with proficiency in data-driven decision making and experience with product analytics toolsExperience collaborating with large clients – our clients are some of the biggest in commercePositive & growth-oriented mindset with a strong bias to actionStrong and concise written & verbal communication skills with the ability impactfully tailor your communication to any audienceAbility to explain technical concepts to non-technical audiencesAbility to work in fast-paced environments and manage multiple projects simultaneouslyPreferred QualificationsBachelors or Advanced degreePM experience at a top tech company or fast-growing startup preferably in eCommerceIntrapreneurial/founder mindsetExperience working on a global product management teamTravel RequiredUp to 10%Other DutiesPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice.What It’s Like To Work At RithumWhen you join Rithum, you can expect to work with smart risk-takers, courageous collaborators, and curious minds.As part of the Rithum team, you are valued, supported, and included. Guided by a transparent culture and accessible, approachable leadership, we offer career opportunities aligned to your ambitions and talents. To ensure work and life balance works for you, we also offer an array of resources to support you and your families, including comprehensive benefits and wellness plans.At Rithum You WillPartner with the leading brands and retailers.Connect with passionate professionals who will help support your goals.Participate in an inclusive, welcoming work atmosphere.Achieve work-life balance through remote-first working conditions, generous time off, and wellness days.Receive industry-competitive compensation and total rewards benefits.BenefitsMedical, dental and vision benefits: Affordable health care plans and company HSA contributions, starting on Day 1A 6% 401(k) matchCompetitive time off package with 20 days of Paid Time Off, 9 Company-Paid holidays, 2 paid floating holidays, 7 paid sick days, 2 Wellness days, and 1 Paid Volunteer Day; at 3 years of service PTO increases to 22 days, and at 5 years it increases to 25 days12 weeks primary caregiver leave & 4 weeks secondary caregiver leaveAccident, critical illness, and hospital indemnity insurancePet insuranceLegal assistance and identity theft insurance plansLife insurance 2x salaryAccess to the Calm app and the Employee Assistance Program$65/month Remote work stipend for internetCulture and team-building activitiesTuition assistanceCareer development opportunitiesCharitable contribution match up to $250 per yearRithum is an equal opportunity employer. We are committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants and teammates without regard to race, religion, color, sex, gender identity, sexual orientation, age, non-disqualifying physical or mental disability, national origin, veteran status or any other protected characteristic. All employment is decided on the basis of qualifications, merit, and business need.We're committed to providing reasonable accommodations in accordance with the law for qualified applicants. If you require assistance during the interview process due to a medical condition or need support accessing our website or completing the application process, please reach out to us by completing the Accommodations Request Form. Your comfort and accessibility are important to us, and we're here to ensure a seamless experience as you explore opportunities with our team.", "apply_url": "https://www.linkedin.com/jobs/view/senior-product-manager-at-rithum-4293985080", "source": "linkedin_rss_primary", "posted_date": "2025-09-05T00:00:59+00:00", "expires_date": null, "scraped_at": "2025-09-04T23:23:24.782216", "raw_data": {"entry_id": "dd7bb7239c2aff2c68d3ce6197b38a9e", "tags": [], "author": "LinkedIn"}}
{"id": "8f4e8ce0a5f4", "title": "Trident Consulting hiring Product Manager/Product Owner in Washington DC-Baltimore Area", "company": "Trident Consulting", "location": "Washington, DC", "salary_range": null, "experience_required": "staff", "skills_mentioned": ["analytics", "agile"], "industry": null, "description": "Trident Consulting is seeking a \" Product Manager/Product Owner \" for one of our clients in \"Washington, DC \"Position: Product Manager/Product Owner with Dynamics CRM experienceLocation: Washington, DC - Onsite 4 days onsiteFulltimeJob Description:Responsibilities:Expertise in Change Management processes and strategies.Must have CRM MS Dynamics exp.Translate high-level objectives provided by Software Product Management and external clients into functional specifications that are testable and measurable.Take ownership of software product features and manage the full lifecycle of requirements.Conduct research and document functional requirements, integrating inputs from multiple sources.Analyze and document user workflows to ensure alignment with business objectives.Produce and maintain product backlogs, actively participating in or driving sprint planning sessions as needed.Assist in prioritizing initial feature development and ongoing change requests to ensure efficient delivery.Develop detailed use cases to illustrate user interactions with system functions for various user classes.Ensure application interfaces address human factor design considerations, enhancing user experience.Collaborate with the Quality Assurance team to execute systematic and ad-hoc test cases.Log failures and coordinate with QA Analysts to ensure timely resolution.Communicate and coordinate effectively with all levels of leadership, including Clients, Product Management, Development, and UX teams.About TridentTrident Consulting is a premier IT staffing firm providing high-impact workforce solutions to Fortune 500 and mid-market clients. Since 2005, we've specialized in sourcing elite technology and engineering talent for contract, direct hire, and managed services roles. Our expertise spans cloud, AI/ML, cybersecurity, and data analytics, supported by a 3M+ candidate database and a 78% fill ratio. With a highly engaged leadership team and a reputation for delivering hard-to-fill, niche talent, we help organizations build agile, high-performing teams that drive innovation and business success.Some of our recent awards include:Trailblazer Women Award 2025 by Consulate General of India in San FranciscoRanked as the #1 Women Owned Business Enterprise in the large category by ITServe.Received the TechServe Excellence award.Consistently ranked in the Inc. 5000 list of fastest-growing private companies in AmericaRecognized in the SF Business Times as one of the Largest Bay Area BIPOC/Minority-Owned Businesses in 2022", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-product-owner-at-trident-consulting-4295714106", "source": "linkedin_rss_primary", "posted_date": "2025-09-04T22:59:01+00:00", "expires_date": null, "scraped_at": "2025-09-04T23:23:24.788387", "raw_data": {"entry_id": "c05babb4420ae98d221ca5966564188f", "tags": [], "author": "LinkedIn"}}
{"id": "8c11ef2d0aab", "title": "Trident Consulting hiring Product Manager in Denver, CO", "company": "Trident Consulting", "location": "Denver, CO", "salary_range": null, "experience_required": "staff", "skills_mentioned": ["analytics", "agile"], "industry": null, "description": "Trident Consulting is seeking a \"Product Manager\" for one of our clients in \"Denver, CO – 3 days office\" A global leader in business and technology services.Position: Product ManagerLocation: Denver, CO – 3 days officeDuration: ContractExperience:Telecom domain experienceGood experience in Product ManagementNeed from any development background and not from BATrident Consulting is a premier IT staffing firm providing high-impact workforce solutions to Fortune 500 and mid-market clients. Since 2005, we've specialized in sourcing elite technology and engineering talent for contract, direct hire, and managed services roles. Our expertise spans cloud, AI/ML, cybersecurity, and data analytics, supported by a 3M+ candidate database and a 78% fill ratio. With a highly engaged leadership team and a reputation for delivering hard-to-fill, niche talent, we help organizations build agile, high-performing teams that drive innovation and business success. Learn more: tridentconsultinginc.com .Some of our recent awards include:Trailblazer Women Award 2025 by Consulate General of India in San Francisco.Ranked as the #1 Women Owned Business Enterprise in the large category by ITServe.Received the TechServe Excellence award.Consistently ranked in the Inc. 5000 list of fastest-growing private companies in America.Recognized in the SF Business Times as one of the Largest Bay Area BIPOC/Minority-Owned Businesses in 2022.", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-at-trident-consulting-4296112982", "source": "linkedin_rss_primary", "posted_date": "2025-09-04T22:10:29+00:00", "expires_date": null, "scraped_at": "2025-09-04T23:23:24.790830", "raw_data": {"entry_id": "25c42ce28bb33c95f05d92d487aeb2a9", "tags": [], "author": "LinkedIn"}}
{"id": "eb7c691a0a83", "title": "Nayax hiring Product Marketing Manager – Enterprise Retail in Folsom, CA", "company": "Nayax", "location": "Folsom, CA", "salary_range": null, "experience_required": "3 years of experience", "skills_mentioned": ["analytics", "agile", "market research", "go-to-market", "product launch"], "industry": "fintech", "description": "DescriptionNayax, a global fintech leader, is looking for a Product Marketing Manager (PMM) for Retail Pro, a company recently acquired to drive innovation in the SaaS retail ecosystem. We are committed to delivering state-of-the-art solutions for retailers, offering seamless integration, exceptional customer experiences, and cutting-edge technology. Join us in shaping the future of retail technology.This role is pivotal in developing and delivering strategic marketing plans, crafting compelling narratives for enterprise and large retail customers, and driving growth across our channels. A strong background in SaaS and retail technology is a major advantage.In This Position You WillDevelop compelling product positioning and messaging to clearly articulate the value of Retail Pro’s solutions to enterprise and large retail customers. Adapt content and communication strategies for different segments, focusing on customer pain points and unique solutions. Create high-impact materials for potential customers, including presentations, case studies, and white papers Develop new content for the development partner program, channel programs, and upcoming product launches. Define and execute go-to-market strategies for new products and features. Drive product launches, ensuring alignment with Nayax’s corporate objectives and customer needs. Oversee email campaigns targeting potential customers, leveraging analytics to optimize performance. Collaborate with the marketing team on event strategies, including shows, channel support, and on-ground presence. Work closely with sales, product, and marketing teams to ensure seamless collaboration and alignment. Serve as the on-ground driver for Retail Pro integration and customer engagement strategies. Conduct market research to understand customer needs, market trends, and competitive dynamics. Translate insights into actionable recommendations for product development and marketing strategies. RequirementsUp to 3 years of experience in Product Marketing or related roles, preferably in the SaaS and/or retail technology sector. Experience in developing B2B marketing strategies for enterprise/large customers. Understanding of SaaS product ecosystems and retail technology trends. Exceptional writing, communication, and presentation skills. Experience in launching and managing email campaigns, product launches, and GTM strategies. Ability to manage cross-functional teams and thrive in a fast-paced, dynamic environment. Familiarity with POS Solutions or similar retail technology solutions- AdvantageWhat Makes This Role ExcitingYou will have a leading role in defining marketing strategy and content creation for the industry’s most advanced solutions and practices You will use state-of-the-art marketing tools and practices You will have the opportunity to work in a multinational environment for the global market leader in its field You will have a central and noticeable role in the company with opportunities to present to stakeholders and drive impactful projects The salary range for this position is up to $130k USD per annum plus benefitsLearn More About NayaxNayax is a global fintech company (NASDAQ; TASE: NYAX) providing an end-to-end platform for payments, consumer engagement, and business operations.Founded in 2005, Nayax empowers businesses to grow revenue, reduce operational costs, and deliver seamless commerce experiences. Our customer-first mindset and commitment to in-house innovation have positioned us at the forefront of the cashless payment revolution, serving the unattended and retail sectors around the world.We support over 80 payment methods in 50+ currencies, hold a European payment institution license, and have formed strategic partnerships with global financial institutions to deliver powerful, scalable solutions.With more than 1,100 employees across 11 global offices, Nayax operates in 62+ countries. Our global headquarters in Herzliya Hills, Israel, is our largest site, housing over 600 employees across 20+ departments — just a short walk from the train station and designed for collaboration and growth.At Nayax, we believe in creating long-term impact through loyalty tools, omnichannel solutions, and an agile ecosystem of value-added services. We're proud to support businesses in reaching new heights and we're always looking for innovative, passionate individuals to join us.", "apply_url": "https://www.linkedin.com/jobs/view/product-marketing-manager-%E2%80%93-enterprise-retail-at-nayax-4296144055", "source": "linkedin_rss_secondary", "posted_date": "2025-09-05T00:47:22+00:00", "expires_date": null, "scraped_at": "2025-09-04T23:23:25.273885", "raw_data": {"entry_id": "3f10b7a542be09f009ad368b880c4b1a", "tags": [], "author": "LinkedIn"}}
{"id": "9e175cf07d67", "title": "Mondo hiring Digital Strategy Manager in Charlotte Metro", "company": "Mondo", "location": "strategy, or", "salary_range": null, "experience_required": "senior", "skills_mentioned": [], "industry": "fintech", "description": "About the Role We are seeking a highly analytical and polished Digital Strategy Manager to help shape the future of digital in our banking environment. This role is ideal for someone with a management consulting background who can independently take on complex strategic projects, build business cases, and develop recommendations that influence senior leadership. You will partner with executives, product leaders, and cross-functional stakeholders to define where digital fits into the business over the next 3–5 years and how emerging trends, fintech partnerships, and new technologies will shape our strategy.This is a high-visibility role for someone who thrives in ambiguity, connects inputs from across the organization, and communicates complex ideas clearly and persuasively.Key ResponsibilitiesLead strategic projects focused on digital transformation within the banking environment, from business case development to execution recommendations.Conduct financial analysis, vendor reviews, and competitive assessments to inform decision-making.Build polished, executive-ready presentations that synthesize data and communicate strategies to product leaders and the C-suite.Collaborate with business heads and functional leaders to define the 3–5 year digital roadmap.Support strategy development in areas such as identity authentication, small business solutions, strategic fintech partnerships, and procurement.Facilitate cross-functional input gathering, aligning stakeholders around consumer strategies and enterprise goals.Draft and review partnership agreements in collaboration with procurement and legal.Stay plugged into fintech trends, emerging technologies, and competitive landscapes to ensure strategies remain forward-looking.Must-Have Qualifications7–10 years of professional experience, including 5+ years in management consulting with exposure to multiple industries or strategic projects.Strong track record of building financial analyses, business cases, and vendor assessments.Expert in creating polished, executive-level PowerPoint presentations that clearly communicate complex strategies.Knowledge of banking, digital, and fintech ecosystems, with the ability to connect trends to business strategies.Strong communication and collaboration skills, with the ability to influence stakeholders from product teams to senior executives.High energy, natural curiosity, and the ability to work independently in a fast-paced environment.Preferred QualificationsPrior experience in commercial banking, fintech strategy, or financial services consulting.Direct involvement with identity/authentication solutions, small business banking, or fintech partnerships.Background in strategic partnership groups, strategy teams within banks, or fintech-focused consulting engagements.BenefitsHealth, Dental, Vision, Parental Leave, Disability Coverage, FHN, Group Life Insurance, PTO", "apply_url": "https://www.linkedin.com/jobs/view/digital-strategy-manager-at-mondo-4295985691", "source": "linkedin_rss_secondary", "posted_date": "2025-09-04T18:59:12+00:00", "expires_date": null, "scraped_at": "2025-09-04T23:23:25.281916", "raw_data": {"entry_id": "a4b86fadcdd9112ba46c09f568ddbbbc", "tags": [], "author": "LinkedIn"}}
{"id": "b74660bf9b25", "title": "JPMorganChase hiring Trust & Safety Product Sales Product Manager– Payments - Vice President in Tampa, FL", "company": "JPMorganChase", "location": "Tampa, FL", "salary_range": null, "experience_required": "5+ years of experience", "skills_mentioned": ["analytics", "agile", "pricing"], "industry": "fintech", "description": "Job DescriptionYou enjoy shaping the future of product innovation as a core leader, driving value for customers, guiding successful launches, and exceeding expectations. Join our dynamic team and make a meaningful impact by delivering high-quality products that resonate with clients.As a Product Manager in Trust & Safety, you are an integral part of the team that innovates new product offerings and leads the end-to-end product life cycle. You are responsible for acting as the voice of the customer and developing profitable products that provide customer value. Utilizing your deep understanding of how to get a product off the ground, you guide the successful launch of products, gather crucial feedback, and ensure top-tier client experiences. With a strong commitment to scalability, resiliency, and stability, you collaborate closely with cross-functional teams to deliver high-quality products that exceed customer expectations.We are seeking a talented professional for a Product Commercialization Specialist role on our Trust & Safety team. The Product Manager drives educating internal partners, collaborating with Product Managers and Sales Specialists, creation and development of product specific materials to support the go to market strategy of the product. The ability to listen, learn, communicate and establish strong relationships is essential for success. Prior product, training or presentation skills is a crucial component of the role and will facilitate successful outcomes. The Product Commercialization Specialist should also be versed in payment products, technology, data, AI & ML subjects. The successful candidate will have a deep understanding of execution for results, effectively navigating internal processes and procedures, quality delivery and strong problem solving skills. This individual will occupy a role with exposure across J.P Morgan Payments & Commerce Solutions, our clients and the industry.Our focused group of professionals is composed of high performers from top payments, fintech, banking, consulting firms, and other industry experts. Annual performance objectives will be established so that contribution and value can be assessed throughout the year. We are looking for the right candidate to bring their enthusiasm, experience and commitment to our payment franchise.Job ResponsibilitiesDefine and develop internal and external marketing materials Adapt to quickly learn new product details to ensure they are documented accuratelyAdjust to flex and be agile to adapt to a rapidly changing landscapeCoordinate with senior leaders across lines of business to design innovative client focused products to enhance adoption Plan and own commercialization of new services with internal Sales, Service and onboarding colleagues. Succeed in a diverse, high performing and motivated team that models our Diversity & Inclusion objectivesEncourage innovation as well as partnership with cross functional partners in technology, operations, service, risk, compliance and legalLeverage data and operating metrics to improve products and services Demonstrate leadership commercialization disciplines Actively support marketing effortsRepresent Trust and Safety products in Sales and Partner forums and training sessionsRequired Qualifications, Capabilities, And Skills5+ years of experience or equivalent expertise in product management or a relevant domain areaAdvanced knowledge of the product development life cycle, design, and data analyticsProven ability to lead product life cycle activities including discovery, ideation, strategic development, requirements definition, and value managementCollaborate on go to market strategies alongside product, marketing and commercialization teams championing the product in positioning, messaging, placement, thought leadership, other go to market deliverablesAdopt and adhere to Agile methodology and thought processesAn outstanding ability to analyze and solve problems along with the confidence to advance innovative and differentiated solutionsClear understanding of pricing strategies to align appropriately with billing teams to secure service codesProven success in execution of deliverablesRepresent the T&S products at various internal governance forumsPreferred Qualifications, Capabilities, And SkillsDemonstrated prior experience working in a highly matrixed, complex organizationExcellent track record of success in designing and executing strategies in large, high performance organizations A track record of demonstrating leadership and innovationExceptionally strong presentation and communication skills Ability to handle multiple work streams and manage stakeholder expectationsWork related domestic travel About UsJPMorganChase, one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world’s most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.We offer a competitive total rewards package including base salary determined based on the role, experience, skill set and location. Those in eligible roles may receive commission-based pay and/or discretionary incentive compensation, paid in the form of cash and/or forfeitable equity, awarded in recognition of individual achievements and contributions. We also offer a range of benefits and programs to meet employee needs, based on eligibility. These benefits include comprehensive health care coverage, on-site health and wellness centers, a retirement savings plan, backup childcare, tuition reimbursement, mental health support, financial coaching and more. Additional details about total compensation and benefits will be provided during the hiring process.We recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. We also make reasonable accommodations for applicants’ and employees’ religious practices and beliefs, as well as mental health or physical disability needs. Visit our FAQs for more information about requesting an accommodation.JPMorgan Chase & Co. is an Equal Opportunity Employer, including Disability/VeteransAbout The TeamA part of the Commercial & Investment Bank, J.P. Morgan Payments enables organizations of all sizes to execute transactions efficiently and securely, transforming the movement of information, money, and assets. The team of experts tackles complex challenges at every stage of the payment lifecycle. And their industry-leading solutions facilitate seamless transactions across borders, industries, and platforms.Operating in over 160 countries and handling more than 120 currencies, J.P. Morgan Payments business is the largest processor of USD payments, with a daily transaction volume of $10 trillion.", "apply_url": "https://www.linkedin.com/jobs/view/trust-safety-product-sales-product-manager%E2%80%93-payments-vice-president-at-jpmorganchase-4295953172", "source": "linkedin_rss_secondary", "posted_date": "2025-09-04T16:48:40+00:00", "expires_date": null, "scraped_at": "2025-09-04T23:23:25.287454", "raw_data": {"entry_id": "1c6e991061a265127181d542c5d5f57a", "tags": [], "author": "LinkedIn"}}
{"id": "c2af43855d37", "title": "InvoiceCloud, Inc. hiring Senior Product Marketing Manager (Government & Utilities Vertical) in Boston, MA", "company": "InvoiceCloud, Inc.", "location": "Boston, MA", "salary_range": null, "experience_required": "7 years of experience", "skills_mentioned": ["analytics", "market research", "go-to-market", "product launch"], "industry": "fintech", "description": "About InvoiceCloudInvoiceCloud is a fast-growing fintech company with an award-winning culture and a leading disruptor in the electronic bill presentment and payment (EBPP) space. Serving more than 3,200 customers across the utility, government, and insurance industries, InvoiceCloud’s secure and innovative SaaS platform enhances the customer experience, driving higher digital payment, AutoPay, and paperless adoption rates. By switching to InvoiceCloud, clients can improve customer engagement and satisfaction while lowering costs, accelerating payments, and reducing staff workloads. To learn more, visit InvoiceCloud.com.Position SummaryThe Senior Product Marketing Manager will be responsible for driving go-to-market strategy, positioning, and demand for the company’s digital payment and engagement solutions tailored to utilities and government industry. The role requires deep market insights, positioning expertise, and strategic positioning and go-to-market messaging skills. You will serve as the voice of the customer within the organization and collaborate closely with Sales, Product Management, Demand Generation, and Customer Success to drive adoption, differentiation, and revenue growth. The ideal candidate will have deep expertise within the utilities/government ecosystem, experience in B2B SaaS, and a history of successfully executing in a product marketing role.Key ResponsibilitiesConduct market research to identify trends, customer needs, and competitive positioning.Analyze industry shifts, customer communication preferences, and regulatory changes.Develop outcome-based messaging and compelling value propositions tailored to key stakeholders.Translate complex product capabilities into clear, value-driven content for various personas (e.g., CFO, Customer Experience, IT, etc.).Partner with Sales, Demand Generation, and Product Management to plan and execute go-to-market strategies for new product capabilities, launches, and vertical expansions.Create sales enablement materials including pitch decks, battlecards, ROI calculators, customer use cases, and objection-handling guides.Collaborate with demand generation and partner marketing teams on campaigns that drive awareness, pipeline growth and retention.Partner with Customer Marketing and Customer Success to identify advocates, document case studies, and develop referenceable stories.Engage directly with clients and prospects to validate messaging and gather feedback on market needs.Train the sales team on messaging, use cases, and competitive differentiation within the insurance vertical.Support strategic deals with tailored messaging, proposals, and positioning guidance.What We’re Looking For5-7 years of experience in a product marketing roleDeep understanding of the utilities and the industry’s digital transformation trendsProven experience marketing B2B SaaS solutions, preferable in paymentsStrong communication, storytelling, and strategic go-to-market skillsSuperior analytical skills, with the ability to understand and articulate the context, outcomes, and impact of the analysis to a diverse audienceExpertise in prioritizing multiple projects at once and effectively managing stakeholder expectationsExcellent collaboration skills and the ability to work cross-functionally in a fast-paced environment.Self-starter with a data-driven mindset and a passion for customer-centric marketingLeverage AI-driven insights and automation to accelerate go-to-market execution and enhance customer value realization across the insurance verticalExceptional ability to communicate effectively with multiple audiences, from C-level to entry level, internal and externalPositive attitude, curious intellectual, life-long learnerPreferredPrior experience in EBPP, billing platforms, or payment technologyFamiliarity with core CIS platforms (e.g., Oracle, SAP, etc.) and integrationsProficiency using AI and analytics tools to uncover customer insights and accelerate value deliveryProven experience product launch frameworks and go-to-market planningBase salary is one component of total compensation. Employees may also be eligible for an annual bonus or commission. Some roles may also be eligible for overtime pay. The above represents the expected base compensation range for this job requisition. Ultimately, in determining your pay, we’ll consider many factors including, but not limited to, skills, experience, qualifications, geographic location, and other job-related factors.Base Compensation Range$140,000—$150,000 USDInvoiceCloud is an Equal Opportunity Employer. InvoiceCloud provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training. If you have a disability under the Americans with Disabilities Act or similar law, or you require a religious accommodation, and you wish to discuss potential accommodations related to applying for employment at our company, please contact jobs@invoicecloud.com.Click here to review InvoiceCloud's Job Applicant Privacy Policy.To all recruitment agencies: InvoiceCloud does not accept agency resumes. Please do not forward resumes to our job’s alias, employees, or any other organization location. Invoice Cloud is not responsible for any fees related to unsolicited resumes.", "apply_url": "https://www.linkedin.com/jobs/view/senior-product-marketing-manager-government-utilities-vertical-at-invoicecloud-inc-4266992420", "source": "linkedin_rss_secondary", "posted_date": "2025-09-04T13:43:13+00:00", "expires_date": null, "scraped_at": "2025-09-04T23:23:25.291462", "raw_data": {"entry_id": "291c9d6eea1123b49182a7dc39cd2367", "tags": [], "author": "LinkedIn"}}
