{"id": "da88cf2d5e65", "title": "IBM hiring Associate Product Manager in San Francisco, CA", "company": "LinkedIn", "location": "Francisco, CA", "salary_range": null, "experience_required": null, "skills_mentioned": ["user research"], "industry": "healthtech", "description": "IntroductionA career in IBM Software means you'll be part of a team that transforms our customer's challenges into industry-leading solutions. We are an infinitely curious team, always seeking new possibilities, and dedicated to creating the world's leading AI-powered, cloud-native software solutions. Our renowned legacy creates endless global opportunities for our network of IBMers. We are a team of deep product experts, ensuring exceptional client experiences, with a focus on delivery, excellence, and obsession over customer outcomes. This position involves contributing to HashiCorp's offerings, now part of IBM, which empower organizations to automate and secure multi-cloud and hybrid environments. You will join a team managing the lifecycle of infrastructure and security, enhancing IBM's cloud solutions to ensure enterprises achieve efficiency, security, and scalability in their cloud journey.Your Role And ResponsibilitiesThe HashiCorp Secure product line is currently comprised of Vault and Boundary. HashiCorp Vault is an identity based multi-cloud security platform, with extensive capabilities in secrets management, encryption, and access/identity management. HashiCorp Boundary is a solution that automates secure identity-based user access to hosts and services across environments. Our open source community has tens of thousands of active, engaged users, and our enterprise users are some of the largest finance, healthcare, and technology companies in the world.As an Associate Product Manager in the Secure team you will be deeply engaged in all aspects of creating and delivering the Secure products as Software as a Service (SaaS) offerings. This is a unique opportunity to join a fast growing PM team focused on delivering these services on the HashiCorp Cloud Platform (HCP). You will work closely with the Vault and Boundary engineering teams, as well as the HashiCorp Cloud team to support the development and release of Secure SaaS offerings.Role SpecificsThe Associate Product Manager (APM) will initially pair with the other Secure Cloud PMs, to come up to speed on the product, the stakeholders, and the practices in playThe APM will own an initial review of documentation (pairing with the Learn team), and making updates to address customer feedbackThe APM will partner with UXR on upcoming design studies on HCP Vault, with a focus on Administrator and Developer experiencesMore concrete focus areas will be mutually agreed upon with the APM as they get more exposure to the product line, and as they learn more about the practiceResponsibilitiesLearning and growing in the practice of Product Management is a key piece of the Associate role, and this individual will be expected to make use of learning resources when reasonably availableWorking to deeply understand user needs as they seek to exercise HashiCorp’s Secure products as managed services, and how those needs differ from customer-managed versionsHelp to craft the product story by understanding the market and technology landscapes, user needs, and HashiCorp principlesWrite detailed documentation to provide context for users of the product, and for engineering stakeholders implementing the productCollaborate with Engineering, Design, PMM, and other internal stakeholders on the strategy and tactics of the executionHelp in prioritizing the product roadmap by taking feedback from practitioners, Engineering, Marketing, and the broader HashiCorp Product groupConduct user research and write Product Requirement Documents (PRDs) to distill the research into requirements for Engineering to deliverKeep Sales and Marketing updated on feature releases and keep Engineering informed on feature requestsHelp with Sales and Marketing enablement to educate on the product story and features (website copy, whitepapers, sales decks, FAQs, etc)Preferred EducationBachelor's DegreeRequired Technical And Professional ExpertiseWillingness to learn, and to participate across multiple disciplinesAbility to organize multiple stakeholders towards a common goalAnalytical mindset, with the ability to prioritize and make tradeoffsStrong technical acumen, with a solid understanding of infrastructure, cloud, and open sourcePreferred Technical And Professional ExperienceFamiliarity with IBM and HashiCorp products and services.", "apply_url": "https://www.linkedin.com/jobs/view/associate-product-manager-at-ibm-4293683050", "source": "linkedin_rss_primary", "posted_date": "2025-09-04T05:06:51+00:00", "expires_date": null, "scraped_at": "2025-09-04T03:20:12.405952", "raw_data": {"entry_id": "5f527c39b0ee3aae0afc39e3bad50442", "tags": [], "author": "LinkedIn"}}
{"id": "e589bde3516a", "title": "OrderMyGear (OMG) hiring Product Manager in Dallas, TX", "company": "OMG", "location": "Dallas, TX", "salary_range": null, "experience_required": "2 years of experience", "skills_mentioned": ["agile", "product launch"], "industry": "saas", "description": "Team OMGOrderMyGear (OMG) is the market-leading technology for promotional product distributors, apparel decorators, team dealers, and suppliers to sell branded merchandise across channels. OMG continues to push boundaries, shaping the future of group online commerce. We approach challenges as opportunities and continue building a Team of OMG'ers who work hard, welcome change, and live out our Magic.So come join us at OMG! You can play a pivotal role in this rapidly changing industry as we scale our platform and improve the eCommerce experience for our clients and their customers.Our MagicTEAM IS EVERYTHINGWe Invest in Each OtherWe Create SolutionsWe Enjoy the RideEMBRACE IT. OWN IT. ALL IN.Product Management @ OMG Do you love doing puzzles? Do you love solving complex problems to help businesses thrive? If so, Product at OMG might be the place for you!We are seeking a Product Manager to drive the development of OMG's next-generation platform experience. This is a 0→1 initiative unifying our apps and cross-application workflows into a seamless ecosystem. The ideal candidate thrives in ambiguity, can translate big vision into iterative delivery, and is motivated by building foundational products that scale across user types and business lines.In this new role, you will work with the Product team to drive key business outcomes while ensuring our customers have the best possible experience. You will work closely with cross-functional teams to understand customer needs, identify areas for improvement, and create roadmaps that enhance our platform's functionality, usability, and user experience.Day in the LifeLead the product discovery and delivery for OMG's unified platform experienceDefine MVPs and long-term roadmap for new productsPartner with engineering to make build vs. buy vs. integrate decisionsCreate frameworks for platform modularity, scalability, and extensibilityDrive adoption of integrated workflowsDefine and prioritize requirements based on customer needs and business goalsCreate and maintain product roadmaps and backlogsDevelop and maintain product documentation, including business casesEnsure user experiences across OMG's unified platform experience are intuitive, performant, and consistent, with a focus on cross-app workflowsWork closely with design to maintain a cohesive visual identity while prioritizing usability and accessibilityLeverage AI-powered prototyping tools to accelerate discovery and validate design decisionsWork with Product Marketing to drive successful product launches and ensure successful adoption and customer satisfactionWork with Revenue teams to drive adoption and ensure growth outcomes are being metCommunicate product progress, risks, and changes to stakeholders, including customers, internal Teams, and executivesCollaborate with clients and every cross-functional Team at OMG to ensure successful solutions, product launches, and adoptionAnalyze user data and feedback to inform product improvements and iterate on existing productsConduct research to gain a deep understanding of user behavior, preferences, and pain pointsStay up-to-date on industry trends and competitive landscape to identify opportunities for innovation and differentiationRequirementsMust HavesAt least 2 years of experience as a Product ManagerExperience working on search, data-heavy products, or B2B platforms is a plusExperience with 0→1 product development or platform initiativesExperience collaborating with design teams on visual design consistencyAbility to leverage AI-powered tools to accelerate day-to-day product discovery, prototyping, and decision-makingFamiliarity with APIs, system integrations, or multi-product ecosystemsStrong ability to navigate ambiguity, run structured discovery, and iterate quicklyIntellectual curiosity, humility, strong collaboration skills, and a growth mindsetStrong analytical skills and ability to use data to drive decision-makingExcellent communication and interpersonal skillsStrong organizational skills and attention to detailAbility to work in an agile environment and manage multiple projectsPassion for delivering high-quality products that meet user needs and drive business resultsU.S. Citizen or Permanent Resident status requiredVisa Sponsorship is not availableOrderMyGear provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, sexual orientation, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.BenefitsA Few of the PerksCompetitive benefits & PTO401(k) with employer matchPaid parental leaveWholesale discount to name brandsIn-office benefits: Catered lunches & breakfasts Company happy hours and outings Casual office atmosphere & one block from Deep Ellum Fully stocked kitchen Commuter benefits", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-at-ordermygear-omg-4293639867", "source": "linkedin_rss_primary", "posted_date": "2025-09-03T21:12:03+00:00", "expires_date": null, "scraped_at": "2025-09-04T03:20:12.408332", "raw_data": {"entry_id": "9d7d53d09cb1e0ad31e5d657e1701ce7", "tags": [], "author": "LinkedIn"}}
{"id": "f611e5fbd05e", "title": "Appian hiring Associate Product Launch Manager (2025 Graduates) in McLean, VA", "company": "LinkedIn", "location": "McLean, VA", "salary_range": null, "experience_required": null, "skills_mentioned": ["analytics", "product launch"], "industry": "edtech", "description": "Here at Appian, our core values of Respect, Work to Impact, Ambition, and Constructive Dissent & Resolution define who we are. In short, this means we constantly seek to understand the best for our customers, we go beyond completion in our work, we strive for excellence with intensity, and we embrace candid communication. These values guide our actions and shape our culture every day. When you join Appian, you'll be part of a passionate team that's dedicated to accomplishing hard things.Are you looking to combine your passion for technology with your penchant for structured project management? Joining the Product Launch team at Appian means you will have the opportunity to learn in an environment that values cross-functional collaboration and is committed to personal and professional growth. It means coming up with creative ways to develop a product release strategy, then making it happen. It means working with cool tech that has a real impact on companies and consumers. At Appian, it’s not an empty promise, it’s what we do.This position will be responsible for successfully overseeing and executing the launch process for new products and services into the marketplace. As a launch manager, job duties include: collaborating transversely across Product Management, Sales, Customer Success, and Marketing teams to plan a structured go to market process, implement that plan, and analyze results to improve future launches.This role is based at our McLean, VA location. Appian was built on a culture of in-person collaboration, which we believe is a key driver of our mission to be the best. Employees hired for this position are expected to be in the office 5 days a week to foster that culture and ensure we continue to thrive through shared ideas and teamwork. We believe being in the office provides more opportunities to come together and celebrate working with the exceptional people across Appian.To Be Successful In This Role, You Need ToPossess strong communication and collaboration skills; ability to draw clarity out of complex and ever-changing environments. Have a strong project management background, likely as a former product manager, program manager, or member of a PMO. Combine creative thinking and analytics to develop a sophisticated understanding of Appian’s business. Have solid organizational skills, be strategic in your thought processes, and structured in your execution. Basic QualificationsB.S. in Business Administration, Marketing, or Computer Science 0-2 years of project management, product management, or product marketing experience Advanced skills with productivity software including the Microsoft Office or Google suite Tools and Resources Training and Development: During onboarding, we focus on equipping new hires with the skills and knowledge for success through department-specific training. Continuous learning is a central focus at Appian, with dedicated mentorship and the First-Friend program being widely utilized resources for new hires. Growth Opportunities: Appian provides a diverse array of growth and development opportunities, including our leadership program tailored for new and aspiring managers, a comprehensive library of specialized department training through Appian University, skills based training, and tuition reimbursement for those aiming to advance their education. This commitment ensures that employees have access to a holistic range of development opportunities.Community: We’ll immerse you into our community rooted in respect starting on day one. Appian fosters inclusivity through our 8 employee-led affinity groups. These groups help employees build stronger internal and external networks by planning social, educational, and outreach activities to connect with Appianites and larger initiatives throughout the company.About AppianAppian is a software company that automates business processes. The Appian AI-Powered Process Platform includes everything you need to design, automate, and optimize even the most complex processes, from start to finish. The world's most innovative organizations trust Appian to improve their workflows, unify data, and optimize operations—resulting in better growth and superior customer experiences. For more information, visit appian.com. [Nasdaq: APPN]Follow Appian: LinkedIn.Appian is an equal opportunity employer that strives to attract and retain the best talent. All qualified applicants will receive consideration for employment without regard to any characteristic protected by applicable federal, state, or local law. Appian provides reasonable accommodations to applicants in accordance with all applicable laws. If you need a reasonable accommodation for any part of the employment process, please contact us by email at ReasonableAccommodations@appian.com. Please note that only inquiries concerning a request for reasonable accommodation will be responded to from this email address.Appian's Applicant & Candidate Privacy Notice", "apply_url": "https://www.linkedin.com/jobs/view/associate-product-launch-manager-2025-graduates-at-appian-4294842961", "source": "linkedin_rss_primary", "posted_date": "2025-09-03T18:10:53+00:00", "expires_date": null, "scraped_at": "2025-09-04T03:20:12.410125", "raw_data": {"entry_id": "f2ee82f4b53f60b93a30f8113dd77d12", "tags": [], "author": "LinkedIn"}}
{"id": "d3ec0fc700a6", "title": "Airbnb hiring Product Manager, LATAM (Mexico City, Mexico) in Miami, FL", "company": "Mexico City, Mexico", "location": "Miami, FL", "salary_range": null, "experience_required": null, "skills_mentioned": ["product strategy", "user research", "go-to-market"], "industry": "e-commerce", "description": "Airbnb was born in 2007 when two hosts welcomed three guests to their San Francisco home, and has since grown to over 5 million hosts who have welcomed over 2 billion guest arrivals in almost every country across the globe. Every day, hosts offer unique stays and experiences that make it possible for guests to connect with communities in a more authentic way.The Community You Will JoinOur Product Marketing team imagines the ideal experience for our community and works backwards, creating innovative products that delight our guests and hosts. They deeply understand the needs of our users and translate these into a product strategy that combines strong product thinking and deep research. They partner with talented cross-functional team members across engineering, design, operations, data science, and more, leading teams to execute a shared vision. They are incredibly detail-oriented, hands on and excellent communicators, capable of crafting compelling stories for both internal and external audiences.The Difference You Will MakeThe International Product Marketing team is part of the Worldwide Product Marketing team. We are looking for entrepreneurial product experts who are ready to jump in, roll their sleeves up and integrate with local and regional teams, while maintaining close alignment with the worldwide teams. This role will help build out the new functional area outside of the US and will be instrumental in shaping the organization as it evolves. The cross functional model we use at Airbnb requires close partnerships across multiple teams – this role requires a highly collaborative, flexible individual who can influence and collaborate with teams across the world.As the Product Manager based in our LATAM region, you will report to the Product Marketing Director for International Markets. As the product marketing leader for the market(s) in LATAM, you will play a pivotal role in understanding the needs, pain points, and behavior of users and translate those insights into innovative product features, capabilities and marketing strategies. The ideal candidate will possess a deep understanding of the travel industry at a market and broader regional level, and have a proven track record of driving product innovation. You will collaborate with the global business and country teams to develop partnerships that accelerate existing and new businesses. You will drive features in major releases and for test and learn pilots, after having successfully championed customization and features for your target country/region. You will also determine how they are communicated to the public and the media in your region in partnership with other communications and marketing teams. You are responsible for the success of Airbnb products throughout their life cycle — from concept to release. You will be the voice of our products for the market in your region and love the journey from taking a product from idea to reality.A Typical DayBuild deep expertise on Airbnb in your market/region through user research, marketplace data, and an understanding of the competitive landscape and be capable of synthesizing in a cohort product story input from multiple stakeholders and sources.Work with other functional leaders in your market/region to articulate the product vision, strategy, and roadmap for Airbnb products and new businesses.Implement best-in-class product development and management practices, including relevant go-to-market kits and information packs for local teams, while working with central and local teams.Maintain and articulate a product feature and roadmap prioritization plan in collaboration with local teams.Advocate for and execute new products that deliver impact for our business and users.Communicate concisely and influence outcomes across all levels of the company, including country and regional executive teams.Drive alignment across product teams (Technology, Design) and key cross-functional partners (Business, Supply, FP&A, Marketing, Global Operations, Customer Support, Trust, etc.) to ensure initiatives are prioritized for wider roll-out or piloted to test and learnDefine goals and success with clearly measurable objectives and key results for your area.Build and seamlessly integrate partnerships in your country/region that expand existing businesses and build new ones.Navigate regulatory and government requirements in partnership with Policy/Comms and regions/markets.Craft the product narrative and marketing strategies that communicate the benefits and features of our products both internally and externally in collaboration with comms and other cross functional partners.Develop and deliver engaging product demos to press, showcasing key features and functionalities.Your Expertise10-15 years of product management experience.Demonstrated track record of product leadership. Comfortable with doing individual contributor product management work.Success in building and scaling global consumer products and ecosystems that people love.Experience creating product messaging and delivering to customers and the media.Entrepreneurial track record of taking an idea to reality – start up experience a plus while capable of operating in a larger organization.Ability to effectively use data and perform business analysis to support product strategy/decisions.Capable of driving execution across teams in a fast-paced environment.Highly collaborative and results oriented.Ability and willingness to travel around 30-35% of the time.Fluency in English and at least one other local language (Spanish or Portuguese).Your Location:This position is based in Mexico City, Mexico - Hybrid. The role may include occasional work at an Airbnb office or attendance at offsites, as agreed to with your manager.Our Commitment To Inclusion & BelongingAirbnb is committed to working with the broadest talent pool possible. We believe diverse ideas foster innovation and engagement, and allow us to attract creatively-led people, and to develop the best products, services and solutions. All qualified individuals are encouraged to apply.", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-latam-mexico-city-mexico-at-airbnb-4283931845", "source": "linkedin_rss_primary", "posted_date": "2025-09-03T13:30:42+00:00", "expires_date": null, "scraped_at": "2025-09-04T03:20:12.412614", "raw_data": {"entry_id": "14fb9a606e42294898ca170238a4000d", "tags": [], "author": "LinkedIn"}}
{"id": "9c23f89ff698", "title": "Airbnb hiring Product Manager, LATAM (Miami or San Francisco) in San Francisco, CA", "company": "Miami or San Francisco", "location": "Francisco, CA", "salary_range": null, "experience_required": null, "skills_mentioned": ["product strategy", "user research", "go-to-market"], "industry": "e-commerce", "description": "Airbnb was born in 2007 when two hosts welcomed three guests to their San Francisco home, and has since grown to over 5 million hosts who have welcomed over 2 billion guest arrivals in almost every country across the globe. Every day, hosts offer unique stays and experiences that make it possible for guests to connect with communities in a more authentic way.The Community You Will JoinOur Product Marketing team imagines the ideal experience for our community and works backwards, creating innovative products that delight our guests and hosts. They deeply understand the needs of our users and translate these into a product strategy that combines strong product thinking and deep research. They partner with talented cross-functional team members across engineering, design, operations, data science, and more, leading teams to execute a shared vision. They are incredibly detail-oriented, hands on and excellent communicators, capable of crafting compelling stories for both internal and external audiences.The Difference You Will MakeThe International Product Marketing team is part of the Worldwide Product Marketing team. We are looking for entrepreneurial product experts who are ready to jump in, roll their sleeves up and integrate with local and regional teams, while maintaining close alignment with the worldwide teams. This role will help build out the new functional area outside of the US and will be instrumental in shaping the organization as it evolves. The cross functional model we use at Airbnb requires close partnerships across multiple teams – this role requires a highly collaborative, flexible individual who can influence and collaborate with teams across the world.As the Product Manager based in our LATAM region, you will report to the Product Marketing Director for International Markets. As the product marketing leader for the market(s) in LATAM, you will play a pivotal role in understanding the needs, pain points, and behavior of users and translate those insights into innovative product features, capabilities and marketing strategies. The ideal candidate will possess a deep understanding of the travel industry at a market and broader regional level, and have a proven track record of driving product innovation. You will collaborate with the global business and country teams to develop partnerships that accelerate existing and new businesses. You will drive features in major releases and for test and learn pilots, after having successfully championed customization and features for your target country/region. You will also determine how they are communicated to the public and the media in your region in partnership with other communications and marketing teams. You are responsible for the success of Airbnb products throughout their life cycle — from concept to release. You will be the voice of our products for the market in your region and love the journey from taking a product from idea to reality.A Typical DayBuild deep expertise on Airbnb in your market/region through user research, marketplace data, and an understanding of the competitive landscape and be capable of synthesizing in a cohort product story input from multiple stakeholders and sources.Work with other functional leaders in your market/region to articulate the product vision, strategy, and roadmap for Airbnb products and new businesses.Implement best-in-class product development and management practices, including relevant go-to-market kits and information packs for local teams, while working with central and local teams.Maintain and articulate a product feature and roadmap prioritization plan in collaboration with local teams.Advocate for and execute new products that deliver impact for our business and users.Communicate concisely and influence outcomes across all levels of the company, including country and regional executive teams.Drive alignment across product teams (Technology, Design) and key cross-functional partners (Business, Supply, FP&A, Marketing, Global Operations, Customer Support, Trust, etc.) to ensure initiatives are prioritized for wider roll-out or piloted to test and learnDefine goals and success with clearly measurable objectives and key results for your area.Build and seamlessly integrate partnerships in your country/region that expand existing businesses and build new ones.Navigate regulatory and government requirements in partnership with Policy/Comms and regions/markets.Craft the product narrative and marketing strategies that communicate the benefits and features of our products both internally and externally in collaboration with comms and other cross functional partners.Develop and deliver engaging product demos to press, showcasing key features and functionalities.Your Expertise10-15 years of product management experience.Demonstrated track record of product leadership. Comfortable with doing individual contributor product management work.Success in building and scaling global consumer products and ecosystems that people love.Experience creating product messaging and delivering to customers and the media.Entrepreneurial track record of taking an idea to reality – start up experience a plus while capable of operating in a larger organization.Ability to effectively use data and perform business analysis to support product strategy/decisions.Capable of driving execution across teams in a fast-paced environment.Highly collaborative and results oriented.Ability and willingness to travel frequently (30-35% of the time).Fluency in English and at least one other local language (Spanish or Portuguese).Your Location:Due to the nature of this position, the successful applicant will need to be based in San Francisco or Miami to be able to conduct their work. The role may include occasional work at an Airbnb office or attendance at offsites, as agreed to with your manager. Currently, employees can not be located in: Alaska, Indiana, Nebraska, North Dakota, Ohio, South Dakota, Wisconsin, Alabama, Mississippi, Oklahoma, Delaware And Rhode Island. This list is continuously being updated, please check back with us if the state you live in is on the exclusion list. If your position is employed by another Airbnb entity, your recruiter will inform you what states you are eligible to work from.Our Commitment To Inclusion & BelongingAirbnb is committed to working with the broadest talent pool possible. We believe diverse ideas foster innovation and engagement, and allow us to attract creatively-led people, and to develop the best products, services and solutions. All qualified individuals are encouraged to apply.We strive to also provide a disability inclusive application and interview process. If you are a candidate with a disability and require reasonable accommodation in order to submit an application, please contact us at: reasonableaccommodations@airbnb.com. Please include your full name, the role you’re applying for and the accommodation necessary to assist you with the recruiting process.We ask that you only reach out to us if you are a candidate whose disability prevents you from being able to complete our online application.", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-latam-miami-or-san-francisco-at-airbnb-4283932798", "source": "linkedin_rss_primary", "posted_date": "2025-09-03T13:27:31+00:00", "expires_date": null, "scraped_at": "2025-09-04T03:20:12.413901", "raw_data": {"entry_id": "e83e0811af4b9705905ea304c6ab194b", "tags": [], "author": "LinkedIn"}}
{"id": "42ad312590da", "title": "Airbnb hiring Product Manager, LATAM (São Paulo, Brazil) in San Francisco, CA", "company": "LinkedIn", "location": "Francisco, CA", "salary_range": null, "experience_required": null, "skills_mentioned": ["product strategy", "user research", "go-to-market"], "industry": "e-commerce", "description": "Airbnb was born in 2007 when two hosts welcomed three guests to their San Francisco home, and has since grown to over 5 million hosts who have welcomed over 2 billion guest arrivals in almost every country across the globe. Every day, hosts offer unique stays and experiences that make it possible for guests to connect with communities in a more authentic way.The Community You Will JoinOur Product Marketing team imagines the ideal experience for our community and works backwards, creating innovative products that delight our guests and hosts. They deeply understand the needs of our users and translate these into a product strategy that combines strong product thinking and deep research. They partner with talented cross-functional team members across engineering, design, operations, data science, and more, leading teams to execute a shared vision. They are incredibly detail-oriented, hands on and excellent communicators, capable of crafting compelling stories for both internal and external audiences.The Difference You Will MakeThe International Product Marketing team is part of the Worldwide Product Marketing team. We are looking for entrepreneurial product experts who are ready to jump in, roll their sleeves up and integrate with local and regional teams, while maintaining close alignment with the worldwide teams. This role will help build out the new functional area outside of the US and will be instrumental in shaping the organization as it evolves. The cross functional model we use at Airbnb requires close partnerships across multiple teams – this role requires a highly collaborative, flexible individual who can influence and collaborate with teams across the world.As the Product Manager based in our LATAM region, you will report to the Product Marketing Director for International Markets. As the product marketing leader for the market(s) in LATAM, you will play a pivotal role in understanding the needs, pain points, and behavior of users and translate those insights into innovative product features, capabilities and marketing strategies. The ideal candidate will possess a deep understanding of the travel industry at a market and broader regional level, and have a proven track record of driving product innovation. You will collaborate with the global business and country teams to develop partnerships that accelerate existing and new businesses. You will drive features in major releases and for test and learn pilots, after having successfully championed customization and features for your target country/region. You will also determine how they are communicated to the public and the media in your region in partnership with other communications and marketing teams. You are responsible for the success of Airbnb products throughout their life cycle — from concept to release. You will be the voice of our products for the market in your region and love the journey from taking a product from idea to reality.A Typical DayBuild deep expertise on Airbnb in your market/region through user research, marketplace data, and an understanding of the competitive landscape and be capable of synthesizing in a cohort product story input from multiple stakeholders and sources.Work with other functional leaders in your market/region to articulate the product vision, strategy, and roadmap for Airbnb products and new businesses.Implement best-in-class product development and management practices, including relevant go-to-market kits and information packs for local teams, while working with central and local teams.Maintain and articulate a product feature and roadmap prioritization plan in collaboration with local teams.Advocate for and execute new products that deliver impact for our business and users.Communicate concisely and influence outcomes across all levels of the company, including country and regional executive teams.Drive alignment across product teams (Technology, Design) and key cross-functional partners (Business, Supply, FP&A, Marketing, Global Operations, Customer Support, Trust, etc.) to ensure initiatives are prioritized for wider roll-out or piloted to test and learnDefine goals and success with clearly measurable objectives and key results for your area.Build and seamlessly integrate partnerships in your country/region that expand existing businesses and build new ones.Navigate regulatory and government requirements in partnership with Policy/Comms and regions/markets.Craft the product narrative and marketing strategies that communicate the benefits and features of our products both internally and externally in collaboration with comms and other cross functional partners.Develop and deliver engaging product demos to press, showcasing key features and functionalities.Your Expertise10-15 years of product management experience.Demonstrated track record of product leadership. Comfortable with doing individual contributor product management work.Success in building and scaling global consumer products and ecosystems that people love.Experience creating product messaging and delivering to customers and the media.Entrepreneurial track record of taking an idea to reality – start up experience a plus while capable of operating in a larger organization.Ability to effectively use data and perform business analysis to support product strategy/decisions.Capable of driving execution across teams in a fast-paced environment.Highly collaborative and results oriented.Ability and willingness to travel around 30-35% of the time.Fluency in English and at least one other local language (Spanish or Portuguese).Your Location:This position is based in Sao Paulo, Brazil - Hybrid. The role may include occasional work at an Airbnb office or attendance at offsites, as agreed to with your manager.Our Commitment To Inclusion & BelongingAirbnb is committed to working with the broadest talent pool possible. We believe diverse ideas foster innovation and engagement, and allow us to attract creatively-led people, and to develop the best products, services and solutions. All qualified individuals are encouraged to apply.", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-latam-s%C3%A3o-paulo-brazil-at-airbnb-4283934359", "source": "linkedin_rss_primary", "posted_date": "2025-09-03T13:27:30+00:00", "expires_date": null, "scraped_at": "2025-09-04T03:20:12.415022", "raw_data": {"entry_id": "0d074916cb0e02dd2aa3a5de1efb264f", "tags": [], "author": "LinkedIn"}}
{"id": "fb587c45dffa", "title": "Airbnb hiring Product Manager, LATAM (São Paulo, Brazil) in Miami, FL", "company": "LinkedIn", "location": "Miami, FL", "salary_range": null, "experience_required": null, "skills_mentioned": ["product strategy", "user research", "go-to-market"], "industry": "e-commerce", "description": "Airbnb was born in 2007 when two hosts welcomed three guests to their San Francisco home, and has since grown to over 5 million hosts who have welcomed over 2 billion guest arrivals in almost every country across the globe. Every day, hosts offer unique stays and experiences that make it possible for guests to connect with communities in a more authentic way.The Community You Will JoinOur Product Marketing team imagines the ideal experience for our community and works backwards, creating innovative products that delight our guests and hosts. They deeply understand the needs of our users and translate these into a product strategy that combines strong product thinking and deep research. They partner with talented cross-functional team members across engineering, design, operations, data science, and more, leading teams to execute a shared vision. They are incredibly detail-oriented, hands on and excellent communicators, capable of crafting compelling stories for both internal and external audiences.The Difference You Will MakeThe International Product Marketing team is part of the Worldwide Product Marketing team. We are looking for entrepreneurial product experts who are ready to jump in, roll their sleeves up and integrate with local and regional teams, while maintaining close alignment with the worldwide teams. This role will help build out the new functional area outside of the US and will be instrumental in shaping the organization as it evolves. The cross functional model we use at Airbnb requires close partnerships across multiple teams – this role requires a highly collaborative, flexible individual who can influence and collaborate with teams across the world.As the Product Manager based in our LATAM region, you will report to the Product Marketing Director for International Markets. As the product marketing leader for the market(s) in LATAM, you will play a pivotal role in understanding the needs, pain points, and behavior of users and translate those insights into innovative product features, capabilities and marketing strategies. The ideal candidate will possess a deep understanding of the travel industry at a market and broader regional level, and have a proven track record of driving product innovation. You will collaborate with the global business and country teams to develop partnerships that accelerate existing and new businesses. You will drive features in major releases and for test and learn pilots, after having successfully championed customization and features for your target country/region. You will also determine how they are communicated to the public and the media in your region in partnership with other communications and marketing teams. You are responsible for the success of Airbnb products throughout their life cycle — from concept to release. You will be the voice of our products for the market in your region and love the journey from taking a product from idea to reality.A Typical DayBuild deep expertise on Airbnb in your market/region through user research, marketplace data, and an understanding of the competitive landscape and be capable of synthesizing in a cohort product story input from multiple stakeholders and sources.Work with other functional leaders in your market/region to articulate the product vision, strategy, and roadmap for Airbnb products and new businesses.Implement best-in-class product development and management practices, including relevant go-to-market kits and information packs for local teams, while working with central and local teams.Maintain and articulate a product feature and roadmap prioritization plan in collaboration with local teams.Advocate for and execute new products that deliver impact for our business and users.Communicate concisely and influence outcomes across all levels of the company, including country and regional executive teams.Drive alignment across product teams (Technology, Design) and key cross-functional partners (Business, Supply, FP&A, Marketing, Global Operations, Customer Support, Trust, etc.) to ensure initiatives are prioritized for wider roll-out or piloted to test and learnDefine goals and success with clearly measurable objectives and key results for your area.Build and seamlessly integrate partnerships in your country/region that expand existing businesses and build new ones.Navigate regulatory and government requirements in partnership with Policy/Comms and regions/markets.Craft the product narrative and marketing strategies that communicate the benefits and features of our products both internally and externally in collaboration with comms and other cross functional partners.Develop and deliver engaging product demos to press, showcasing key features and functionalities.Your Expertise10-15 years of product management experience.Demonstrated track record of product leadership. Comfortable with doing individual contributor product management work.Success in building and scaling global consumer products and ecosystems that people love.Experience creating product messaging and delivering to customers and the media.Entrepreneurial track record of taking an idea to reality – start up experience a plus while capable of operating in a larger organization.Ability to effectively use data and perform business analysis to support product strategy/decisions.Capable of driving execution across teams in a fast-paced environment.Highly collaborative and results oriented.Ability and willingness to travel around 30-35% of the time.Fluency in English and at least one other local language (Spanish or Portuguese).Your Location:This position is based in Sao Paulo, Brazil - Hybrid. The role may include occasional work at an Airbnb office or attendance at offsites, as agreed to with your manager.Our Commitment To Inclusion & BelongingAirbnb is committed to working with the broadest talent pool possible. We believe diverse ideas foster innovation and engagement, and allow us to attract creatively-led people, and to develop the best products, services and solutions. All qualified individuals are encouraged to apply.", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-latam-s%C3%A3o-paulo-brazil-at-airbnb-4283935237", "source": "linkedin_rss_primary", "posted_date": "2025-09-03T13:27:29+00:00", "expires_date": null, "scraped_at": "2025-09-04T03:20:12.416007", "raw_data": {"entry_id": "b497bfb8404619665b758515c111029d", "tags": [], "author": "LinkedIn"}}
{"id": "edc845e49855", "title": "Airbnb hiring Product Manager, LATAM (Miami or San Francisco) in Miami, FL", "company": "Miami or San Francisco", "location": "Miami, FL", "salary_range": null, "experience_required": null, "skills_mentioned": ["product strategy", "user research", "go-to-market"], "industry": "e-commerce", "description": "Airbnb was born in 2007 when two hosts welcomed three guests to their San Francisco home, and has since grown to over 5 million hosts who have welcomed over 2 billion guest arrivals in almost every country across the globe. Every day, hosts offer unique stays and experiences that make it possible for guests to connect with communities in a more authentic way.The Community You Will JoinOur Product Marketing team imagines the ideal experience for our community and works backwards, creating innovative products that delight our guests and hosts. They deeply understand the needs of our users and translate these into a product strategy that combines strong product thinking and deep research. They partner with talented cross-functional team members across engineering, design, operations, data science, and more, leading teams to execute a shared vision. They are incredibly detail-oriented, hands on and excellent communicators, capable of crafting compelling stories for both internal and external audiences.The Difference You Will MakeThe International Product Marketing team is part of the Worldwide Product Marketing team. We are looking for entrepreneurial product experts who are ready to jump in, roll their sleeves up and integrate with local and regional teams, while maintaining close alignment with the worldwide teams. This role will help build out the new functional area outside of the US and will be instrumental in shaping the organization as it evolves. The cross functional model we use at Airbnb requires close partnerships across multiple teams – this role requires a highly collaborative, flexible individual who can influence and collaborate with teams across the world.As the Product Manager based in our LATAM region, you will report to the Product Marketing Director for International Markets. As the product marketing leader for the market(s) in LATAM, you will play a pivotal role in understanding the needs, pain points, and behavior of users and translate those insights into innovative product features, capabilities and marketing strategies. The ideal candidate will possess a deep understanding of the travel industry at a market and broader regional level, and have a proven track record of driving product innovation. You will collaborate with the global business and country teams to develop partnerships that accelerate existing and new businesses. You will drive features in major releases and for test and learn pilots, after having successfully championed customization and features for your target country/region. You will also determine how they are communicated to the public and the media in your region in partnership with other communications and marketing teams. You are responsible for the success of Airbnb products throughout their life cycle — from concept to release. You will be the voice of our products for the market in your region and love the journey from taking a product from idea to reality.A Typical DayBuild deep expertise on Airbnb in your market/region through user research, marketplace data, and an understanding of the competitive landscape and be capable of synthesizing in a cohort product story input from multiple stakeholders and sources.Work with other functional leaders in your market/region to articulate the product vision, strategy, and roadmap for Airbnb products and new businesses.Implement best-in-class product development and management practices, including relevant go-to-market kits and information packs for local teams, while working with central and local teams.Maintain and articulate a product feature and roadmap prioritization plan in collaboration with local teams.Advocate for and execute new products that deliver impact for our business and users.Communicate concisely and influence outcomes across all levels of the company, including country and regional executive teams.Drive alignment across product teams (Technology, Design) and key cross-functional partners (Business, Supply, FP&A, Marketing, Global Operations, Customer Support, Trust, etc.) to ensure initiatives are prioritized for wider roll-out or piloted to test and learnDefine goals and success with clearly measurable objectives and key results for your area.Build and seamlessly integrate partnerships in your country/region that expand existing businesses and build new ones.Navigate regulatory and government requirements in partnership with Policy/Comms and regions/markets.Craft the product narrative and marketing strategies that communicate the benefits and features of our products both internally and externally in collaboration with comms and other cross functional partners.Develop and deliver engaging product demos to press, showcasing key features and functionalities.Your Expertise10-15 years of product management experience.Demonstrated track record of product leadership. Comfortable with doing individual contributor product management work.Success in building and scaling global consumer products and ecosystems that people love.Experience creating product messaging and delivering to customers and the media.Entrepreneurial track record of taking an idea to reality – start up experience a plus while capable of operating in a larger organization.Ability to effectively use data and perform business analysis to support product strategy/decisions.Capable of driving execution across teams in a fast-paced environment.Highly collaborative and results oriented.Ability and willingness to travel frequently (30-35% of the time).Fluency in English and at least one other local language (Spanish or Portuguese).Your Location:Due to the nature of this position, the successful applicant will need to be based in San Francisco or Miami to be able to conduct their work. The role may include occasional work at an Airbnb office or attendance at offsites, as agreed to with your manager. Currently, employees can not be located in: Alaska, Indiana, Nebraska, North Dakota, Ohio, South Dakota, Wisconsin, Alabama, Mississippi, Oklahoma, Delaware And Rhode Island. This list is continuously being updated, please check back with us if the state you live in is on the exclusion list. If your position is employed by another Airbnb entity, your recruiter will inform you what states you are eligible to work from.Our Commitment To Inclusion & BelongingAirbnb is committed to working with the broadest talent pool possible. We believe diverse ideas foster innovation and engagement, and allow us to attract creatively-led people, and to develop the best products, services and solutions. All qualified individuals are encouraged to apply.We strive to also provide a disability inclusive application and interview process. If you are a candidate with a disability and require reasonable accommodation in order to submit an application, please contact us at: reasonableaccommodations@airbnb.com. Please include your full name, the role you’re applying for and the accommodation necessary to assist you with the recruiting process.We ask that you only reach out to us if you are a candidate whose disability prevents you from being able to complete our online application.", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-latam-miami-or-san-francisco-at-airbnb-4283938004", "source": "linkedin_rss_primary", "posted_date": "2025-09-03T13:27:03+00:00", "expires_date": null, "scraped_at": "2025-09-04T03:20:12.417693", "raw_data": {"entry_id": "74be8fcbdd86a9acdc093e2e0e42b093", "tags": [], "author": "LinkedIn"}}
{"id": "0d425d3452b0", "title": "Airbnb hiring Product Manager, LATAM (Mexico City, Mexico) in San Francisco, CA", "company": "Mexico City, Mexico", "location": "Francisco, CA", "salary_range": null, "experience_required": null, "skills_mentioned": ["product strategy", "user research", "go-to-market"], "industry": "e-commerce", "description": "Airbnb was born in 2007 when two hosts welcomed three guests to their San Francisco home, and has since grown to over 5 million hosts who have welcomed over 2 billion guest arrivals in almost every country across the globe. Every day, hosts offer unique stays and experiences that make it possible for guests to connect with communities in a more authentic way.The Community You Will JoinOur Product Marketing team imagines the ideal experience for our community and works backwards, creating innovative products that delight our guests and hosts. They deeply understand the needs of our users and translate these into a product strategy that combines strong product thinking and deep research. They partner with talented cross-functional team members across engineering, design, operations, data science, and more, leading teams to execute a shared vision. They are incredibly detail-oriented, hands on and excellent communicators, capable of crafting compelling stories for both internal and external audiences.The Difference You Will MakeThe International Product Marketing team is part of the Worldwide Product Marketing team. We are looking for entrepreneurial product experts who are ready to jump in, roll their sleeves up and integrate with local and regional teams, while maintaining close alignment with the worldwide teams. This role will help build out the new functional area outside of the US and will be instrumental in shaping the organization as it evolves. The cross functional model we use at Airbnb requires close partnerships across multiple teams – this role requires a highly collaborative, flexible individual who can influence and collaborate with teams across the world.As the Product Manager based in our LATAM region, you will report to the Product Marketing Director for International Markets. As the product marketing leader for the market(s) in LATAM, you will play a pivotal role in understanding the needs, pain points, and behavior of users and translate those insights into innovative product features, capabilities and marketing strategies. The ideal candidate will possess a deep understanding of the travel industry at a market and broader regional level, and have a proven track record of driving product innovation. You will collaborate with the global business and country teams to develop partnerships that accelerate existing and new businesses. You will drive features in major releases and for test and learn pilots, after having successfully championed customization and features for your target country/region. You will also determine how they are communicated to the public and the media in your region in partnership with other communications and marketing teams. You are responsible for the success of Airbnb products throughout their life cycle — from concept to release. You will be the voice of our products for the market in your region and love the journey from taking a product from idea to reality.A Typical DayBuild deep expertise on Airbnb in your market/region through user research, marketplace data, and an understanding of the competitive landscape and be capable of synthesizing in a cohort product story input from multiple stakeholders and sources.Work with other functional leaders in your market/region to articulate the product vision, strategy, and roadmap for Airbnb products and new businesses.Implement best-in-class product development and management practices, including relevant go-to-market kits and information packs for local teams, while working with central and local teams.Maintain and articulate a product feature and roadmap prioritization plan in collaboration with local teams.Advocate for and execute new products that deliver impact for our business and users.Communicate concisely and influence outcomes across all levels of the company, including country and regional executive teams.Drive alignment across product teams (Technology, Design) and key cross-functional partners (Business, Supply, FP&A, Marketing, Global Operations, Customer Support, Trust, etc.) to ensure initiatives are prioritized for wider roll-out or piloted to test and learnDefine goals and success with clearly measurable objectives and key results for your area.Build and seamlessly integrate partnerships in your country/region that expand existing businesses and build new ones.Navigate regulatory and government requirements in partnership with Policy/Comms and regions/markets.Craft the product narrative and marketing strategies that communicate the benefits and features of our products both internally and externally in collaboration with comms and other cross functional partners.Develop and deliver engaging product demos to press, showcasing key features and functionalities.Your Expertise10-15 years of product management experience.Demonstrated track record of product leadership. Comfortable with doing individual contributor product management work.Success in building and scaling global consumer products and ecosystems that people love.Experience creating product messaging and delivering to customers and the media.Entrepreneurial track record of taking an idea to reality – start up experience a plus while capable of operating in a larger organization.Ability to effectively use data and perform business analysis to support product strategy/decisions.Capable of driving execution across teams in a fast-paced environment.Highly collaborative and results oriented.Ability and willingness to travel around 30-35% of the time.Fluency in English and at least one other local language (Spanish or Portuguese).Your Location:This position is based in Mexico City, Mexico - Hybrid. The role may include occasional work at an Airbnb office or attendance at offsites, as agreed to with your manager.Our Commitment To Inclusion & BelongingAirbnb is committed to working with the broadest talent pool possible. We believe diverse ideas foster innovation and engagement, and allow us to attract creatively-led people, and to develop the best products, services and solutions. All qualified individuals are encouraged to apply.", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-latam-mexico-city-mexico-at-airbnb-4283938006", "source": "linkedin_rss_primary", "posted_date": "2025-09-03T13:25:43+00:00", "expires_date": null, "scraped_at": "2025-09-04T03:20:12.418815", "raw_data": {"entry_id": "afbd09bc993f60c6a0fb5ac40e82fcd2", "tags": [], "author": "LinkedIn"}}
{"id": "559d4973b7b3", "title": "CLEAR hiring Lead Product Manager, Mobile in New York, NY", "company": "LinkedIn", "location": "York, NY", "salary_range": "$200,000 - $230,000", "experience_required": null, "skills_mentioned": ["user research", "product launch"], "industry": "healthtech", "description": "CLEAR is seeking a product leader to own and grow our mobile app experience by turning ambitious ideas into secure, scalable, and engaging products that delight members and drive measurable business growth. This role is central to how members experience CLEAR, from frictionless travel to new digital identity solutions. You’ll partner with engineering, design, and business teams to define the roadmap, deliver impactful releases, and continuously improve based on data and customer feedback.What you'll do:Own the product vision and roadmap for CLEAR’s mobile app, aligning with company goals and member needs.Partner closely with Engineering, Design, Marketing, Security, Legal, Operations, and Member Care to move quickly from concept to launch.Balance bold new initiatives with incremental improvements rooted in performance data and user research.Drive measurable results across acquisition, activation, retention, engagement, CSAT, and CLEAR Plus subscription growth.Make informed trade-offs to ensure our app is performant, secure, and scalable on both iOS and Android.What you bring:7+ years of Product Management experience, ideally with a focus on mobile products and cross-platform development.Proven track record leading mobile product development at scale, with fluency in technical architecture, platform capabilities, and trade-off decisions.Experience driving high-impact product launches and improvements through data-driven decision-making.Strong collaboration skills to align diverse stakeholders while keeping member value at the center.Ability to translate complex technical concepts into clear priorities for cross-functional teams.A forward-looking approach through anticipating opportunities and challenges to keep our mobile experience ahead of the curve.Alignment with CLEAR’s values: Be Indefatigable, Bias for Action, Embrace Change, Obsess Over the Customer Experience, Speak Up, Our Great People, Own It.How You'll be Rewarded:At CLEAR we help YOU move forward - because when you’re at your best, we’re at our best. You’ll work with talented team members who are motivated by our mission of making experiences safer and easier. Our hybrid work environment provides flexibility. In our offices, you’ll enjoy benefits like meals and snacks. We invest in your well-being and learning & development with our stipend and reimbursement programs. We offer holistic total rewards, including comprehensive healthcare plans, family building benefits (fertility and adoption/surrogacy support), flexible time off, free OneMedical memberships for you and your dependents, and a 401(k) retirement plan with employer match. The base salary range for this role is $200,000 - $230,000, depending on levels of skills and experience.The base salary range represents the low and high end of CLEAR’s salary range for this position. Salaries will vary depending on various factors which include, but are not limited to location, education, skills, experience and performance. The range listed is just one component of CLEAR’s total compensation package for employees and other rewards may include annual bonuses, commission, Restricted Stock UnitsAbout CLEARHave you ever had that green-light feeling? When you hit every green light and the day just feels like magic. CLEAR's mission is to create frictionless experiences where every day has that feeling. With more than 25+ million passionate members and hundreds of partners around the world, CLEAR’s identity platform is transforming the way people live, work, and travel. Whether it’s at the airport, stadium, or right on your phone, CLEAR connects you to the things that make you, you - unlocking easier, more secure, and more seamless experiences - making them all feel like magic.CLEAR provides reasonable accommodation to qualified individuals with disabilities or protected needs. Please let us know if you require a reasonable accommodation to apply for a job or perform your job. Examples of reasonable accommodation include, but are not limited to, time off, extra breaks, making a change to the application process or work procedures, policy exceptions, providing documents in an alternative format, live captioning or using a sign language interpreter, or using specialized equipment.", "apply_url": "https://www.linkedin.com/jobs/view/lead-product-manager-mobile-at-clear-4267537560", "source": "linkedin_rss_primary", "posted_date": "2025-09-03T09:18:21+00:00", "expires_date": null, "scraped_at": "2025-09-04T03:20:12.423163", "raw_data": {"entry_id": "b142caa59511b6a2aee06482f17d74e1", "tags": [], "author": "LinkedIn"}}
{"id": "33f244fa3275", "title": "LinkedIn hiring Product Manager, Feed Relevance (AI) in Mountain View, CA", "company": "AI", "location": "View, CA", "salary_range": null, "experience_required": "2+ years of experience", "skills_mentioned": ["product strategy", "product metrics"], "industry": "edtech", "description": "Company DescriptionLinkedIn is the world’s largest professional network, built to create economic opportunity for every member of the global workforce. Our products help people make powerful connections, discover exciting opportunities, build necessary skills, and gain valuable insights every day. We’re also committed to providing transformational opportunities for our own employees by investing in their growth. We aspire to create a culture that’s built on trust, care, inclusion, and fun – where everyone can succeed.Join us to transform the way the world works.Job DescriptionThis role can be based in Mountain View or San Francisco, CA.At LinkedIn, our approach to flexible work is centered on trust and optimized for culture, connection, clarity, and the evolving needs of our business. The work location of this role is hybrid, meaning it will be performed both from home and from a LinkedIn office on select days, as determined by the business needs of the team.LinkedIn’s vision is to create economic opportunity for every member of the global workforce. The pandemic has impacted every professional around the world in one way or another, which in turn has vastly accelerated engagement on our platform to a degree we haven’t seen before. We actively turn this engagement into opportunity, as it supercharges our hiring, marketing, selling, and learning marketplaces globally and reduces barriers to economic success. As a result, we are entering yet another explosive period of growth.This growth means we can further the meaningful impact we have on the lives of our 770M+ members. This includes helping someone find jobs/talent, build/nurture their network, give/get help, sell/buy, learn/teach, and so much more. We are helping people to start a business, grow their business, save their business, build their brand, be a mentor/advisor, or simply share information/knowledge to give back to the broader community.In order for us to capitalize on this period of growth and use it to create opportunity for others, we are looking for an AI Product Manager to work on the core ranking of the Feed. This includes how updates in the Feed are optimized for engaging conversations as well as how the Feed helps support other parts of the LinkedIn ecosystem.The Feed AI team selects posts from your network and ranks them alongside ads and recommendations to create the Feed experience on LinkedIn’s home. The Feed is the place where you can have productive and professional conversations with people that you know about interests you care about.ResponsibilitiesPartner with PMs, data scientists, Al, applications, and-infrastructure engineers to lay out a comprehensive Al roadmap.Align product strategy and member experience with model objectives through measurable metrics.Prioritize and help to define new features and model improvementsUnderstand and lead analyses of the competitive environment, customers and product metrics to determine the right set of features to drive engagement and usage on LinkedlnDrive global product requirements definition, product planning and product design (including writing PRDs) of new features and enhancementsClearly communicate product and platform benefits to our users and internal stakeholdersMake data-driven decisions on how best to solve customer challenges by pulling and analyzing data from multiple sources, including experimentsQualificationsBasic Qualifications2+ years of experience in product management or equivalent roleBS/BA Degree in a technology-related field OR equivalent experiencePreferred QualificationsMS degree in a technology-related field3+ years of experience in product management with AI/MLPrior experience with ranking and recommendation / personalization for large feedsStrong analytical skills and comfort making data-driven decisionsExperience in Machine Learning and working with Generative AIAbility to collaborate and lead across multiple partner teams with strong systems thinkingAbility to deep dive into technical details of ML systems with engineers, and metrics with the Data Science teamExperience dealing with multi-sided marketplaceSuggested SkillsApplied AI/MLGenerative AIFeed RankingLinkedIn is committed to fair and equitable compensation practices. The pay range for this role is $126,000 to $207,000. Actual compensation packages are based on several factors that are unique to each candidate, including but not limited to skill set, depth of experience, certifications, and specific work location. This may be different in other locations due to differences in the cost of labor. The total compensation package for this position may also include annual performance bonus, stock, benefits and/or other applicable incentive compensation plans. For more information, visit https://careers.linkedin.com/benefits.Additional InformationEqual Opportunity Statement We seek candidates with a wide range of perspectives and backgrounds and we are proud to be an equal opportunity employer. LinkedIn considers qualified applicants without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class.LinkedIn is committed to offering an inclusive and accessible experience for all job seekers, including individuals with disabilities. Our goal is to foster an inclusive and accessible workplace where everyone has the opportunity to be successful.If you need a reasonable accommodation to search for a job opening, apply for a position, or participate in the interview process, connect with us at accommodations@linkedin.com and describe the specific accommodation requested for a disability-related limitation.Reasonable accommodations are modifications or adjustments to the application or hiring process that would enable you to fully participate in that process. Examples of reasonable accommodations include but are not limited to:Documents in alternate formats or read aloud to youHaving interviews in an accessible locationBeing accompanied by a service dogHaving a sign language interpreter present for the interviewA request for an accommodation will be responded to within three business days. However, non-disability related requests, such as following up on an application, will not receive a response.LinkedIn will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by LinkedIn, or (c) consistent with LinkedIn's legal duty to furnish information.San Francisco Fair Chance Ordinance Pursuant to the San Francisco Fair Chance Ordinance, LinkedIn will consider for employment qualified applicants with arrest and conviction records.Pay Transparency Policy Statement As a federal contractor, LinkedIn follows the Pay Transparency and non-discrimination provisions described at this link: https://lnkd.in/paytransparency.Global Data Privacy Notice for Job Candidates Please follow this link to access the document that provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://legal.linkedin.com/candidate-portal.", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-feed-relevance-ai-at-linkedin-4271463005", "source": "linkedin_rss_primary", "posted_date": "2025-09-03T09:14:07+00:00", "expires_date": null, "scraped_at": "2025-09-04T03:20:12.424282", "raw_data": {"entry_id": "6b767ab96284bd1a042980df301eb083", "tags": [], "author": "LinkedIn"}}
{"id": "279b183c5d14", "title": "Aditi Consulting hiring Product Manager in Austin, TX", "company": "LinkedIn", "location": "Austin, TX", "salary_range": null, "experience_required": null, "skills_mentioned": ["go-to-market", "product launch"], "industry": "healthtech", "description": "Payrate: $65.00 - $67.70/hr. Responsibilities:Own the narrative: Craft the value proposition and positioning for Company Live, shaping how we tell the story to buyers and sellers across all touchpoints.Lead go-to-market (GTM): Drive holistic GTM strategy—from in-product messaging to marketing, PR, customer service, community, and sales—ensuring consistent and compelling communication across the customer journey.Influence the roadmap: Partner with Product and Research to integrate market, customer, and competitive insights into product development. Develop segmentation strategies and size market opportunities.Champion customer voice: Establish feedback loops to gather insights throughout the product lifecycle, shaping both product decisions and messaging frameworks.Drive product launch excellence: Manage GTM planning and execution through collaboration with functional leads; track adoption, engagement, and impact across buyer and seller experiences.Measure what matters: Define success metrics, track performance, and translate insights into action to continuously improve messaging, positioning, and market fit. Pay Transparency: The typical base pay for this role across the U.S. is: $65.00 - $67.70/hr.. Final offer amounts, within the base pay set forth above, are determined by factors including your relevant skills, education and experience and the benefits package you select. Full-time employees are eligible to select from different benefits packages. Packages may include medical, dental, and vision benefits, 10 paid days off, 401(k) plan participation, commuter benefits and life and disability insurance. For information about our collection, use, and disclosure of applicant's personal information as well as applicants' rights over their personal information, please see our Privacy Policy (https://www.aditiconsulting.com/privacy-policy). Aditi Consulting LLC uses AI technology to engage candidates during the sourcing process.  AI technology is used to gather data only and does not replace human-based decision making in employment decisions.  By applying for this position, you agree to Aditi’s use of AI technology, including calls from an AI Voice Recruiter. #AditiConsulting# 25 - 21414", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-at-aditi-consulting-4280430264", "source": "linkedin_rss_primary", "posted_date": "2025-09-04T11:14:16+00:00", "expires_date": null, "scraped_at": "2025-09-04T09:20:12.973032", "raw_data": {"entry_id": "a1f57663e75b66eb728696bb1677d359", "tags": [], "author": "LinkedIn"}}
{"id": "ed0991058222", "title": "Zip Co hiring Senior Product Manager, Product Launch & GTM in New York, NY", "company": "LinkedIn", "location": "York, NY", "salary_range": "$135,000 - $150,000", "experience_required": "7+ years of experience", "skills_mentioned": ["data analysis", "A/B testing", "analytics", "go-to-market", "product launch"], "industry": "fintech", "description": "An outcome-focused Product Manager (7+ years) to develop and lead our go-to-market function who will drive cross-functional programs, use data to improve outcomes, and present results to senior leadershipA GTM leader who will execute end-to-end strategies for high-visibility product launches whose mission will be to drive widespread adoption, and optimize for long-term, sustainable growthRemote-first opportunity for US-based employees with the option to work in-person out of our Manhattan office Start your adventure with Zip Join Zip’s Product Management function and play a pivotal role in shaping the future of our direct-to-consumer and mobile app experiences. If you're passionate about creating intuitive, engaging, and high-impact consumer journeys—and thrive in fast-paced, customer-first environments—this role is for you. You’ll lead a high-performing team focused on driving customer engagement, repeat usage, loyalty, and seamless interactions across Zip’s mobile and web platforms.The Senior Product Manager, Product Launch & GTM is responsible for developing and executing end-to-end go-to-market strategies for high-visibility product launches, partnering cross-functionally with Product, Marketing, and Sales to ensure alignment, drive adoption, and support long-term growth. This role combines program management, customer research, and data analysis to guide positioning, messaging, and marketing efforts, while also monitoring launch performance and presenting results to senior leadership. The ideal candidate has 7+ years of experience in product management or go-to-market roles, strong business acumen, and a proven ability to manage complex, cross-functional initiatives from strategy through execution.Interesting problems you’ll get to solveLead the development and execution of end-to-end GTM strategies for new products, particularly high-visibility, complex, or confidential launches.Partner closely with Product, Marketing, and Sales teams to craft the positioning, messaging, and marketing approaches tailored to core customer segments that produce desired outcomes.Responsible for coordinating with marketing to develop multi-channel content and marketing campaigns that drive widespread adoption and growth for key launches.Monitor launch progress, gather customer feedback, and loop this information back to Product and Sales teams to optimize the GTM strategy for long-term growth.Works extensively with Product, marketing and Sales teams, and serves as the \"glue\" that keeps the organization's most important launches on track, providing flawless program management.Develop detailed program plans and schedules, manage the execution of tasks, and monitor and report on progress, ensuring activities are completed on time and within budget.Skilled in leading customer research initiatives—including surveys, interviews, and behavioral analysis—to uncover actionable insights that inform product positioning, messaging, and post-launch iteration.Conduct data analysis to report launch performance, identify trends, and drive data-driven optimization decisions. Prepare and deliver high-impact presentations to executive stakeholders.Leverage AI tools and capabilities to enhance go-to-market strategies, streamline program execution, uncover customer insights, and optimize launch performance.What You’ll Bring To The TeamBachelor’s degree in a relevant field (e.g., Business, Design, Computer Science, Psychology). Completion of a formal Product Management or Project Management training program is a plus.You bring 7+ years of professional experience in product management, go-to-market, or leadership in a cross-functional environment.You are an experienced project manager who has led GTM execution for mission critical product launches.You move seamlessly between \"big picture\" thinking and leading tactical execution.You can provide flawless program management, managing up, down, and across, serving as the \"glue\" that keeps our organization's most important launches on track.You have strong business insight and the ability to align program goals with strategic business objectives.You are persuasive when using data and metrics to drive improvements and communicating results to senior leadership.You have real experience creating GTM initiatives at scale and working cross-functionally across marketing, product management, analytics, UX, and research.Must have a deep understanding of A/B testing and experimentation frameworks, with a track record of using data to guide product decisions and optimize user outcomes.What You’ll Get In ReturnZip is a place where you’ll get out what you put in. The newness of our sector means we need to move at pace and embrace change, and our promise to you when you join the team is that you’ll feel empowered and trusted to make big things happen quickly.We want you to feel welcome and as though you have the support to be yourself, and care for yourself at work. Because it’s important to us that you make the most of the opportunities you’ll get to grow your skills and your career, and be surrounded by smart, friendly people and leaders that have your back.We think these are just some of the best things about being a Zipster. We will also offer you:Flexible working cultureIncentive programs20 days PTO every yearGenerous paid parental leaveLeading family support policies100% employer covered insuranceBeautiful Union Square office with a casual dress codeLearning and wellness subscription stipendCompany-sponsored 401k matchZip is committed to a straightforward and transparent pay structure. The actual base salary will be determined by various individualized factors, including job-related knowledge, skills, experience, location, internal equity, as well as other objective business considerations.The annual base Pay Range for this position is $135,000 - $150,000. This range reflects our US national compensation (USN). Additional premium percentages may apply based on our tiered premium strategy.Subject to those same considerations, the total compensation package for this position may also include other elements, including a bonus and/or equity awards, in addition to a full range of medical, financial, and/or other benefits.If hired, employees will be in an 'at-will position' and the Company reserves the right to modify base salary (as well as any other discretionary payment or compensation or benefit program) at any time, including for reasons related to individual performance, Company or individual department/team performance, and market factors.Be a part of a team that reflects the diversity of our customersWe pride ourselves on being a workplace that provides equal opportunities to people of all ages, cultural backgrounds, sexual orientations, gender identities, abilities, veteran status, and everything else that makes you unique.Equally, we’re committed to ensuring our recruitment processes are accessible and inclusive. Please let us know If there are any adjustments that need to be made to ensure you have a fair and equitable experience.And finally…get to know usZip Co Limited (ASX: ZIP) is a digital financial services company, offering innovative, people-centered products.Operating in two core markets - Australia and New Zealand (ANZ) and the US, Zip offers access to point-of-sale credit and digital payment services, connecting millions of customers with its global network of tens of thousands of merchants.We’re proud to be a values-led business and our values - Customer First, Own it, Stronger Together and Change the Game - guide us in everything we do.I acknowledge by clicking \"Submit Application\", that the information provided is true and correct. I also understand that any willful dishonesty may render for refusal of this application or immediate termination of employment. By providing your information, you acknowledge that you have read our Zip Applicant and Candidate Privacy Notice and authorize Zip to process your data subject to those terms. Zip participates in the federal government’s E-Verify programBefore you apply, give Zip a try -> rebrand.ly/check-zip-outWe are a proud 2025 Circle Back initiative employer and will respond to every applicant.", "apply_url": "https://www.linkedin.com/jobs/view/senior-product-manager-product-launch-gtm-at-zip-co-4271377572", "source": "linkedin_rss_primary", "posted_date": "2025-09-04T10:01:50+00:00", "expires_date": null, "scraped_at": "2025-09-04T09:20:12.974950", "raw_data": {"entry_id": "a5ed03b25cb9f4236e23ef5c7c020eb1", "tags": [], "author": "LinkedIn"}}
{"id": "76e0bd51c5c3", "title": "Outreach hiring Senior Product Manager, Conversation Intelligence (Kaia) in Seattle, WA", "company": "Kaia", "location": "Seattle, WA", "salary_range": "$165,000-$225,000", "experience_required": "Senior", "skills_mentioned": ["analytics"], "industry": "saas", "description": "About OutreachOutreach, founded in 2014, is the only complete AI Revenue Workflow Platform that helps sales leaders benefit from connected account visibility, performance insights, and higher forecasting accuracy across every GTM team. Outreach infuses agentic AI to power 100s of use cases across sales motions. From new logo prospecting to renewal and expansion, Outreach AI automates workflows and frees sellers to focus on more strategic conversations and actions. Global organizations use Outreach to power their revenue teams, including SAP, Siemens, Snowflake, ZoomInfo, and Verizon to name a few. To learn more, please visit www.outreach.io.The RoleOutreach is seeking a Senior Product Manager with a proven track record for bringing products to market with high customer impact to drive product momentum and revenue growth at a global scale in the B2B SaaS arena. This role will be responsible forKaia platform roadmap and defining a strategy for streamlining Rep workflows.Outreach Kaia gives sales reps all the tools they need to confidently run sales meetings through access to just-in-time content, insights about buyers and real-time analytics about conversation dynamics. Sales reps are able to spend more time helping buyers, and less time taking notes and updating records through Kaia meeting summaries and follow up. Sales Leaders have full deal transparency and all the information they need to coach their reps with AI driven insights and analytics.Your Daily AdventuresWork with internal & external customers and stakeholders to unlock opportunities for Kaia experience Collaborate closely with Data Science to drive and scale AI initiatives Work with research, design, and engineering partners to build differentiated experiences with Kaia. Partner with marketing and GTM teams to rollout the features in a timely and impactful manner Leverage data to deeply understand user needs, drive prioritization, and measure product success Our Vision of YouStrong technical aptitude; deeply familiar with modern application development and guided by a data-centric mindset. Past experience with ML/AI is a strong plus High intellectual horse-power, deeply analytical, high EQ, curious, and process oriented. Knows the art (user love) and science (metrics- based growth) of product management. Strong people skills; can hype up a team to rally behind a common product mission Experience managing broad set of dependencies across multiple squads and communicating with stakeholders effectively while staying focused on priorities under pressure with resource constraints Has launched products and understands that GA is not the final destination, but where the journey with users at large starts). Has worked with GTM teams to position, message, enable, roll out, and train teams on product offerings. Embodies our core values: Become a Trusted Advisor, Win As One Team, and Take Ownership The annual base salary range for this role is $165,000-$225,000 USD. You may also be offered incentive compensation, bonus, restricted stock units, and benefits. Actual compensation is based on factors such as your skills, qualifications, and experience. We also have a location-based compensation structure; there may be a different range for candidates in other locations.", "apply_url": "https://www.linkedin.com/jobs/view/senior-product-manager-conversation-intelligence-kaia-at-outreach-4259922105", "source": "linkedin_rss_primary", "posted_date": "2025-09-04T09:58:19+00:00", "expires_date": null, "scraped_at": "2025-09-04T09:20:12.975547", "raw_data": {"entry_id": "b4dcd0a84e2a93a3a6010863cbb078a6", "tags": [], "author": "LinkedIn"}}
{"id": "d4547afb9c74", "title": "Forte Opening Solutions hiring Product Manager in Charlotte, NC", "company": "LinkedIn", "location": "Charlotte, NC", "salary_range": null, "experience_required": null, "skills_mentioned": ["product strategy", "data analysis", "pricing", "product launch"], "industry": null, "description": "DescriptionAt Forte Opening Solutions, we don't just manufacture doors; we create pathways to possibilities. We empower our employees to shape the future of our industry. Join a team where craftsmanship meets cutting-edge technology, and where your ideas can open new doors. Together, we build not just products, but a culture of excellence and collaboration.OverviewThe Product Manager position requires an individual that is capable of cross-functional leadership and has the ability to drive growth and maximize profitability through the product portfolio.Responsibilities Manages product lifecycle of assigned category, optimizes revenue and maximizes profitability.  Supports product line vision, aligning the portfolio to the end markets, ensuring the product offering meets the needs of current and potential customers.  Provides product portfolio roadmap recommendations for assigned category, aligned with the business product strategy.  Leads cross-functional teams that include marketing, sales, operations, finance, innovation, and product engineering to deliver high impact results on strategic initiatives for both current and new products supporting overall business goals.  Drives Forte innovation efforts for product testing and research to support current offering value proposition.  Monitors current and anticipates future customer and market needs and preferences by implementing voice of customer and industry research.  Provides recommendations on pricing strategies which enhances portfolio profitability through competitive research, internal data analysis and sales interaction.  Ensures accurate product forecasting information, particularly as it pertains to new, discontinued or promotional products.  Monitors activities of critical vendors.  Maintains on-going competitive intelligence to guide pricing, promotions, field activity, customer service and product development.  Seeks legal advice from corporate counsel to ensure propriety of pricing mechanism, trademarks, product labeling, policies and contractual agreements.  Demonstrates competency in Forte’s core values: Customer Delight, Expertise, Easy To Do Business With, Trustworthiness, Own Our Actions, Executional Excellence, and Relentless Curiosity. Qualifications Bachelors’ Degree in Business, Marketing, Engineering, or related field. MBA preferred.  A minimum of 5 years of Product Management experience including new product launch, portfolio analysis, product life cycle management, category simplification, and management of cross-functional teams.  Prior P & L experience.  Possess understanding of frameworks needed to manage a product line across all stages of the product life cycle.  Flexible and able to deal with ambiguity.  Able to think strategically while also enjoying tactical execution of programs.  Ability to lead cross functional teams and influence others.  Analytical and creative problem solver.  Strong on planning and attention to detail.  Strong Microsoft Excel and PowerPoint skills.  Working knowledge of Microsoft project, Smartsheet or similar platform preferred.  Candidate must possess strong skills in written and oral communication with all levels of internal management and outside stakeholders.  Ability to travel up to 30%.", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-at-forte-opening-solutions-4267416748", "source": "linkedin_rss_primary", "posted_date": "2025-09-04T09:43:36+00:00", "expires_date": null, "scraped_at": "2025-09-04T09:20:12.977600", "raw_data": {"entry_id": "5cbd650d8b71ae2875c6348d13fe2d8e", "tags": [], "author": "LinkedIn"}}
{"id": "b391b5cce408", "title": "Stord hiring Product Manager in All, MO", "company": "LinkedIn", "location": "All, MO", "salary_range": null, "experience_required": null, "skills_mentioned": ["KPIs"], "industry": "healthtech", "description": "Stord is The Consumer Experience Company, powering seamless checkout through delivery for today's leading brands. Stord is rapidly growing and is on track to double our revenue in the next 18 months. To meet and exceed this target, Stord is strategically scaling teams across the entire company, and seeking energetic experts to help us achieve our mission.By combining comprehensive commerce-enablement technology with high-volume fulfillment services, Stord provides brands a platform to compete with retail giants. Stord manages over $10 billion of commerce annually through its fulfillment, warehousing, transportation, and operator-built software suite including OMS, Pre- and Post-Purchase, and WMS platforms. Stord is leveling the playing field for all brands to deliver the best consumer experience at scale.With Stord, brands can increase cart conversion, improve unit economics, and drive sustained customer loyalty. Stord’s end-to-end commerce solutions combine best-in-class omnichannel fulfillment and shipping with leading technology to ensure fast shipping, reliable delivery promises, easy access to more channels, and improved margins on every order.Hundreds of leading DTC and B2B companies like AG1, True Classic, Native, Seed Health, quip, goodr, Sundays for Dogs, and more trust Stord to deliver industry-leading consumer experiences on every order. Stord is headquartered in Atlanta with facilities across the United States, Canada, and Europe. Stord is backed by top-tier investors including Kleiner Perkins, Franklin Templeton, Founders Fund, Strike Capital, Baillie Gifford, and Salesforce Ventures.We’re looking for a talented and curious Product Manager to join our team and help shape the future of our platform as we continue to expand. At Stord, Product Managers enjoy a unique vantage point—seeing their work come to life both internally, powering our fulfillment operations, and externally, as a standalone SaaS solution for brands and 3PLs.In this role, you’ll partner closely with our product and engineering teams to drive new feature development, improve existing functionality, and ensure Stord consistently delivers meaningful value across our customers’ supply chains.The ideal candidate has a strong background in e-commerce SaaS, with expertise in revenue/conversion, retention, and post-purchase experiences. You’ll be responsible for understanding customer needs and market dynamics, building a clear roadmap and strategy, and executing with a high degree of ownership—from writing concept docs and tickets to collaborating across GTM and cross-functional teams to drive adoption and sales. You’ll work directly with leadership and take ownership of a key product within Stord’s portfolio.What You'll DoEngage with early adopters and Stord’s broader customer base to uncover pain points, value drivers, and ideal product capabilities to inform and prioritize the roadmap and backlog.Build a deep understanding of the market to identify differentiation opportunities, competitive advantages, and strategies to outpace competitors.Define a clear product vision and roadmap, scoping and documenting detailed requirements for new features in collaboration with engineering.Partner with engineering, design, and cross-functional stakeholders to deliver software collaboratively, efficiently, and successfully.Drive rapid product iteration, adoption, and growth—ensuring measurable impact on customer value and revenue.Develop documentation and resources that support customer onboarding, technical use cases, and marketing initiatives to scale adoption and customer success.Continuously evaluate and reprioritize roadmap projects based on customer needs, company objectives, market dynamics, and KPIs.Conduct both quantitative and qualitative research to validate priorities and inform product decisions.Act as the voice of the customer, translating needs into innovative solutions that strengthen Stord’s offering.Collaborate with the broader product team to refine processes and foster a strong product culture.What You'll NeedA high-ownership, self-starter mindset with the ability to tackle complex problems and move initiatives forward.Experience bringing ideas from concept to launch in a fast-paced, scrappy environment.Strong communication skills to articulate user needs, product value, and engineering scope effectively.Demonstrated ability to drive product innovation and measurable business outcomes.Passion for e-commerce and solving challenges in the customer shopping experience.Strong prioritization skills with the ability to make thoughtful trade-offs.A collaborative approach that balances independence with cross-functional teamwork.Analytical mindset with a mix of strategic thinking, user empathy, and business acumen.Experience in startups or high-growth environments (founding experience a plus).Background in e-commerce SaaS and proven success managing product roadmaps.Hands-on experience across the product lifecycle, from discovery through GTM and adoption.Technical proficiency and the ability to engage effectively with engineering teams.", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-at-stord-4295700560", "source": "linkedin_rss_primary", "posted_date": "2025-09-04T18:30:50+00:00", "expires_date": null, "scraped_at": "2025-09-04T15:20:13.494136", "raw_data": {"entry_id": "20f22d5081de931c7c6166440e18edac", "tags": [], "author": "LinkedIn"}}
{"id": "b1efb0008c71", "title": "NewtonX hiring Growth Product Manager in New York, NY", "company": "LinkedIn", "location": "Remote", "salary_range": null, "experience_required": null, "skills_mentioned": ["roadmapping", "analytics", "figma", "KPIs"], "industry": "healthtech", "description": "Location: Remote or New York, NY (Hybrid)Reports to: Director of ProductAbout NewtonXNewtonX is the leading AI-powered B2B research company that helps businesses make informed decisions by connecting them with verified subject matter experts. We empower clients with the insights needed to make data-driven decisions by connecting them to the world’s most authoritative experts and business professionals through surveys and expert interviews.We have partnered with leading organizations like McKinsey, Microsoft, Pinterest, Figma and beyond to equip them with B2B insights to solve pressing business challenges. Our research has been cited by Fortune, Forbes, TechCrunch, Adweek and more.NewtonX has raised $47M in funding, and as we continue to expand, we’re searching for a driven and strategic Growth Product Manager to grow our expert community and accelerate expert activation.About the RoleWe are seeking a dynamic Growth Product Manager to lead the development of growth-focused products that accelerate the acquisition, activation, and early retention of our expert community (NXC). In this role, you will own the expert growth funnel end-to-end — working at the intersection of product, data, marketing, and operations to identify opportunities, define and deliver growth initiatives, and establish a rigorous experimentation framework. You will collaborate closely with engineering and design to build, launch, and scale products that remove friction, improve conversion, and unlock new growth loops. This is a highly visible role that will directly shape the trajectory of NewtonX’s expert community and fuel the company’s overall growth.If you’re a data-driven, strategic thinker with a track record of optimizing funnels and growing user bases, this is a chance to shape NewtonX’s expert network at a pivotal stage of growth.How You Will Make an ImpactDrive Panel & Growth Strategy - Own the expert acquisition and activation funnel end-to-end. Collaborate with cross-functional teams to assess client research demands, identify gaps in our audience pool, and define high-value target segments of professionals to grow the NewtonX network.Experimentation & Learning- Adopt a hypothesis-driven approach to product-led growth. Run A/B tests, evaluate funnel performance, and rapidly iterate based on insights to improve acquisition, onboarding, and activation metrics.Market & Audience Insights - Partner with Data Analytics to analyze client demand trends, audience supply gaps, and industry-specific opportunities. Use these insights to prioritize efforts on high-value profiles and emerging market needs.Channel & Campaign Optimization - Collaborate closely with the Marketing team to discover, test, and scale new expert acquisition channels — from professional communities and niche newsletters to emerging digital platforms. Co-design targeted campaigns, launch experiments, measure performance, and continuously refine strategies to maximize expert conversion, engagement, and retention.Onboarding & Engagement Flow - Own and optimize the onboarding and sign-up experience. Streamline the journey from account creation to profile completion, ensuring high conversion rates and accelerating expert readiness for project opportunities.Cross-Functional Collaboration - Work closely with Engineering, Product Design, Marketing, and Operations to deliver high-impact initiatives, aligning on priorities and outcomes that fuel sustainable growth.Performance Tracking & Analytics - Define, monitor, and report on key KPIs related to audience acquisition, onboarding success, and activation. Partner with analytics to uncover bottlenecks, measure performance, and inform strategic decisions.Strategic Roadmapping & Leadership Visibility - Shape and maintain the product-led growth roadmap, balancing quick wins with scalable, long-term initiatives. Communicate insights, learnings, and recommendations to leadership, influencing investment decisions and strategic direction.Who You AreExperience: 3–5+ years in Product Management, ideally with exposure to Growth, PLG, or marketplace dynamics.Data-Driven: Skilled at interpreting funnel data, measuring outcomes, and using analytics to drive decisions.Experimentation Mindset: Experience designing, running, and scaling A/B tests or growth experiments.Collaboration: Proven success working across functions (Marketing, Design, Engineering, Ops) to deliver results.Adaptability: Thrives in fast-paced, iterative environments; comfortable balancing short-term tests with long-term strategy.Domain Bonus: Experience with two-sided marketplaces, expert networks, or B2B SaaS is a plus.What We OfferCompetitive compensation with a total comp range of $140-180K (includes base and annual performance bonus) and equity. (Please note that salary and compensation may vary based on skills, experience, performance, and location.)Career advancement and training opportunities.Excellent medical, dental, and vision insurance.401k match with immediate vesting.Health savings/flexible savings account, and pre-tax commuter benefits.Paid time off: vacation, holidays, sick, and parental leave.A diverse, collaborative, and positive culture where we invest in and celebrate each other’s success.Flexible work environment with a focus on work-life balance.Good vibes (happy hours, team projects, and retreats).Equal OpportunityNewtonX is proud to be an equal opportunity workplace. We do not discriminate based upon race, religion, color, national origin, sex, sexual orientation, gender identity/expression, age, status as a protected veteran, status as an individual with a disability, or any other applicable legally protected characteristics.", "apply_url": "https://www.linkedin.com/jobs/view/growth-product-manager-at-newtonx-4295979666", "source": "linkedin_rss_primary", "posted_date": "2025-09-04T18:23:23+00:00", "expires_date": null, "scraped_at": "2025-09-04T15:20:13.495651", "raw_data": {"entry_id": "f836257348466c256dea4b4c5714c275", "tags": [], "author": "LinkedIn"}}
{"id": "5ee5d183d528", "title": "Palo Alto Networks hiring Principal Product Manager - Services in Santa Clara, CA", "company": "LinkedIn", "location": "remote", "salary_range": null, "experience_required": null, "skills_mentioned": ["competitive analysis", "pricing"], "industry": "fintech", "description": "Our MissionAt Palo Alto Networks® everything starts and ends with our mission:Being the cybersecurity partner of choice, protecting our digital way of life.Our vision is a world where each day is safer and more secure than the one before. We are a company built on the foundation of challenging and disrupting the way things are done, and we’re looking for innovators who are as committed to shaping the future of cybersecurity as we are.Who We AreWe take our mission of protecting the digital way of life seriously. We are relentless in protecting our customers and we believe that the unique ideas of every member of our team contributes to our collective success. Our values were crowdsourced by employees and are brought to life through each of us everyday - from disruptive innovation and collaboration, to execution. From showing up for each other with integrity to creating an environment where we all feel included.As a member of our team, you will be shaping the future of cybersecurity. We work fast, value ongoing learning, and we respect each employee as a unique individual. Knowing we all have different needs, our development and personal wellbeing programs are designed to give you choice in how you are supported. This includes our FLEXBenefits wellbeing spending account with over 1,000 eligible items selected by employees, our mental and financial health resources, and our personalized learning opportunities - just to name a few!At Palo Alto Networks, we believe in the power of collaboration and value in-person interactions. This is why our employees generally work full time from our office with flexibility offered where needed. This setup fosters casual conversations, problem-solving, and trusted relationships. Our goal is to create an environment where we all win with precision.Job DescriptionYour CareerWe are seeking talented individuals who can take concept to launch of service offering , execution focused and comfortable executive communication. The individual should be able to show cross functional leadership and drive data based decisions.Your ImpactBuild and launch profitable service offers for post-sales functions (Customer Support , Professional Services and Customer Success) to drive product adoption, customer success and value realizationCreate a business cases for designing & deploying AI post-sales solutions, developing our partner ecosystem and transforming our portfolio that includes assess business viability of services - market opportunity, competitive analysis, formulate pricing strategy Drive concept to launch of service offers, get leadership buy-in, lead and influence cross-functional stakeholders (Product, Engineering, IT, Sales, Operations, GTM, marketing, legal, etc) to drive new service introductionPerform service updates based on internal and external feedbackDrive continuous improvements with data-oriented approach, defining and tracking success metricsDrive transformative change within the organization, wearing multiple hats (strategy development, product & program management, execution) to do what it takes to “move the needle”Marketing support and sales enablement: partner with product marketing to develop customer facing and internal collaterals. Support sales enablement by communicating the value proposition of your servicesWork with product teams to understand product roadmap and offer impacts from product releases and drive service offer updates accordinglyQualificationsYour Experience 5-8 years of product management experience in support services, professional services, customer success or software.Strong communication skills suited for written or verbal presentations at different levels of the organization; influence people around a vision with both local and remote teamsProven relationship-building and influential leadership skillsA proactive self-starter who excels in fast-paced, high-growth environmentsDeep knowledge of customer needs, competition, and market trendsAbility to create service offer strategy and plan based market analysis and customer needsAbility to plan, organize, mediate, and establish priorities to achieve results. Self-motivated, results-focused, well-organized; able to successfully manage multiple priorities and bold business goalsGreat teammate, willing to passionately roll up their sleeves and work cross-functionally to get things doneExperience in project management and overseeing large-scale transformationsAbility to learn new concepts and technologies fastExpertise in the SaaS and/or Enterprise software industry is preferred. Hands-on design & execution of AI solutions, Professional Services & Customer Success is a plus.MBA preferred.Additional InformationThe TeamOur Strategy and Business Operations is a focused team that works on our most critical business challenges to drive and support our industry-leading growth. Your efforts will directly impact the overall strategy and success of a world-leading cybersecurity business. You will collaborate on complex business and technology problems that are top-of-mind for our executives.Compensation DisclosureThe compensation offered for this position will depend on qualifications, experience, and work location. For candidates who receive an offer at the posted level, the starting base salary (for non-sales roles) or base salary + commission target (for sales/commissioned roles) is expected to be between $0 - $0/YR. The offered compensation may also include restricted stock units and a bonus. A description of our employee benefits may be found here.Our CommitmentWe’re problem solvers that take risks and challenge cybersecurity’s status quo. It’s simple: we can’t accomplish our mission without diverse teams innovating, together.We are committed to providing reasonable accommodations for all qualified individuals with a disability. If you require assistance or accommodation due to a disability or special need, please contact us at accommodations@paloaltonetworks.com.Palo Alto Networks is an equal opportunity employer. We celebrate diversity in our workplace, and all qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or other legally protected characteristics.All your information will be kept confidential according to EEO guidelines.Is role eligible for Immigration Sponsorship? No. Please note that we will not sponsor applicants for work visas for this position.", "apply_url": "https://www.linkedin.com/jobs/view/principal-product-manager-services-at-palo-alto-networks-4295943789", "source": "linkedin_rss_primary", "posted_date": "2025-09-04T16:34:14+00:00", "expires_date": null, "scraped_at": "2025-09-04T15:20:13.497515", "raw_data": {"entry_id": "f1afef8cc429ce4facfbf992b1c5737b", "tags": [], "author": "LinkedIn"}}
{"id": "71097c9ac6ea", "title": "Vitamix hiring Associate Product Manager in Olmsted, OH", "company": "LinkedIn", "location": "Olmsted, OH", "salary_range": null, "experience_required": null, "skills_mentioned": ["product strategy", "market research"], "industry": "fintech", "description": "Vitamix is unquestionably the premium brand of high-performance “blenders,” and known for its top-notch company culture and climate. It is an important component of what makes Vitamix unique and successful, and the reason why Vitamix is recognized as a Top Workplace, NorthCoast99 Winner, and Smart Culture Award recipient.Throughout its 100+ year history, Vitamix has encouraged and promoted healthy lifestyles for both its customers and employees. Employees enjoy multiple wellness programs and perks, a free Vitamix machine, and an onsite fitness center. Vitamix also offers a flexible work environment, great work culture, healthy living initiatives like fitness reimbursements, and opportunities for advancement.For consumers, Vitamix can be found domestically in places like William Sonoma, Sur la Table, Crate & Barrel, Target, Amazon, and at Vitamix.com, and is in over 130 countries around the world.Ultimately, Vitamix is the Global-leader in high-performance blending solutions for home and commercial use, is preferred by chefs and is found in many of top restaurants around the world. It is relied upon by culinary schools in the U.S. and has been used to train thousands of students and master chefs worldwide. If it is not a Vitamix, it’s just a blender.Vitamix is seeking an Associate Product Manager to support product development efforts by conducting market research, gathering competitive insights, and assisting in the creation of business cases. They will collaborate with cross-functional teams to align product solutions with business and customer needs. The successful candidate will have an understanding of the product lifecycle and strong financial acumen.Duties & ResponsibilitiesAssist in the development and presentation of business cases for new product development. Support the Product Management team in the development and improvement of product features. Contribute to strategic planning and vision.Support the gathering of information for strategic decision-making, including research on competition, end users, and market trends.Work cross-functionally to ensure product features align with business goals.Track product performance and provide insights into successes and areas for improvement.Train internal departments on new product features and create efficient communication channels.The Ideal Candidate Will Also PossessAlignment with Vitamix’s culture and Guiding Principles which defines its Purpose, Mission, and Values. Communication - Ability to clearly articulate reasoning, explain decisions, and effectively convey complex ideas to different audiences.Collaboration - Demonstrated ability to interface and maintain effective relationships with all levels of employees in a team-oriented environment Critical/Analytical Thinking - Ability to draw valid inferences from available information, understand the implications of different interpretations, and apply knowledge to new situations.Business Acumen - Demonstrated understanding and application of key business principles, including strategic thinking, financial literacy, and market awareness.Reliability/Dependability - Highly reliable, proactive self-starter; can be counted on to complete assignments on timeProficient in MS Office, especially MS ExcelProduct lifecycle managementProduct strategy developmentFinancial acumenMarket research, consumer behavior, and marketing techniquesProject management0-2 years related experienceBachelor's Degree in Business, Marketing or related fieldPhysical DemandsAbility to sit up to 8 hours per day, with walking and standing required frequentlyVisual acuity is required to perform activities such as: preparing and analyzing data, viewing a computer terminal, reading documents, reports, and emailsRepetitive hand movements for tasks like typing or assemblyTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. Reasonable Accommodations may be made to enable qualified individuals with disabilities to perform the essential functions.", "apply_url": "https://www.linkedin.com/jobs/view/associate-product-manager-at-vitamix-4284804966", "source": "linkedin_rss_primary", "posted_date": "2025-09-04T15:08:08+00:00", "expires_date": null, "scraped_at": "2025-09-04T15:20:13.500161", "raw_data": {"entry_id": "ae61ea28a3b32ca4e88a6b91420ccb16", "tags": [], "author": "LinkedIn"}}
{"id": "50741f741cb5", "title": "Snap Inc. hiring Product Manager, Content Growth in Santa Monica, CA", "company": "LinkedIn", "location": "Monica, CA", "salary_range": "$173,000-$259,000", "experience_required": "4+ years of experience", "skills_mentioned": ["product strategy", "user research"], "industry": "healthtech", "description": "Snap Inc is a technology company. We believe the camera presents the greatest opportunity to improve the way people live and communicate. Snap contributes to human progress by empowering people to express themselves, live in the moment, learn about the world, and have fun together. The Company’s three core products are Snapchat, a visual messaging app that enhances your relationships with friends, family, and the world; Lens Studio, an augmented reality platform that powers AR across Snapchat and other services; and its AR glasses, Spectacles.The Product team combines creativity, research, data-driven insights, and operational excellence to shape the experiences that make Snapchat engaging and impactful for our global community. This team of Designers, Product Managers, Data Scientists, Researchers, and Strategists works collaboratively across areas such as Core Growth, User Experience, Bitmoji, Augmented Reality, and Emerging Products. Together, they craft innovative solutions that enhance user connections, elevate content and AR experiences, and drive the growth and evolution of Snapchat's core platform.We’re looking for a Product Manager, Content to join our team at Snap Inc!What you’ll do:Lead the strategy and execution of product features that enhance how our users interact and consume content on Snapchat, focusing on driving meaningful interactions, intuitive playback, and community engagement. Shape how users discover and engage with content across surfaces like Spotlight and Discover. Drive core viewer engagement by improving content sharing and other positive interactions like reposting, favorites, and commenting. Lead rollout of features that tie into the overall Snapchat ecosystem including relevant context (friend interactions, content metadata), and performance of the content feed to drive scalability. Prioritize and manage the roadmap across XFN teams including engineering, design, Data Science, and Ads. Manage and interpret AB tests across viewer experience features. Partner with user research to understand opportunities to improve the experience and be a champion for user needs to delight SnapchattersKnowledge, Skills & Abilities:Proven ability to develop a technical product strategy and translate it into a prioritized, data-driven roadmapStrong technical acumen with the ability to grasp and discuss complex technical concepts and trade-offs with engineering and design teamsExcellent communication and interpersonal skills, with a demonstrated ability to influence and align cross-functional teams and stakeholdersStrong analytical and quantitative skills, with the ability to use data and metrics to back up assumptions and make informed decisionsMinimum Qualifications:BS/BA degree or equivalent years of experience4+ years of experience building and shipping products at a technology company Preferred Qualifications:4+ years of experience in product management, preferably in a platform, UX, or technical roleBachelor’s or Masters degree in Computer Science, Engineering, or a related fieldDirect experience with communication technologies, APIs, and servicesIf you have a disability or special need that requires accommodation, please don’t be shy and provide us some information.\"Default Together\" Policy at Snap: At Snap Inc. we believe that being together in person helps us build our culture faster, reinforce our values, and serve our community, customers and partners better through dynamic collaboration. To reflect this, we practice a “default together” approach and expect our team members to work in an office 4+ days per week.At Snap, we believe that having a team of diverse backgrounds and voices working together will enable us to create innovative products that improve the way people live and communicate. Snap is proud to be an equal opportunity employer, and committed to providing employment opportunities regardless of race, religious creed, color, national origin, ancestry, physical disability, mental disability, medical condition, genetic information, marital status, sex, gender, gender identity, gender expression, pregnancy, childbirth and breastfeeding, age, sexual orientation, military or veteran status, or any other protected classification, in accordance with applicable federal, state, and local laws. EOE, including disability/vets.We are an Equal Opportunity Employer and will consider qualified applicants with criminal histories in a manner consistent with applicable law (by example, the requirements of the San Francisco Fair Chance Ordinance and the Los Angeles Fair Chance Initiative for Hiring, where applicable).Our Benefits: Snap Inc. is its own community, so we’ve got your back! We do our best to make sure you and your loved ones have everything you need to be happy and healthy, on your own terms. Our benefits are built around your needs and include paid parental leave, comprehensive medical coverage, emotional and mental health support programs, and compensation packages that let you share in Snap’s long-term success!CompensationIn the United States, work locations are assigned a pay zone which determines the salary range for the position. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. The starting pay may be negotiable within the salary range for the position. These pay zones may be modified in the future.Zone A (CA, WA, NYC):The base salary range for this position is $173,000-$259,000 annually.Zone B:The base salary range for this position is $164,000-$246,000 annually.Zone C:The base salary range for this position is $147,000-$220,000 annually.This position is eligible for equity in the form of RSUs.", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-content-growth-at-snap-inc-4269250951", "source": "linkedin_rss_primary", "posted_date": "2025-09-04T13:42:13+00:00", "expires_date": null, "scraped_at": "2025-09-04T15:20:13.502646", "raw_data": {"entry_id": "0843b7c8dfdc412280c11f0b4e4a9da2", "tags": [], "author": "LinkedIn"}}
{"id": "1ab5279b0bd7", "title": "Lunit Cancer Screening hiring (Global) Group Product Manager - CXR · Lunit USA in Seattle, WA", "company": "Global", "location": "Seattle, WA", "salary_range": "$180,000-$230,000", "experience_required": "senior", "skills_mentioned": ["product strategy", "stakeholder management", "user stories", "KPIs", "go-to-market", "pricing"], "industry": "healthtech", "description": "\"Conquering cancer through AI\"Lunit, a portmanteau of ‘Learning unit,' is a medical AI software company devoted to providing AI-powered total cancer care. Our AI solutions help discover cancer and predict cancer treatment outcomes, achieving timely and individually tailored cancer treatment.🗨️ About The PositionThe Group Product Manager for Lunit CXR will play a pivotal role in shaping and advancing one of Lunit's most impactful AI-powered medical imaging solutions. This role will be responsible for driving the vision, roadmap, and execution of Lunit CXR to ensure clinical effectiveness, user satisfaction, and global market adoption. Acting as the central hub between cross-functional teams - engineering, AI research, clinical, regulatory, and commercial - this leader will guide product strategy and development from concept through global scale-up.Success in this role means delivering a best-in-class AI diagnostic solution that improves radiology workflows, supports clinical decision-making, and expands access to quality care. The ideal candidate combines a deep understanding of healthcare or medical imaging markets with strong product leadership skills and the ability to execute across complex, regulated environments.Specifically, the Group Product Manager will lead the strategic and operational direction of Lunit CXR, ensuring the product continues to evolve based on customer feedback, market needs, and global healthcare trends. This role will also take ownership of cross-regional product alignment, helping position Lunit as a category leader in AI diagnostics.🚩 Roles & Responsibilities Product Vision & StrategyDefine and own the product vision and roadmap for Lunit CXR, ensuring alignment with business objectives, customer needs, and regulatory requirementsClearly communicate the vision to cross-functional teams and senior stakeholders to drive alignment and shared goals Continuously monitor market trends, user feedback, and competitive and regulatory landscapes to evolve and strengthen product strategy.  Development OversightLead end-to-end product development in close collaboration with engineering, AI research, marketing, clinical, regulatory, and design teamsTranslate the product vision - and complex clinical and technical concepts - into actionable requirements and user stories that deliver real clinical and business valueEnsure timely, high-quality product delivery by managing priorities, technical scope, timelines, and risk across teamsWork closely with radiologists, clinicians, and public health professionals to validate product direction, understand user workflows, and prioritize impactful features.  Business ImpactPartner closely with sales and marketing to shape pricing, packaging, and messaging strategies based on user value and competitive differentiationIdentify new market opportunities, segments, and partnerships to drive expansion and long-term growth for Lunit CXRMonitor and report on business performance related to product initiatives, ensuring alignment with overall company goals and revenue targets Cross-Functional LeadershipPartner with commercial, regulatory, and clinical teams to align product strategy with go-to-market plans and market access requirementsServe as the central point of contact for product-related communications, both internally and externally Team LeadershipMentor junior product managers and contribute to building a high-performing, mission-driven product teamDefine, track, and analyze key product KPIs to evaluate performance, drive adoption, and ensure continuous product improvement informed by data and user insightsRequirements🎯 Qualifications10+ years of product management experience, ideally in health tech, SaMD, SaaS, enterprise software, or medical technology, with direct exposure to AI, radiology, or medical imaging (especially chest imaging)Proven success in driving the full product lifecycle - from concept to global launch - for complex, high-impact products in regulated or mission-critical domainsStrong technical acumen with the ability to understand and contribute to AI/ML product development, data pipelines, and clinical system integrationDemonstrated ability to lead cross-functional teams and collaborate effectively with engineering, design, clinical, regulatory, and commercial functionsStrong understanding of clinical environments, workflows, and end-user needs, particularly within radiology and diagnostic imagingExcellent communication and stakeholder management skills in English, with the ability to influence across levels and geographiesAnalytical, customer-focused, and data-driven mindset, with a track record of using metrics to guide product decisions and performance improvementsBusiness-oriented approach, with a strong grasp of go-to-market strategies, revenue impact, and commercial alignment in global healthcare marketsAccess to high-speed internet (minimum 50 Mbps download, 10 Mbps upload)Access to a quiet, designated home office space free from distractions🏅 Preferred ExperiencesExperience in medical imaging, digital health, or public health productsUnderstanding of global healthcare regulations (e.g., FDA, CE, MDR)Track record of managing and mentoring other PMs or leading product teamsExposure to both start-up and enterprise healthcare environmentsKnowledge of AI-driven healthcare technologies and familiarity with the latest trends in medical imaging and diagnosticsKorean language skills a plus. 📝 How to ApplyCV (resume, free format) submission required🏃♀️ Hiring ProcessDocument Screening → Phone Screening → Competency-based Interview → Panel Interview → Culture-fit Interview → OnboardingReference checks may be conducted during the process🤝 Work Conditions and EnvironmentWork type: full-timeWorking from home (USA)$180,000-$230,000 per year. The compensation range and benefits for this role are based on a full-time schedule for a full calendar year. The salary will vary depending on your job-related skills, geographic location, education, and work experience. Benefits may be pro-rated for those who start working during the calendar yearBenefits include the option to participate in medical, dental, vision, life and disability insurances; a 401K plan with a company match; and paid time off. Lunit USA offers paid family leave benefits to eligible employees where required by applicable law. 🎸 ETCIf you misrepresent your experience or education or provide false or fraudulent information in or with your application, it may be grounds for cancellation of the employmentWe are an Equal Opportunity Employer that does not discriminate on the basis of actual or perceived race, color, creed, religion, national origin, ancestry, citizenship status, age, sex or gender (including pregnancy, childbirth, pregnancy-related conditions, and lactation), gender identity or expression (including transgender status), sexual orientation, marital status, military service and veteran status, physical or mental disability, genetic information, or any other characteristic protected by applicable federal, state, or local laws and ordinances. Our management team is dedicated to this policy with respect to recruitment, hiring, placement, promotion, transfer, training, compensation, benefits, employee activities, access to facilities and programs, and general treatment during employmentLunit USA, Inc. participates in E-Verify. E-Verify electronically compares information entered on the Employment Eligibility Verification, Form I-9, with records contained in Social Security Administration and Department of Homeland Security (DHS) databases. This helps employers verify the identity and employment eligibility of newly hired employees. Right to Work Notice", "apply_url": "https://www.linkedin.com/jobs/view/global-group-product-manager-cxr-%C2%B7-lunit-usa-at-lunit-cancer-screening-4284858515", "source": "linkedin_rss_primary", "posted_date": "2025-09-04T12:18:25+00:00", "expires_date": null, "scraped_at": "2025-09-04T15:20:13.509141", "raw_data": {"entry_id": "339421446f56069f93670faaea92b407", "tags": [], "author": "LinkedIn"}}
