{"id": "07c383a86909", "title": "Nectar Social hiring Product Manager in Palo Alto, CA", "company": "Nectar Social", "location": "Alto, CA", "salary_range": "$170K - $225K", "experience_required": null, "skills_mentioned": ["product strategy", "user research"], "industry": "healthtech", "description": "About UsWe're living through a fundamental shift in how people discover, evaluate, and purchase products. The next generation doesn't respond to traditional marketing—they build relationships with brands through authentic social interactions, seek recommendations from communities they trust, and expect personalized experiences that feel human, not corporate.At Nectar Social, we're building the AI-native social operating system that enables this new era of commerce. We believe every social interaction should deepen the relationship between brands and their communities while creating genuine value for both sides.Founded by ex-Meta product and engineering leaders, we've recently raised $10.6M in funding co-led by GV (Google Ventures) and True Ventures. We're building the future of social commerce—where community, conversation, and commerce converge.The RoleAs a Product Manager at Nectar Social, you'll own core features that integrate AI across social, support, creator, and content workflows, working directly with customers and our engineering team to build products that drive measurable business impact. This is a highly strategic role where speed of execution and customer understanding are critical to our success.In this role, your responsibilities would include:Owning the end-to-end product development process from discovery to launch, working closely with engineering to ship features that matterBeing the voice of the customer - conducting user research, gathering feedback, and translating real needs into product solutionsDefining clear success metrics and making data-driven decisions to continuously improve our productContributing to product strategy and vision, identifying opportunities that drive significant business valueMoving fast and being scrappy - from writing specs to testing features, you'll wear multiple hats and thrive in ambiguityStaying on top of market trends and competitive landscape to ensure we're building the right thingsQualificationsMinimum 3-5+ years of exceptional product management experience in fast-paced environmentsStrong track record of shipping impactful products and features that users loveDeep understanding of social platforms, commerce, or B2B SaaSProduct instincts: Sharp intuition for what makes a great product, backed by data and user insightsExecution excellence: Proven ability to get things done in ambiguous, fast-moving environmentsCommunication: Exceptional ability to articulate product decisions and rally teams around a visionAnalytical mindset: Data-driven approach to problem-solving and decision-makingBonus PointsExperience at high-growth startups from early stage through scaleBackground in social commerce, creator economy, or enterprise toolsUnderstanding of AI/ML technologies and their practical applicationsTechnical background or hands-on experience with developmentTrack record of exceptional academic or professional achievementWe're looking for hungry, ambitious people who want to make a massive impact in the social commerce space. If you're excited about building products from the ground up and aren't afraid to roll up your sleeves, we want to talk to you. What we offerCompensation: Competitive compensation and early equity. Benefits: Health, vision, and dental benefits + 401(k) match. Career Growth: Career mobility into customer leadership, solutions, or product roles. Work Environment: A hybrid team based in Palo Alto with flexibility for in-office collaboration. Exposure to AI: Deep exposure to cutting-edge AI tooling and the opportunity to shape its application within brand teams. Collaborative Culture: A collaborative, ambitious team defining a new category of AI-native marketing infrastructure. Nectar Social is an equal opportunity employer committed to diversity and inclusion.Compensation Range: $170K - $225K", "apply_url": "https://www.linkedin.com/jobs/view/product-manager-at-nectar-social-4296103792", "source": "linkedin_rss_primary", "posted_date": "2025-09-04T20:58:55+00:00", "expires_date": null, "scraped_at": "2025-09-04T18:01:35.703279", "raw_data": {"entry_id": "8f73ed38ffcccc47c78dcce5d44a7cff", "tags": [], "author": "LinkedIn"}}
{"id": "cecceb2590f1", "title": "Upgrade, Inc. hiring Principal Product Manager, Servicing in San Francisco, CA", "company": "Upgrade, Inc.", "location": "Francisco, CA", "salary_range": "$200,000 - $230,000", "experience_required": "Principal", "skills_mentioned": ["data analysis"], "industry": "fintech", "description": "Upgrade helps customers move in the right direction with affordable and responsible financial products. Since 2017, we’ve helped over 7 million customers access over $40 billion in consumer credit. With a relentless focus on improving our customers' financial well-being, we build products that put more money in their pocket and support their journey toward a better financial future. We’re backed by some of the most prominent technology investors and were most recently valued at $6.3B.We’re consistently recognized for our collaborative and inclusive culture. Most recently, we were named one of the World’s Top Fintech Companies by CNBC, Best Places to Work by Built In, Best Places to Work by the San Francisco Business Times, America’s Greatest Workplaces by Newsweek, Best Startup Employer by Forbes, and Healthiest Employers by Phoenix Business Journal. We’re looking for new team members who get excited about designing and delivering new and better products. Come join us and help build a better financial future for millions of people. About the RoleAs the Principal Product Manager, you’ll be a strategic leader for our loan servicing products, from optimizing agent tooling and customer experiences to conceptualizing and implementing collections strategies. This highly influential role requires you to operate with a high degree of autonomy, advising and aligning with executives, and leaders from all areas of the business to execute on the most pressing business objectives. You’ll tackle our most complex challenges and leverage key vendor relationships to drive solutions that directly impact both our business's bottom line and customers' satisfaction. This role is perfect for a passionate product-leader who wants to shape the strategy of a high-performing team with tangible business results. What You’ll Do:Define the long-term vision and strategy for our loan servicing products, leading the charge on our most critical and ambiguous initiatives.Partner with senior leaders in engineering, design, and operations to architect and deliver scalable solutions that meet our ambitious goals.Own the relationships with key external vendors, leveraging their capabilities to accelerate our product roadmap and deliver on our strategic vision.Own and drive key business outcomes, using deep customer insights and data to measure success and inform your decisions.Be a subject matter expert: You'll stay up-to-date on industry trends and the regulatory landscape to make thoughtful product servicing decisions.Mentor and elevate other product managers and team members, sharing best practices and raising the entire team's skill set. What We Look For:6+ years of product management experience, with a proven track record of successfully leading major product initiatives from concept to launch, with a strong preference for experience in the credit card or loan servicing space.Deep expertise in consumer lending, specifically in loan servicing, payments, or collections.Exceptional leadership and communication skills, with the ability to influence and build consensus among diverse teams.Proven ability to thrive in ambiguity and tackle highly complex, cross-functional problems with autonomy.Expertise in data analysis and using both quantitative and qualitative insights to inform strategy. What We Offer You: Competitive salary and stock option plan100% paid coverage of medical, dental and vision insurance Flexible PTOCompetitive 401(k) and RRSP programOpportunities for professional growth and development Paid parental leaveHealth & wellness initiativesThe compensation range of this position in San Francisco, CA is USD $200,000 - $230,000 annually plus equity and benefits. Within this range, an individual's base pay will be dependent on a variety of factors, including without limitation, job-related knowledge, skills, education, and experience.  We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. Upgrade does not accept unsolicited resumes from staffing agencies, search firms, or any third parties. Any resume submitted to any employee of Upgrade without a prior written agreement in place will be considered the property of Upgrade, and Upgrade will not be obligated to pay any referral or placement fee. Agencies must obtain advance written approval from Upgrade's Talent Acquisition department to submit resumes and only in conjunction with a valid, fully executed agreement. English is required for all positions, as it involves interacting with staff at Upgrade's offices worldwide.", "apply_url": "https://www.linkedin.com/jobs/view/principal-product-manager-servicing-at-upgrade-inc-4296104179", "source": "linkedin_rss_primary", "posted_date": "2025-09-04T19:51:20+00:00", "expires_date": null, "scraped_at": "2025-09-04T18:01:35.705529", "raw_data": {"entry_id": "a5c184355edc575e34dee402bebc1658", "tags": [], "author": "LinkedIn"}}
